nl_question,sparql_partial_uri,sparql_complete_uri
Find the list of distinct ranks for faculty.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_rank WHERE { ?T1 a :faculty . ?T1 :rank ?T1_rank . }",SELECT DISTINCT ?T1_rank WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . }
Show all the distinct buildings that have faculty rooms.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_building WHERE { ?T1 a :faculty . ?T1 :building ?T1_building . }",SELECT DISTINCT ?T1_building WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/building> ?T1_building . }
"Show the rank, first name, and last name for all the faculty.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_rank ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :rank ?T1_rank . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . }",SELECT ?T1_rank ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . }
"Show the first name, last name, and phone number for all female faculty members.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname ?T1_phone WHERE { ?T1 a :faculty . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :phone ?T1_phone . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'F') . }",SELECT ?T1_fname ?T1_lname ?T1_phone WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/phone> ?T1_phone . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'F') . }
Show ids for all the male faculty.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_facid WHERE { ?T1 a :faculty . ?T1 :facid ?T1_facid . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'M') . }",SELECT ?T1_facid WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/facid> ?T1_facid . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'M') . }
Count the number of female Professors we have.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :sex ?T1_sex . ?T1 :rank ?T1_rank . FILTER(?T1_sex = 'F' && ?T1_rank = 'Professor') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_sex = 'F' && ?T1_rank = 'Professor') . }
"Show the phone, room, and building for the faculty named Jerry Prince.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_phone ?T1_room ?T1_building WHERE { ?T1 a :faculty . ?T1 :phone ?T1_phone . ?T1 :room ?T1_room . ?T1 :building ?T1_building . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . FILTER(?T1_fname = 'Jerry' && ?T1_lname = 'Prince') . }",SELECT ?T1_phone ?T1_room ?T1_building WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/phone> ?T1_phone . ?T1 <http://valuenet/ontop/room> ?T1_room . ?T1 <http://valuenet/ontop/building> ?T1_building . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . FILTER(?T1_fname = 'Jerry' && ?T1_lname = 'Prince') . }
Count the number of Professors who have office in building NEB.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :rank ?T1_rank . ?T1 :building ?T1_building . FILTER(?T1_rank = 'Professor' && ?T1_building = 'NEB') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/building> ?T1_building . FILTER(?T1_rank = 'Professor' && ?T1_building = 'NEB') . }
Show the first name and last name for all the instructors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :rank ?T1_rank . FILTER(?T1_rank = 'Instructor') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_rank = 'Instructor') . }
Show all the buildings along with the number of faculty members the buildings have.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :building ?T1_building . } GROUP BY ?T1_building",SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/building> ?T1_building . } GROUP BY ?T1_building
Find the building that has the largest number of faculty members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :building ?T1_building . } GROUP BY ?T1_building ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/building> ?T1_building . } GROUP BY ?T1_building ORDER BY DESC (?aggregation_all) LIMIT 1
Show all the buildings that have at least 10 professors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building WHERE { ?T1 a :faculty . ?T1 :building ?T1_building . ?T1 :rank ?T1_rank . FILTER(?T1_rank = 'Professor') . } GROUP BY ?T1_building HAVING(count( *) >= 10)",SELECT ?T1_building WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/building> ?T1_building . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_rank = 'Professor') . } GROUP BY ?T1_building HAVING(count( *) >= 10)
"For each faculty rank, show the number of faculty members who have it.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :rank ?T1_rank . } GROUP BY ?T1_rank",SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . } GROUP BY ?T1_rank
Find the faculty rank that has the least members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :rank ?T1_rank . } GROUP BY ?T1_rank ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . } GROUP BY ?T1_rank ORDER BY ASC (?aggregation_all) LIMIT 1
Show the number of male and female assistant professors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_sex (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T1 :sex ?T1_sex . ?T1 :rank ?T1_rank . FILTER(?T1_rank = 'AsstProf') . } GROUP BY ?T1_sex",SELECT ?T1_sex (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_rank = 'AsstProf') . } GROUP BY ?T1_sex
Who is the advisor of Linda Smith? Give me the first name and last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :ref-fac ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T15 a :participates_in . ?T15 :ref-act ?T14 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T2 a :student . ?T15 :ref-stu ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T15 a <http://valuenet/ontop/participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/student> . ?T15 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Linda' && ?T2_lname = 'Smith') . }
Show the ids of students whose advisors are professors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :student . ?T13 a :participates_in . ?T13 :ref-stu ?T1 . ?T1 :stuid ?T1_stuid . ?T2 :rank ?T2_rank . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :stuid ?T1_stuid . ?T2 :rank ?T2_rank . ?T15 a :faculty_participates_in . ?T15 :ref-act ?T14 . ?T1 :stuid ?T1_stuid . ?T2 :rank ?T2_rank . ?T2 a :faculty . ?T15 :ref-fac ?T2 . ?T1 :stuid ?T1_stuid . ?T2 :rank ?T2_rank . FILTER(?T2_rank = 'Professor') . }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/participates_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T2 <http://valuenet/ontop/rank> ?T2_rank . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T2 <http://valuenet/ontop/rank> ?T2_rank . ?T15 a <http://valuenet/ontop/faculty_participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T2 <http://valuenet/ontop/rank> ?T2_rank . ?T2 a <http://valuenet/ontop/faculty> . ?T15 <http://valuenet/ontop/ref-fac> ?T2 . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T2 <http://valuenet/ontop/rank> ?T2_rank . FILTER(?T2_rank = 'Professor') . }
Show first name and last name for all the students advised by Michael Goodrich.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T13 a :participates_in . ?T13 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T15 a :faculty_participates_in . ?T15 :ref-act ?T14 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T2 a :faculty . ?T15 :ref-fac ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Michael' && ?T2_lname = 'Goodrich') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/participates_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T15 a <http://valuenet/ontop/faculty_participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/faculty> . ?T15 <http://valuenet/ontop/ref-fac> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Michael' && ?T2_lname = 'Goodrich') . }
"Show the faculty id of each faculty member, along with the number of students he or she advises.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_facid (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :ref-fac ?T1 . ?T1 :facid ?T1_facid . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :facid ?T1_facid . ?T15 a :participates_in . ?T15 :ref-act ?T14 . ?T1 :facid ?T1_facid . } GROUP BY ?T1_facid",SELECT ?T1_facid (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/facid> ?T1_facid . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/facid> ?T1_facid . ?T15 a <http://valuenet/ontop/participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/facid> ?T1_facid . } GROUP BY ?T1_facid
Show all the faculty ranks and the number of students advised by each rank.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :ref-fac ?T1 . ?T1 :rank ?T1_rank . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :rank ?T1_rank . ?T15 a :participates_in . ?T15 :ref-act ?T14 . ?T1 :rank ?T1_rank . } GROUP BY ?T1_rank",SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T15 a <http://valuenet/ontop/participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/rank> ?T1_rank . } GROUP BY ?T1_rank
Give me the the first and last name of the faculty who advises the most students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :ref-fac ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T15 a :participates_in . ?T15 :ref-act ?T14 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . } GROUP BY ?T1_fname ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T15 a <http://valuenet/ontop/participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . } GROUP BY ?T1_fname ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1
Show the ids for all the faculty members who have at least 2 students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_facid WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :ref-fac ?T1 . ?T1 :facid ?T1_facid . ?T14 a :activity . ?T13 :ref-act ?T14 . ?T1 :facid ?T1_facid . ?T15 a :participates_in . ?T15 :ref-act ?T14 . ?T1 :facid ?T1_facid . } GROUP BY ?T1_facid HAVING(count( *) >= 2)",SELECT ?T1_facid WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/facid> ?T1_facid . ?T14 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/facid> ?T1_facid . ?T15 a <http://valuenet/ontop/participates_in> . ?T15 <http://valuenet/ontop/ref-act> ?T14 . ?T1 <http://valuenet/ontop/facid> ?T1_facid . } GROUP BY ?T1_facid HAVING(count( *) >= 2)
Show ids for the faculty members who don't advise any student.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_facid as ?col1) WHERE { ?T1 a :faculty . ?T1 :facid ?T1_facid . }} MINUS {SELECT (?T2_advisor as ?col1) WHERE { ?T2 a :student . ?T2 :advisor ?T2_advisor . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_facid as ?col1) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/facid> ?T1_facid . }} MINUS {SELECT (?T2_advisor as ?col1) WHERE { ?T2 a <http://valuenet/ontop/student> . ?T2 <http://valuenet/ontop/advisor> ?T2_advisor . } } }
List all the activities we have.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_activity_name WHERE { ?T1 a :activity . ?T1 :activity_name ?T1_activity_name . }",SELECT ?T1_activity_name WHERE { ?T1 a <http://valuenet/ontop/activity> . ?T1 <http://valuenet/ontop/activity_name> ?T1_activity_name . }
Find the number of activities available.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/activity> . }
Give me the number of faculty members who participate in an activity,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_facid) as ?aggregation_T1_facid_97 ) WHERE { ?T1 a :faculty_participates_in . ?T1 :facid ?T1_facid . }",SELECT DISTINCT (count(DISTINCT ?T1_facid) as ?aggregation_T1_facid_97 ) WHERE { ?T1 a <http://valuenet/ontop/faculty_participates_in> . ?T1 <http://valuenet/ontop/facid> ?T1_facid . }
Show the ids of the faculty who don't participate in any activity.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_facid as ?col1) WHERE { ?T1 a :faculty . ?T1 :facid ?T1_facid . }} MINUS {SELECT (?T2_facid as ?col1) WHERE { ?T2 a :faculty_participates_in . ?T2 :facid ?T2_facid . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_facid as ?col1) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/facid> ?T1_facid . }} MINUS {SELECT (?T2_facid as ?col1) WHERE { ?T2 a <http://valuenet/ontop/faculty_participates_in> . ?T2 <http://valuenet/ontop/facid> ?T2_facid . } } }
Show the ids of all the faculty members who participate in an activity and advise a student.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_facid WHERE { ?T1 a :faculty_participates_in . ?T1 :facid ?T1_facid . FILTER (?T1_facid in (?T2_advisor)) . ?T2 a :student . ?T2 :advisor ?T2_advisor . }",SELECT DISTINCT ?T1_facid WHERE { ?T1 a <http://valuenet/ontop/faculty_participates_in> . ?T1 <http://valuenet/ontop/facid> ?T1_facid . FILTER (?T1_facid in (?T2_advisor)) . ?T2 a <http://valuenet/ontop/student> . ?T2 <http://valuenet/ontop/advisor> ?T2_advisor . }
Find the number of activities Mark Giuliano is involved in.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty_participates_in . ?T2 a :faculty . ?T1 :ref-fac ?T2 . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty_participates_in> . ?T2 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/ref-fac> ?T2 . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') . }
Show the names of all the activities Mark Giuliano participates in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_activity_name WHERE { ?T1 a :activity . ?T13 a :faculty_participates_in . ?T13 :ref-act ?T1 . ?T1 :activity_name ?T1_activity_name . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T2 a :faculty . ?T13 :ref-fac ?T2 . ?T1 :activity_name ?T1_activity_name . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') . }",SELECT ?T1_activity_name WHERE { ?T1 a <http://valuenet/ontop/activity> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-act> ?T1 . ?T1 <http://valuenet/ontop/activity_name> ?T1_activity_name . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/faculty> . ?T13 <http://valuenet/ontop/ref-fac> ?T2 . ?T1 <http://valuenet/ontop/activity_name> ?T1_activity_name . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Mark' && ?T2_lname = 'Giuliano') . }
"Show the first and last name of all the faculty members who participated in some activity, together with the number of activities they participated in.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname (count( *) as ?aggregation_all) ?T1_facid WHERE { ?T1 a :faculty . ?T2 a :faculty_participates_in . ?T2 :ref-fac ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :facid ?T1_facid . } GROUP BY ?T1_fname ?T1_lname ?T1_facid",SELECT ?T1_fname ?T1_lname (count( *) as ?aggregation_all) ?T1_facid WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T2 a <http://valuenet/ontop/faculty_participates_in> . ?T2 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/facid> ?T1_facid . } GROUP BY ?T1_fname ?T1_lname ?T1_facid
Show all the activity names and the number of faculty involved in each activity.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . ?T2 a :faculty_participates_in . ?T2 :ref-act ?T1 . ?T1 :activity_name ?T1_activity_name . } GROUP BY ?T1_activity_name",SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/activity> . ?T2 a <http://valuenet/ontop/faculty_participates_in> . ?T2 <http://valuenet/ontop/ref-act> ?T1 . ?T1 <http://valuenet/ontop/activity_name> ?T1_activity_name . } GROUP BY ?T1_activity_name
Find the first and last name of the faculty who is involved in the largest number of activities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :faculty_participates_in . ?T2 :ref-fac ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . } GROUP BY ?T1_fname ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T2 a <http://valuenet/ontop/faculty_participates_in> . ?T2 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . } GROUP BY ?T1_fname ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1
Show the ids of the students who don't participate in any activity.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :participates_in . ?T2 :stuid ?T2_stuid . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a <http://valuenet/ontop/participates_in> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . } } }
Show the ids for all the students who participate in an activity and are under 20.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :participates_in . ?T1 :stuid ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a :student . ?T2 :stuid ?T2_stuid . ?T2 :age ?T2_age . FILTER(?T2_age < 20) . }",SELECT DISTINCT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/participates_in> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a <http://valuenet/ontop/student> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age < 20) . }
Tell me the first and last name of the student who has the most activities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a :student . ?T2 a :participates_in . ?T2 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . } GROUP BY ?T1_fname ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_fname (count( *) as ?aggregation_all) ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/participates_in> . ?T2 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . } GROUP BY ?T1_fname ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1
Find the name of the activity that has the largest number of student participants.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :activity . ?T2 a :participates_in . ?T2 :ref-act ?T1 . ?T1 :activity_name ?T1_activity_name . } GROUP BY ?T1_activity_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_activity_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/activity> . ?T2 a <http://valuenet/ontop/participates_in> . ?T2 <http://valuenet/ontop/ref-act> ?T1 . ?T1 <http://valuenet/ontop/activity_name> ?T1_activity_name . } GROUP BY ?T1_activity_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the first names of the faculty members who are playing Canoeing or Kayaking.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :faculty_participates_in . ?T13 :ref-fac ?T1 . ?T1 :lname ?T1_lname . ?T2 :activity_name ?T2_activity_name . ?T2 :activity_name ?T2_activity_name . ?T2 a :activity . ?T13 :ref-act ?T2 . ?T1 :lname ?T1_lname . ?T2 :activity_name ?T2_activity_name . ?T2 :activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing' || ?T2_activity_name = 'Kayaking') . }",SELECT DISTINCT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/faculty_participates_in> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/activity_name> ?T2_activity_name . ?T2 <http://valuenet/ontop/activity_name> ?T2_activity_name . ?T2 a <http://valuenet/ontop/activity> . ?T13 <http://valuenet/ontop/ref-act> ?T2 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/activity_name> ?T2_activity_name . ?T2 <http://valuenet/ontop/activity_name> ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing' || ?T2_activity_name = 'Kayaking') . }
Find the first names of professors who are not playing Canoeing or Kayaking.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a :faculty . ?T1 :lname ?T1_lname . ?T1 :rank ?T1_rank . FILTER(?T1_rank = 'Professor') . }} MINUS {SELECT DISTINCT (?T2_lname as ?col1) WHERE { ?T2 a :faculty . ?T14 a :faculty_participates_in . ?T14 :ref-fac ?T2 . ?T2 :lname ?T2_lname . ?T3 :activity_name ?T3_activity_name . ?T3 :activity_name ?T3_activity_name . ?T3 a :activity . ?T14 :ref-act ?T3 . ?T2 :lname ?T2_lname . ?T3 :activity_name ?T3_activity_name . ?T3 :activity_name ?T3_activity_name . FILTER(?T3_activity_name = 'Canoeing' || ?T3_activity_name = 'Kayaking') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_rank = 'Professor') . }} MINUS {SELECT DISTINCT (?T2_lname as ?col1) WHERE { ?T2 a <http://valuenet/ontop/faculty> . ?T14 a <http://valuenet/ontop/faculty_participates_in> . ?T14 <http://valuenet/ontop/ref-fac> ?T2 . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T3 <http://valuenet/ontop/activity_name> ?T3_activity_name . ?T3 <http://valuenet/ontop/activity_name> ?T3_activity_name . ?T3 a <http://valuenet/ontop/activity> . ?T14 <http://valuenet/ontop/ref-act> ?T3 . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T3 <http://valuenet/ontop/activity_name> ?T3_activity_name . ?T3 <http://valuenet/ontop/activity_name> ?T3_activity_name . FILTER(?T3_activity_name = 'Canoeing' || ?T3_activity_name = 'Kayaking') . } } }
Find the ids of the students who participate in Canoeing and Kayaking.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :participates_in . ?T2 a :activity . ?T1 :ref-act ?T2 . ?T1 :stuid ?T1_stuid . ?T2 :activity_name ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_stuid in (?T3_stuid)) . ?T3 a :participates_in . ?T4 a :activity . ?T3 :ref-act ?T4 . ?T3 :stuid ?T3_stuid . ?T4 :activity_name ?T4_activity_name . FILTER(?T4_activity_name = 'Kayaking') . }",SELECT DISTINCT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/participates_in> . ?T2 a <http://valuenet/ontop/activity> . ?T1 <http://valuenet/ontop/ref-act> ?T2 . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T2 <http://valuenet/ontop/activity_name> ?T2_activity_name . FILTER(?T2_activity_name = 'Canoeing') . FILTER (?T1_stuid in (?T3_stuid)) . ?T3 a <http://valuenet/ontop/participates_in> . ?T4 a <http://valuenet/ontop/activity> . ?T3 <http://valuenet/ontop/ref-act> ?T4 . ?T3 <http://valuenet/ontop/stuid> ?T3_stuid . ?T4 <http://valuenet/ontop/activity_name> ?T4_activity_name . FILTER(?T4_activity_name = 'Kayaking') . }
