nl_question,sparql_partial_uri,sparql_complete_uri
List the description of all aircrafts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_description WHERE { ?T1 a :aircraft . ?T1 :description ?T1_description . }",SELECT ?T1_description WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T1 <http://valuenet/ontop/description> ?T1_description . }
What are the total number of Domestic Passengers of airports that contain the word 'London'.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_domestic_passengers) as ?aggregation_T1_domestic_passengers_69 ) WHERE { ?T1 a :airport . ?T1 :domestic_passengers ?T1_domestic_passengers . ?T1 :airport_name ?T1_airport_name . FILTER(contains (?T1_airport_name, 'London')) . }","SELECT (sum( ?T1_domestic_passengers) as ?aggregation_T1_domestic_passengers_69 ) WHERE { ?T1 a <http://valuenet/ontop/airport> . ?T1 <http://valuenet/ontop/domestic_passengers> ?T1_domestic_passengers . ?T1 <http://valuenet/ontop/airport_name> ?T1_airport_name . FILTER(contains (?T1_airport_name, 'London')) . }"
What are the maximum and minimum number of transit passengers of all aiports.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_transit_passengers) as ?aggregation_T1_transit_passengers_113 ) (min( ?T1_transit_passengers) as ?aggregation_T1_transit_passengers_11 ) WHERE { ?T1 a :airport . ?T1 :transit_passengers ?T1_transit_passengers . ?T1 :transit_passengers ?T1_transit_passengers . }",SELECT (max( ?T1_transit_passengers) as ?aggregation_T1_transit_passengers_113 ) (min( ?T1_transit_passengers) as ?aggregation_T1_transit_passengers_11 ) WHERE { ?T1 a <http://valuenet/ontop/airport> . ?T1 <http://valuenet/ontop/transit_passengers> ?T1_transit_passengers . ?T1 <http://valuenet/ontop/transit_passengers> ?T1_transit_passengers . }
List all pilot names in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/pilot> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
List names of all pilot aged 30 or younger in descending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :name ?T1_name . ?T1 :name ?T1_name . ?T1 :age ?T1_age . FILTER(?T1_age <= 30) . } ORDER BY DESC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/pilot> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age <= 30) . } ORDER BY DESC (?T1_name)
Please show the names of aircrafts associated with airport with name 'London Gatwick'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :ref-aircraft ?T1 . ?T1 :aircraft ?T1_aircraft . ?T2 :airport_name ?T2_airport_name . ?T2 a :airport . ?T13 :ref-airport ?T2 . ?T1 :aircraft ?T1_aircraft . ?T2 :airport_name ?T2_airport_name . FILTER(?T2_airport_name = 'London Gatwick') . }",SELECT ?T1_aircraft WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T13 a <http://valuenet/ontop/airport_aircraft> . ?T13 <http://valuenet/ontop/ref-aircraft> ?T1 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T2 <http://valuenet/ontop/airport_name> ?T2_airport_name . ?T2 a <http://valuenet/ontop/airport> . ?T13 <http://valuenet/ontop/ref-airport> ?T2 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T2 <http://valuenet/ontop/airport_name> ?T2_airport_name . FILTER(?T2_airport_name = 'London Gatwick') . }
Please show the names and descriptions of aircrafts associated with airports that have a total number of passengers bigger than 10000000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_aircraft ?T1_description WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :ref-aircraft ?T1 . ?T1 :aircraft ?T1_aircraft . ?T1 :description ?T1_description . ?T2 :total_passengers ?T2_total_passengers . ?T2 a :airport . ?T13 :ref-airport ?T2 . ?T1 :aircraft ?T1_aircraft . ?T1 :description ?T1_description . ?T2 :total_passengers ?T2_total_passengers . FILTER(?T2_total_passengers > 10000000) . }",SELECT ?T1_aircraft ?T1_description WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T13 a <http://valuenet/ontop/airport_aircraft> . ?T13 <http://valuenet/ontop/ref-aircraft> ?T1 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T1 <http://valuenet/ontop/description> ?T1_description . ?T2 <http://valuenet/ontop/total_passengers> ?T2_total_passengers . ?T2 a <http://valuenet/ontop/airport> . ?T13 <http://valuenet/ontop/ref-airport> ?T2 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T1 <http://valuenet/ontop/description> ?T1_description . ?T2 <http://valuenet/ontop/total_passengers> ?T2_total_passengers . FILTER(?T2_total_passengers > 10000000) . }
Please list the location and the winning aircraft name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location ?T2_aircraft WHERE { ?T1 a :match . ?T2 a :aircraft . ?T1 :ref-winning_aircraft ?T2 . ?T1 :location ?T1_location . ?T2 :aircraft ?T2_aircraft . }",SELECT ?T1_location ?T2_aircraft WHERE { ?T1 a <http://valuenet/ontop/match> . ?T2 a <http://valuenet/ontop/aircraft> . ?T1 <http://valuenet/ontop/ref-winning_aircraft> ?T2 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/aircraft> ?T2_aircraft . }
List the name of the aircraft that has been named winning aircraft the most number of times.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :ref-winning_aircraft ?T1 . ?T1 :aircraft ?T1_aircraft . } GROUP BY ?T1_aircraft ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_aircraft (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T2 a <http://valuenet/ontop/match> . ?T2 <http://valuenet/ontop/ref-winning_aircraft> ?T1 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . } GROUP BY ?T1_aircraft ORDER BY DESC (?aggregation_all) LIMIT 1
List names of all pilot in descending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/pilot> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age)
List the names of aircrafts and that won matches at least twice.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T2 a :match . ?T2 :ref-winning_aircraft ?T1 . ?T1 :aircraft ?T1_aircraft . } GROUP BY ?T1_aircraft HAVING(count( *) >= 2)",SELECT ?T1_aircraft WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T2 a <http://valuenet/ontop/match> . ?T2 <http://valuenet/ontop/ref-winning_aircraft> ?T1 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . } GROUP BY ?T1_aircraft HAVING(count( *) >= 2)
List the names of aircrafts and that did not win any match.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T1 :aircraft ?T1_aircraft . ?T1 :aircraft_id ?T1_aircraft_id . FILTER(?T1_aircraft_id not in (?T22_winning_aircraft)) . {SELECT ?T22_winning_aircraft WHERE { ?T22 a :match . ?T22 :winning_aircraft ?T22_winning_aircraft . } } }",SELECT ?T1_aircraft WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T1 <http://valuenet/ontop/aircraft_id> ?T1_aircraft_id . FILTER(?T1_aircraft_id not in (?T22_winning_aircraft)) . {SELECT ?T22_winning_aircraft WHERE { ?T22 a <http://valuenet/ontop/match> . ?T22 <http://valuenet/ontop/winning_aircraft> ?T22_winning_aircraft . } } }
Show the names of aircrafts that are associated with both an airport named 'London Heathrow' and an airport named 'London Gatwick',"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_aircraft WHERE { ?T1 a :aircraft . ?T13 a :airport_aircraft . ?T13 :ref-aircraft ?T1 . ?T1 :aircraft ?T1_aircraft . ?T2 :airport_name ?T2_airport_name . ?T2 a :airport . ?T13 :ref-airport ?T2 . ?T1 :aircraft ?T1_aircraft . ?T2 :airport_name ?T2_airport_name . FILTER(?T2_airport_name = 'London Heathrow') . FILTER (?T1_aircraft in (?T3_aircraft)) . ?T3 a :aircraft . ?T15 a :airport_aircraft . ?T15 :ref-aircraft ?T3 . ?T3 :aircraft ?T3_aircraft . ?T4 :airport_name ?T4_airport_name . ?T4 a :airport . ?T15 :ref-airport ?T4 . ?T3 :aircraft ?T3_aircraft . ?T4 :airport_name ?T4_airport_name . FILTER(?T4_airport_name = 'London Gatwick') . }",SELECT DISTINCT ?T1_aircraft WHERE { ?T1 a <http://valuenet/ontop/aircraft> . ?T13 a <http://valuenet/ontop/airport_aircraft> . ?T13 <http://valuenet/ontop/ref-aircraft> ?T1 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T2 <http://valuenet/ontop/airport_name> ?T2_airport_name . ?T2 a <http://valuenet/ontop/airport> . ?T13 <http://valuenet/ontop/ref-airport> ?T2 . ?T1 <http://valuenet/ontop/aircraft> ?T1_aircraft . ?T2 <http://valuenet/ontop/airport_name> ?T2_airport_name . FILTER(?T2_airport_name = 'London Heathrow') . FILTER (?T1_aircraft in (?T3_aircraft)) . ?T3 a <http://valuenet/ontop/aircraft> . ?T15 a <http://valuenet/ontop/airport_aircraft> . ?T15 <http://valuenet/ontop/ref-aircraft> ?T3 . ?T3 <http://valuenet/ontop/aircraft> ?T3_aircraft . ?T4 <http://valuenet/ontop/airport_name> ?T4_airport_name . ?T4 a <http://valuenet/ontop/airport> . ?T15 <http://valuenet/ontop/ref-airport> ?T4 . ?T3 <http://valuenet/ontop/aircraft> ?T3_aircraft . ?T4 <http://valuenet/ontop/airport_name> ?T4_airport_name . FILTER(?T4_airport_name = 'London Gatwick') . }
Show all information on the airport that has the largest number of international passengers.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :airport . ?T1 :international_passengers ?T1_international_passengers . } ORDER BY DESC (?T1_international_passengers) LIMIT 1",SELECT * WHERE { ?T1 a <http://valuenet/ontop/airport> . ?T1 <http://valuenet/ontop/international_passengers> ?T1_international_passengers . } ORDER BY DESC (?T1_international_passengers) LIMIT 1
find the name and age of the pilot who has won the most number of times among the pilots who are younger than 30.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_age WHERE { ?T1 a :pilot . ?T2 a :match . ?T2 :ref-winning_pilot ?T1 . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age < 30) . } GROUP BY ?T1_name ?T1_age ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_age WHERE { ?T1 a <http://valuenet/ontop/pilot> . ?T2 a <http://valuenet/ontop/match> . ?T2 <http://valuenet/ontop/ref-winning_pilot> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age < 30) . } GROUP BY ?T1_name ?T1_age ORDER BY DESC (?aggregation_all) LIMIT 1
find the name of pilots who did not win the matches held in the country of Australia.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :pilot . ?T1 :name ?T1_name . ?T1 :pilot_id ?T1_pilot_id . FILTER(?T1_pilot_id not in (?T22_country)) . {SELECT ?T22_winning_pilot WHERE { ?T22 a :match . ?T22 :winning_pilot ?T22_winning_pilot . ?T22 :country ?T22_country . FILTER(?T22_country = 'Australia') . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/pilot> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/pilot_id> ?T1_pilot_id . FILTER(?T1_pilot_id not in (?T22_country)) . {SELECT ?T22_winning_pilot WHERE { ?T22 a <http://valuenet/ontop/match> . ?T22 <http://valuenet/ontop/winning_pilot> ?T22_winning_pilot . ?T22 <http://valuenet/ontop/country> ?T22_country . FILTER(?T22_country = 'Australia') . } } }
