nl_question,sparql_partial_uri,sparql_complete_uri
Show all allergy types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergytype ?T1_allergytype . }",SELECT DISTINCT ?T1_allergytype WHERE { ?T1 a <http://valuenet/ontop/allergy_type> . ?T1 <http://valuenet/ontop/allergytype> ?T1_allergytype . }
Show all allergies and their types.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_allergy ?T1_allergytype WHERE { ?T1 a :allergy_type . ?T1 :allergy ?T1_allergy . ?T1 :allergytype ?T1_allergytype . }",SELECT ?T1_allergy ?T1_allergytype WHERE { ?T1 a <http://valuenet/ontop/allergy_type> . ?T1 <http://valuenet/ontop/allergy> ?T1_allergy . ?T1 <http://valuenet/ontop/allergytype> ?T1_allergytype . }
Show all allergies with type food.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_allergy WHERE { ?T1 a :allergy_type . ?T1 :allergy ?T1_allergy . ?T1 :allergytype ?T1_allergytype . FILTER(?T1_allergytype = 'food') . }",SELECT DISTINCT ?T1_allergy WHERE { ?T1 a <http://valuenet/ontop/allergy_type> . ?T1 <http://valuenet/ontop/allergy> ?T1_allergy . ?T1 <http://valuenet/ontop/allergytype> ?T1_allergytype . FILTER(?T1_allergytype = 'food') . }
Show all allergy types and the number of allergies in each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T1 :allergytype ?T1_allergytype . } GROUP BY ?T1_allergytype",SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/allergy_type> . ?T1 <http://valuenet/ontop/allergytype> ?T1_allergytype . } GROUP BY ?T1_allergytype
Show first name and last name for all students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . }
Show all majors.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_major WHERE { ?T1 a :student . ?T1 :major ?T1_major . }",SELECT DISTINCT ?T1_major WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/major> ?T1_major . }
Show all cities where students live.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_city_code WHERE { ?T1 a :student . ?T1 :city_code ?T1_city_code . }",SELECT DISTINCT ?T1_city_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . }
"Show first name, last name, age for all female students. Their sex is F.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname ?T1_age WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :age ?T1_age . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'F') . }",SELECT ?T1_fname ?T1_lname ?T1_age WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'F') . }
Show student ids for all male students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'M') . }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'M') . }
Show all student ids who are older than 20.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :age ?T1_age . FILTER(?T1_age > 20) . }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 20) . }
Give the city that the student whose family name is Kim lives in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city_code WHERE { ?T1 a :student . ?T1 :city_code ?T1_city_code . ?T1 :lname ?T1_lname . FILTER(?T1_lname = 'Kim') . }",SELECT ?T1_city_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . ?T1 <http://valuenet/ontop/lname> ?T1_lname . FILTER(?T1_lname = 'Kim') . }
Give the number of students living in either HKG or CHI.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :city_code ?T1_city_code . ?T1 :city_code ?T1_city_code . FILTER(?T1_city_code = 'HKG' || ?T1_city_code = 'CHI') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . FILTER(?T1_city_code = 'HKG' || ?T1_city_code = 'CHI') . }
"Show the minimum, average, and maximum age of all students.","PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_age) as ?aggregation_T1_age_47 ) (avg( ?T1_age) as ?aggregation_T1_age_76 ) (max( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :age ?T1_age . }",SELECT (min( ?T1_age) as ?aggregation_T1_age_47 ) (avg( ?T1_age) as ?aggregation_T1_age_76 ) (max( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . }
Provide the last name of the youngest student.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :lname ?T1_lname . ?T1 :age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_139)) . {SELECT (min( ?T22_age) as ?aggregation_T22_age_139 ) WHERE { ?T22 a :student . ?T22 :age ?T22_age . } } }",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_139)) . {SELECT (min( ?T22_age) as ?aggregation_T22_age_139 ) WHERE { ?T22 a <http://valuenet/ontop/student> . ?T22 <http://valuenet/ontop/age> ?T22_age . } } }
Show the student id of the oldest student.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :age ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_35)) . {SELECT (max( ?T22_age) as ?aggregation_T22_age_35 ) WHERE { ?T22 a :student . ?T22 :age ?T22_age . } } }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age = (?aggregation_T22_age_35)) . {SELECT (max( ?T22_age) as ?aggregation_T22_age_35 ) WHERE { ?T22 a <http://valuenet/ontop/student> . ?T22 <http://valuenet/ontop/age> ?T22_age . } } }
Show all majors and corresponding number of students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :major ?T1_major . } GROUP BY ?T1_major",SELECT ?T1_major (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/major> ?T1_major . } GROUP BY ?T1_major
Show all ages and corresponding number of students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :age ?T1_age . } GROUP BY ?T1_age",SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . } GROUP BY ?T1_age
Show the average age for male and female students.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_108 ) ?T1_sex WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :sex ?T1_sex . } GROUP BY ?T1_sex",SELECT (avg( ?T1_age) as ?aggregation_T1_age_108 ) ?T1_sex WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/sex> ?T1_sex . } GROUP BY ?T1_sex
Show all cities and corresponding number of students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :city_code ?T1_city_code . } GROUP BY ?T1_city_code",SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . } GROUP BY ?T1_city_code
Show all advisors and corresponding number of students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :advisor ?T1_advisor . } GROUP BY ?T1_advisor",SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/advisor> ?T1_advisor . } GROUP BY ?T1_advisor
Give the advisor with the most students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :advisor ?T1_advisor . } GROUP BY ?T1_advisor ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_advisor (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/advisor> ?T1_advisor . } GROUP BY ?T1_advisor ORDER BY DESC (?aggregation_all) LIMIT 1
Show all student IDs who have at least two allergies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :has_allergy . ?T1 :stuid ?T1_stuid . } GROUP BY ?T1_stuid HAVING(count( *) >= 2)",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/has_allergy> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . } GROUP BY ?T1_stuid HAVING(count( *) >= 2)
Show all allergies with number of students affected.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_allergy (count( *) as ?aggregation_all) WHERE { ?T1 a :has_allergy . ?T1 :allergy ?T1_allergy . } GROUP BY ?T1_allergy",SELECT ?T1_allergy (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/has_allergy> . ?T1 <http://valuenet/ontop/allergy> ?T1_allergy . } GROUP BY ?T1_allergy
Show all allergy type with number of students affected.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a :allergy_type . ?T2 a :has_allergy . ?T2 :ref-allergy ?T1 . ?T1 :allergytype ?T1_allergytype . } GROUP BY ?T1_allergytype",SELECT ?T1_allergytype (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/allergy_type> . ?T2 a <http://valuenet/ontop/has_allergy> . ?T2 <http://valuenet/ontop/ref-allergy> ?T1 . ?T1 <http://valuenet/ontop/allergytype> ?T1_allergytype . } GROUP BY ?T1_allergytype
Find the last name and age of the student who has allergy to both milk and cat.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname ?T1_age WHERE { ?T1 a :student . ?T1 :lname ?T1_lname . ?T1 :age ?T1_age . ?T1 :stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_allergy)) . {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T22 :stuid ?T22_stuid . ?T22 :allergy ?T22_allergy . FILTER(?T22_allergy = 'Milk') . } } }",SELECT ?T1_lname ?T1_age WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER(?T1_stuid in (?T22_allergy)) . {SELECT ?T22_stuid WHERE { ?T22 a <http://valuenet/ontop/has_allergy> . ?T22 <http://valuenet/ontop/stuid> ?T22_stuid . ?T22 <http://valuenet/ontop/allergy> ?T22_allergy . FILTER(?T22_allergy = 'Milk') . } } }
Find the average age of the students who have allergies with food and animal types.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_104 ) WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :stuid ?T1_stuid . FILTER(?T1_stuid in (?T23_allergytype)) . {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T23 a :allergy_type . ?T22 :ref-allergy ?T23 . ?T22 :stuid ?T22_stuid . ?T23 :allergytype ?T23_allergytype . FILTER(?T23_allergytype = 'food') . } } }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_104 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER(?T1_stuid in (?T23_allergytype)) . {SELECT ?T22_stuid WHERE { ?T22 a <http://valuenet/ontop/has_allergy> . ?T23 a <http://valuenet/ontop/allergy_type> . ?T22 <http://valuenet/ontop/ref-allergy> ?T23 . ?T22 <http://valuenet/ontop/stuid> ?T22_stuid . ?T23 <http://valuenet/ontop/allergytype> ?T23_allergytype . FILTER(?T23_allergytype = 'food') . } } }
Find the first name and major of the students who are not allegry to soy.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_major WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :major ?T1_major . ?T1 :stuid ?T1_stuid . FILTER(?T1_stuid not in (?T22_allergy)) . {SELECT ?T22_stuid WHERE { ?T22 a :has_allergy . ?T22 :stuid ?T22_stuid . ?T22 :allergy ?T22_allergy . FILTER(?T22_allergy = 'Soy') . } } }",SELECT ?T1_fname ?T1_major WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/major> ?T1_major . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER(?T1_stuid not in (?T22_allergy)) . {SELECT ?T22_stuid WHERE { ?T22 a <http://valuenet/ontop/has_allergy> . ?T22 <http://valuenet/ontop/stuid> ?T22_stuid . ?T22 <http://valuenet/ontop/allergy> ?T22_allergy . FILTER(?T22_allergy = 'Soy') . } } }
