nl_question,sparql_partial_uri,sparql_complete_uri
Count the total number of apartment bookings.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :apartment_bookings . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/apartment_bookings> . }
Show the start dates and end dates of all the apartment bookings.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_booking_start_date ?T1_booking_end_date WHERE { ?T1 a :apartment_bookings . ?T1 :booking_start_date ?T1_booking_start_date . ?T1 :booking_end_date ?T1_booking_end_date . }",SELECT ?T1_booking_start_date ?T1_booking_end_date WHERE { ?T1 a <http://valuenet/ontop/apartment_bookings> . ?T1 <http://valuenet/ontop/booking_start_date> ?T1_booking_start_date . ?T1 <http://valuenet/ontop/booking_end_date> ?T1_booking_end_date . }
Show all distinct building descriptions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_building_description WHERE { ?T1 a :apartment_buildings . ?T1 :building_description ?T1_building_description . }",SELECT DISTINCT ?T1_building_description WHERE { ?T1 a <http://valuenet/ontop/apartment_buildings> . ?T1 <http://valuenet/ontop/building_description> ?T1_building_description . }
Show the short names of the buildings managed by 'Emma'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building_short_name WHERE { ?T1 a :apartment_buildings . ?T1 :building_short_name ?T1_building_short_name . ?T1 :building_manager ?T1_building_manager . FILTER(?T1_building_manager = 'Emma') . }",SELECT ?T1_building_short_name WHERE { ?T1 a <http://valuenet/ontop/apartment_buildings> . ?T1 <http://valuenet/ontop/building_short_name> ?T1_building_short_name . ?T1 <http://valuenet/ontop/building_manager> ?T1_building_manager . FILTER(?T1_building_manager = 'Emma') . }
Show the addresses and phones of all the buildings managed by 'Brenden'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building_address ?T1_building_phone WHERE { ?T1 a :apartment_buildings . ?T1 :building_address ?T1_building_address . ?T1 :building_phone ?T1_building_phone . ?T1 :building_manager ?T1_building_manager . FILTER(?T1_building_manager = 'Brenden') . }",SELECT ?T1_building_address ?T1_building_phone WHERE { ?T1 a <http://valuenet/ontop/apartment_buildings> . ?T1 <http://valuenet/ontop/building_address> ?T1_building_address . ?T1 <http://valuenet/ontop/building_phone> ?T1_building_phone . ?T1 <http://valuenet/ontop/building_manager> ?T1_building_manager . FILTER(?T1_building_manager = 'Brenden') . }
Find all the building full names containing the word 'court'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building_full_name WHERE { ?T1 a :apartment_buildings . ?T1 :building_full_name ?T1_building_full_name . ?T1 :building_full_name ?T1_building_full_name . FILTER(contains (?T1_building_full_name, 'court')) . }","SELECT ?T1_building_full_name WHERE { ?T1 a <http://valuenet/ontop/apartment_buildings> . ?T1 <http://valuenet/ontop/building_full_name> ?T1_building_full_name . ?T1 <http://valuenet/ontop/building_full_name> ?T1_building_full_name . FILTER(contains (?T1_building_full_name, 'court')) . }"
Give me the minimum and maximum bathroom count among all the apartments.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_bathroom_count) as ?aggregation_T1_bathroom_count_102 ) (max( ?T1_bathroom_count) as ?aggregation_T1_bathroom_count_171 ) WHERE { ?T1 a :apartments . ?T1 :bathroom_count ?T1_bathroom_count . ?T1 :bathroom_count ?T1_bathroom_count . }",SELECT (min( ?T1_bathroom_count) as ?aggregation_T1_bathroom_count_102 ) (max( ?T1_bathroom_count) as ?aggregation_T1_bathroom_count_171 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/bathroom_count> ?T1_bathroom_count . ?T1 <http://valuenet/ontop/bathroom_count> ?T1_bathroom_count . }
Find the average number of bedrooms of all the apartments.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_bedroom_count) as ?aggregation_T1_bedroom_count_183 ) WHERE { ?T1 a :apartments . ?T1 :bedroom_count ?T1_bedroom_count . }",SELECT (avg( ?T1_bedroom_count) as ?aggregation_T1_bedroom_count_183 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/bedroom_count> ?T1_bedroom_count . }
Return the apartment number and the number of rooms for each apartment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_number ?T1_room_count WHERE { ?T1 a :apartments . ?T1 :apt_number ?T1_apt_number . ?T1 :room_count ?T1_room_count . }",SELECT ?T1_apt_number ?T1_room_count WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . }
Find the average room count of the apartments that have the 'Studio' type code.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_176 ) WHERE { ?T1 a :apartments . ?T1 :room_count ?T1_room_count . ?T1 :apt_type_code ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Studio') . }",SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_176 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Studio') . }
Return the apartment numbers of the apartments with type code 'Flat'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apt_number ?T1_apt_number . ?T1 :apt_type_code ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Flat') . }",SELECT ?T1_apt_number WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . FILTER(?T1_apt_type_code = 'Flat') . }
Return the first names and last names of all guests,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a :guests . ?T1 :guest_first_name ?T1_guest_first_name . ?T1 :guest_last_name ?T1_guest_last_name . }",SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a <http://valuenet/ontop/guests> . ?T1 <http://valuenet/ontop/guest_first_name> ?T1_guest_first_name . ?T1 <http://valuenet/ontop/guest_last_name> ?T1_guest_last_name . }
Return the date of birth for all the guests with gender code 'Male'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_birth WHERE { ?T1 a :guests . ?T1 :date_of_birth ?T1_date_of_birth . ?T1 :gender_code ?T1_gender_code . FILTER(?T1_gender_code = 'Male') . }",SELECT ?T1_date_of_birth WHERE { ?T1 a <http://valuenet/ontop/guests> . ?T1 <http://valuenet/ontop/date_of_birth> ?T1_date_of_birth . ?T1 <http://valuenet/ontop/gender_code> ?T1_gender_code . FILTER(?T1_gender_code = 'Male') . }
"Show the apartment numbers, start dates, and end dates of all the apartment bookings.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_number ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :ref-apt ?T1 . ?T1 :apt_number ?T1_apt_number . ?T2 :booking_start_date ?T2_booking_start_date . ?T2 :booking_start_date ?T2_booking_start_date . }",SELECT ?T1_apt_number ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_bookings> . ?T2 <http://valuenet/ontop/ref-apt> ?T1 . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T2 <http://valuenet/ontop/booking_start_date> ?T2_booking_start_date . ?T2 <http://valuenet/ontop/booking_start_date> ?T2_booking_start_date . }
Return the booking start date and end date for the apartments that have type code 'Duplex'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :ref-apt ?T2 . ?T1 :booking_start_date ?T1_booking_start_date . ?T1 :booking_start_date ?T1_booking_start_date . ?T2 :apt_type_code ?T2_apt_type_code . FILTER(?T2_apt_type_code = 'Duplex') . }",SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a <http://valuenet/ontop/apartment_bookings> . ?T2 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/ref-apt> ?T2 . ?T1 <http://valuenet/ontop/booking_start_date> ?T1_booking_start_date . ?T1 <http://valuenet/ontop/booking_start_date> ?T1_booking_start_date . ?T2 <http://valuenet/ontop/apt_type_code> ?T2_apt_type_code . FILTER(?T2_apt_type_code = 'Duplex') . }
Tell me the booking status code for the apartment with number 'Suite 634'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_booking_status_code WHERE { ?T1 a :apartment_bookings . ?T2 a :apartments . ?T1 :ref-apt ?T2 . ?T1 :booking_status_code ?T1_booking_status_code . ?T2 :apt_number ?T2_apt_number . FILTER(?T2_apt_number = 'Suite 634') . }",SELECT ?T1_booking_status_code WHERE { ?T1 a <http://valuenet/ontop/apartment_bookings> . ?T2 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/ref-apt> ?T2 . ?T1 <http://valuenet/ontop/booking_status_code> ?T1_booking_status_code . ?T2 <http://valuenet/ontop/apt_number> ?T2_apt_number . FILTER(?T2_apt_number = 'Suite 634') . }
Show the distinct apartment numbers of the apartments that have bookings with status code 'Confirmed'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :ref-apt ?T1 . ?T1 :apt_number ?T1_apt_number . ?T2 :booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') . }",SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_bookings> . ?T2 <http://valuenet/ontop/ref-apt> ?T1 . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T2 <http://valuenet/ontop/booking_status_code> ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') . }
Show the average room count of the apartments that have booking status code 'Provisional'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_104 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_bookings . ?T2 :ref-apt ?T1 . ?T1 :room_count ?T1_room_count . ?T2 :booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Provisional') . }",SELECT (avg( ?T1_room_count) as ?aggregation_T1_room_count_104 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_bookings> . ?T2 <http://valuenet/ontop/ref-apt> ?T1 . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T2 <http://valuenet/ontop/booking_status_code> ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Provisional') . }
"Show the guest first names, start dates, and end dates of all the apartment bookings.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_guest_first_name ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a :guests . ?T2 a :apartment_bookings . ?T2 :ref-guest ?T1 . ?T1 :guest_first_name ?T1_guest_first_name . ?T2 :booking_start_date ?T2_booking_start_date . ?T2 :booking_start_date ?T2_booking_start_date . }",SELECT ?T1_guest_first_name ?T2_booking_start_date ?T2_booking_start_date WHERE { ?T1 a <http://valuenet/ontop/guests> . ?T2 a <http://valuenet/ontop/apartment_bookings> . ?T2 <http://valuenet/ontop/ref-guest> ?T1 . ?T1 <http://valuenet/ontop/guest_first_name> ?T1_guest_first_name . ?T2 <http://valuenet/ontop/booking_start_date> ?T2_booking_start_date . ?T2 <http://valuenet/ontop/booking_start_date> ?T2_booking_start_date . }
Show the start dates and end dates of all the apartment bookings made by guests with gender code 'Female'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a :apartment_bookings . ?T2 a :guests . ?T1 :ref-guest ?T2 . ?T1 :booking_start_date ?T1_booking_start_date . ?T1 :booking_start_date ?T1_booking_start_date . ?T2 :gender_code ?T2_gender_code . FILTER(?T2_gender_code = 'Female') . }",SELECT ?T1_booking_start_date ?T1_booking_start_date WHERE { ?T1 a <http://valuenet/ontop/apartment_bookings> . ?T2 a <http://valuenet/ontop/guests> . ?T1 <http://valuenet/ontop/ref-guest> ?T2 . ?T1 <http://valuenet/ontop/booking_start_date> ?T1_booking_start_date . ?T1 <http://valuenet/ontop/booking_start_date> ?T1_booking_start_date . ?T2 <http://valuenet/ontop/gender_code> ?T2_gender_code . FILTER(?T2_gender_code = 'Female') . }
Show the first names and last names of all the guests that have apartment bookings with status code 'Confirmed'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a :guests . ?T2 a :apartment_bookings . ?T2 :ref-guest ?T1 . ?T1 :guest_first_name ?T1_guest_first_name . ?T1 :guest_last_name ?T1_guest_last_name . ?T2 :booking_status_code ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') . }",SELECT ?T1_guest_first_name ?T1_guest_last_name WHERE { ?T1 a <http://valuenet/ontop/guests> . ?T2 a <http://valuenet/ontop/apartment_bookings> . ?T2 <http://valuenet/ontop/ref-guest> ?T1 . ?T1 <http://valuenet/ontop/guest_first_name> ?T1_guest_first_name . ?T1 <http://valuenet/ontop/guest_last_name> ?T1_guest_last_name . ?T2 <http://valuenet/ontop/booking_status_code> ?T2_booking_status_code . FILTER(?T2_booking_status_code = 'Confirmed') . }
Show the facility codes of apartments with more than 4 bedrooms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_facility_code WHERE { ?T1 a :apartment_facilities . ?T2 a :apartments . ?T1 :ref-apt ?T2 . ?T1 :facility_code ?T1_facility_code . ?T2 :bedroom_count ?T2_bedroom_count . FILTER(?T2_bedroom_count > 4) . }",SELECT ?T1_facility_code WHERE { ?T1 a <http://valuenet/ontop/apartment_facilities> . ?T2 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/ref-apt> ?T2 . ?T1 <http://valuenet/ontop/facility_code> ?T1_facility_code . ?T2 <http://valuenet/ontop/bedroom_count> ?T2_bedroom_count . FILTER(?T2_bedroom_count > 4) . }
Show the total number of rooms of all apartments with facility code 'Gym'.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_83 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_facilities . ?T2 :ref-apt ?T1 . ?T1 :room_count ?T1_room_count . ?T2 :facility_code ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') . }",SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_83 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_facilities> . ?T2 <http://valuenet/ontop/ref-apt> ?T1 . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T2 <http://valuenet/ontop/facility_code> ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') . }
Find the total number of rooms in the apartments that have facility code 'Gym'.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_32 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_facilities . ?T2 :ref-apt ?T1 . ?T1 :room_count ?T1_room_count . ?T2 :facility_code ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') . }",SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_32 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_facilities> . ?T2 <http://valuenet/ontop/ref-apt> ?T1 . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T2 <http://valuenet/ontop/facility_code> ?T2_facility_code . FILTER(?T2_facility_code = 'Gym') . }
Show the total number of rooms of the apartments in the building with short name 'Columbus Square'.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_58 ) WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :ref-building ?T2 . ?T1 :room_count ?T1_room_count . ?T2 :building_short_name ?T2_building_short_name . FILTER(?T2_building_short_name = 'Columbus Square') . }",SELECT (sum( ?T1_room_count) as ?aggregation_T1_room_count_58 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_buildings> . ?T1 <http://valuenet/ontop/ref-building> ?T2 . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T2 <http://valuenet/ontop/building_short_name> ?T2_building_short_name . FILTER(?T2_building_short_name = 'Columbus Square') . }
Show the addresses of the buildings that have apartments with more than 2 bathrooms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building_address WHERE { ?T1 a :apartment_buildings . ?T2 a :apartments . ?T2 :ref-building ?T1 . ?T1 :building_address ?T1_building_address . ?T2 :bathroom_count ?T2_bathroom_count . FILTER(?T2_bathroom_count > 2) . }",SELECT ?T1_building_address WHERE { ?T1 a <http://valuenet/ontop/apartment_buildings> . ?T2 a <http://valuenet/ontop/apartments> . ?T2 <http://valuenet/ontop/ref-building> ?T1 . ?T1 <http://valuenet/ontop/building_address> ?T1_building_address . ?T2 <http://valuenet/ontop/bathroom_count> ?T2_bathroom_count . FILTER(?T2_bathroom_count > 2) . }
Show the apartment type codes and apartment numbers in the buildings managed by 'Kyle'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :apartment_buildings . ?T1 :ref-building ?T2 . ?T1 :apt_type_code ?T1_apt_type_code . ?T1 :apt_number ?T1_apt_number . ?T2 :building_manager ?T2_building_manager . FILTER(?T2_building_manager = 'Kyle') . }",SELECT ?T1_apt_type_code ?T1_apt_number WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/apartment_buildings> . ?T1 <http://valuenet/ontop/ref-building> ?T2 . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T2 <http://valuenet/ontop/building_manager> ?T2_building_manager . FILTER(?T2_building_manager = 'Kyle') . }
Show the booking status code and the corresponding number of bookings.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_booking_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartment_bookings . ?T1 :booking_status_code ?T1_booking_status_code . } GROUP BY ?T1_booking_status_code",SELECT ?T1_booking_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/apartment_bookings> . ?T1 <http://valuenet/ontop/booking_status_code> ?T1_booking_status_code . } GROUP BY ?T1_booking_status_code
Return all the apartment numbers sorted by the room count in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apt_number ?T1_apt_number . ?T1 :room_count ?T1_room_count . } ORDER BY ASC (?T1_room_count)",SELECT ?T1_apt_number WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . } ORDER BY ASC (?T1_room_count)
Return the apartment number with the largest number of bedrooms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_number WHERE { ?T1 a :apartments . ?T1 :apt_number ?T1_apt_number . ?T1 :bedroom_count ?T1_bedroom_count . } ORDER BY DESC (?T1_bedroom_count) LIMIT 1",SELECT ?T1_apt_number WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T1 <http://valuenet/ontop/bedroom_count> ?T1_bedroom_count . } ORDER BY DESC (?T1_bedroom_count) LIMIT 1
Show the apartment type codes and the corresponding number of apartments sorted by the number of apartments in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . } GROUP BY ?T1_apt_type_code ORDER BY ASC (count( *))",SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . } GROUP BY ?T1_apt_type_code ORDER BY ASC (count( *))
Show the top 3 apartment type codes sorted by the average number of rooms in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . ?T1 :room_count ?T1_room_count . } GROUP BY ?T1_apt_type_code ORDER BY DESC (avg( ?T1_room_count)) LIMIT 1",SELECT ?T1_apt_type_code WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . } GROUP BY ?T1_apt_type_code ORDER BY DESC (avg( ?T1_room_count)) LIMIT 1
"Show the apartment type code that has the largest number of total rooms, together with the number of bathrooms and number of bedrooms.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code ?T1_bathroom_count ?T1_bedroom_count WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . ?T1 :bathroom_count ?T1_bathroom_count . ?T1 :bedroom_count ?T1_bedroom_count . ?T1 :room_count ?T1_room_count . } GROUP BY ?T1_apt_type_code ?T1_bathroom_count ?T1_bedroom_count ORDER BY DESC (sum( ?T1_room_count)) LIMIT 1",SELECT ?T1_apt_type_code ?T1_bathroom_count ?T1_bedroom_count WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . ?T1 <http://valuenet/ontop/bathroom_count> ?T1_bathroom_count . ?T1 <http://valuenet/ontop/bedroom_count> ?T1_bedroom_count . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . } GROUP BY ?T1_apt_type_code ?T1_bathroom_count ?T1_bedroom_count ORDER BY DESC (sum( ?T1_room_count)) LIMIT 1
Show the most common apartment type code.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . } GROUP BY ?T1_apt_type_code ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . } GROUP BY ?T1_apt_type_code ORDER BY DESC (?aggregation_all) LIMIT 1
Show the most common apartment type code among apartments with more than 1 bathroom.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . ?T1 :bathroom_count ?T1_bathroom_count . FILTER(?T1_bathroom_count > 1) . } GROUP BY ?T1_apt_type_code ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_apt_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . ?T1 <http://valuenet/ontop/bathroom_count> ?T1_bathroom_count . FILTER(?T1_bathroom_count > 1) . } GROUP BY ?T1_apt_type_code ORDER BY DESC (?aggregation_all) LIMIT 1
"Show each apartment type code, and the maximum and minimum number of rooms for each type.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code (max( ?T1_room_count) as ?aggregation_T1_room_count_129 ) (min( ?T1_room_count) as ?aggregation_T1_room_count_103 ) WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . ?T1 :room_count ?T1_room_count . ?T1 :room_count ?T1_room_count . } GROUP BY ?T1_apt_type_code",SELECT ?T1_apt_type_code (max( ?T1_room_count) as ?aggregation_T1_room_count_129 ) (min( ?T1_room_count) as ?aggregation_T1_room_count_103 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . } GROUP BY ?T1_apt_type_code
Return each apartment type code along with the maximum and minimum number of rooms among each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_apt_type_code (max( ?T1_room_count) as ?aggregation_T1_room_count_124 ) (min( ?T1_room_count) as ?aggregation_T1_room_count_96 ) WHERE { ?T1 a :apartments . ?T1 :apt_type_code ?T1_apt_type_code . ?T1 :room_count ?T1_room_count . ?T1 :room_count ?T1_room_count . } GROUP BY ?T1_apt_type_code",SELECT ?T1_apt_type_code (max( ?T1_room_count) as ?aggregation_T1_room_count_124 ) (min( ?T1_room_count) as ?aggregation_T1_room_count_96 ) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_type_code> ?T1_apt_type_code . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . ?T1 <http://valuenet/ontop/room_count> ?T1_room_count . } GROUP BY ?T1_apt_type_code
Show each gender code and the corresponding count of guests sorted by the count in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gender_code (count( *) as ?aggregation_all) WHERE { ?T1 a :guests . ?T1 :gender_code ?T1_gender_code . } GROUP BY ?T1_gender_code ORDER BY DESC (count( *) )",SELECT ?T1_gender_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/guests> . ?T1 <http://valuenet/ontop/gender_code> ?T1_gender_code . } GROUP BY ?T1_gender_code ORDER BY DESC (count( *) )
Find the number of apartments that have no facility.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :apartments . ?T1 :apt_id ?T1_apt_id . FILTER(?T1_apt_id not in (?T22_apt_id)) . {SELECT ?T22_apt_id WHERE { ?T22 a :apartment_facilities . ?T22 :apt_id ?T22_apt_id . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T1 <http://valuenet/ontop/apt_id> ?T1_apt_id . FILTER(?T1_apt_id not in (?T22_apt_id)) . {SELECT ?T22_apt_id WHERE { ?T22 a <http://valuenet/ontop/apartment_facilities> . ?T22 <http://valuenet/ontop/apt_id> ?T22_apt_id . } } }
Show the apartment numbers of apartments with unit status availability of both 0 and 1.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a :apartments . ?T2 a :view_unit_status . ?T2 :ref-apt ?T1 . ?T1 :apt_number ?T1_apt_number . ?T2 :available_yn ?T2_available_yn . FILTER(?T2_available_yn = 0) . FILTER (?T1_apt_number in (?T3_apt_number)) . ?T3 a :apartments . ?T4 a :view_unit_status . ?T4 :ref-apt ?T3 . ?T3 :apt_number ?T3_apt_number . ?T4 :available_yn ?T4_available_yn . FILTER(?T4_available_yn = 1) . }",SELECT DISTINCT ?T1_apt_number WHERE { ?T1 a <http://valuenet/ontop/apartments> . ?T2 a <http://valuenet/ontop/view_unit_status> . ?T2 <http://valuenet/ontop/ref-apt> ?T1 . ?T1 <http://valuenet/ontop/apt_number> ?T1_apt_number . ?T2 <http://valuenet/ontop/available_yn> ?T2_available_yn . FILTER(?T2_available_yn = 0) . FILTER (?T1_apt_number in (?T3_apt_number)) . ?T3 a <http://valuenet/ontop/apartments> . ?T4 a <http://valuenet/ontop/view_unit_status> . ?T4 <http://valuenet/ontop/ref-apt> ?T3 . ?T3 <http://valuenet/ontop/apt_number> ?T3_apt_number . ?T4 <http://valuenet/ontop/available_yn> ?T4_available_yn . FILTER(?T4_available_yn = 1) . }
