nl_question,sparql_partial_uri,sparql_complete_uri
How many assets does each maintenance contract contain? List the number and the contract id.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_maintenance_contract_id WHERE { ?T1 a :assets . ?T2 a :maintenance_contracts . ?T1 :ref-maintenance_contract ?T2 . ?T2 :maintenance_contract_id ?T2_maintenance_contract_id . } GROUP BY ?T2_maintenance_contract_id",SELECT (count( *) as ?aggregation_all) ?T2_maintenance_contract_id WHERE { ?T1 a <http://valuenet/ontop/assets> . ?T2 a <http://valuenet/ontop/maintenance_contracts> . ?T1 <http://valuenet/ontop/ref-maintenance_contract> ?T2 . ?T2 <http://valuenet/ontop/maintenance_contract_id> ?T2_maintenance_contract_id . } GROUP BY ?T2_maintenance_contract_id
How many assets does each third party company supply? List the count and the company id.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_company_id WHERE { ?T13 a :maintenance_contracts . ?T2 a :third_party_companies . ?T13 :ref-maintenance_contract_company ?T2 . ?T2 :company_id ?T2_company_id . } GROUP BY ?T2_company_id",SELECT (count( *) as ?aggregation_all) ?T2_company_id WHERE { ?T13 a <http://valuenet/ontop/maintenance_contracts> . ?T2 a <http://valuenet/ontop/third_party_companies> . ?T13 <http://valuenet/ontop/ref-maintenance_contract_company> ?T2 . ?T2 <http://valuenet/ontop/company_id> ?T2_company_id . } GROUP BY ?T2_company_id
"Which engineer has visited the most times? Show the engineer id, first name and last name.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_engineer_id (count( *) as ?aggregation_all) ?T1_first_name ?T1_last_name WHERE { ?T1 a :maintenance_engineers . ?T2 a :engineer_visits . ?T2 :ref-engineer ?T1 . ?T1 :engineer_id ?T1_engineer_id . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . } GROUP BY ?T1_engineer_id ?T1_first_name ?T1_last_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_engineer_id (count( *) as ?aggregation_all) ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/maintenance_engineers> . ?T2 a <http://valuenet/ontop/engineer_visits> . ?T2 <http://valuenet/ontop/ref-engineer> ?T1 . ?T1 <http://valuenet/ontop/engineer_id> ?T1_engineer_id . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . } GROUP BY ?T1_engineer_id ?T1_first_name ?T1_last_name ORDER BY DESC (?aggregation_all) LIMIT 1
Which parts have more than 2 faults? Show the part name and id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_part_name ?T1_part_id WHERE { ?T1 a :parts . ?T2 a :part_faults . ?T2 :ref-part ?T1 . ?T1 :part_name ?T1_part_name . ?T1 :part_id ?T1_part_id . } GROUP BY ?T1_part_name ?T1_part_id HAVING(count( *) > 2)",SELECT ?T1_part_name ?T1_part_id WHERE { ?T1 a <http://valuenet/ontop/parts> . ?T2 a <http://valuenet/ontop/part_faults> . ?T2 <http://valuenet/ontop/ref-part> ?T1 . ?T1 <http://valuenet/ontop/part_name> ?T1_part_name . ?T1 <http://valuenet/ontop/part_id> ?T1_part_id . } GROUP BY ?T1_part_name ?T1_part_id HAVING(count( *) > 2)
"List all every engineer's first name, last name, details and coresponding skill description.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_other_details ?T2_skill_description WHERE { ?T1 a :maintenance_engineers . ?T13 a :engineer_skills . ?T13 :ref-engineer ?T1 . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :other_details ?T1_other_details . ?T2 :skill_description ?T2_skill_description . ?T2 a :skills . ?T13 :ref-skill ?T2 . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :other_details ?T1_other_details . ?T2 :skill_description ?T2_skill_description . }",SELECT ?T1_first_name ?T1_last_name ?T1_other_details ?T2_skill_description WHERE { ?T1 a <http://valuenet/ontop/maintenance_engineers> . ?T13 a <http://valuenet/ontop/engineer_skills> . ?T13 <http://valuenet/ontop/ref-engineer> ?T1 . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/other_details> ?T1_other_details . ?T2 <http://valuenet/ontop/skill_description> ?T2_skill_description . ?T2 a <http://valuenet/ontop/skills> . ?T13 <http://valuenet/ontop/ref-skill> ?T2 . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/other_details> ?T1_other_details . ?T2 <http://valuenet/ontop/skill_description> ?T2_skill_description . }
"For all the faults of different parts, what are all the decriptions of the skills required to fix them? List the name of the faults and the skill description.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fault_short_name ?T2_skill_description WHERE { ?T1 a :part_faults . ?T13 a :skills_required_to_fix . ?T13 :ref-part_fault ?T1 . ?T1 :fault_short_name ?T1_fault_short_name . ?T2 :skill_description ?T2_skill_description . ?T2 a :skills . ?T13 :ref-skill ?T2 . ?T1 :fault_short_name ?T1_fault_short_name . ?T2 :skill_description ?T2_skill_description . }",SELECT ?T1_fault_short_name ?T2_skill_description WHERE { ?T1 a <http://valuenet/ontop/part_faults> . ?T13 a <http://valuenet/ontop/skills_required_to_fix> . ?T13 <http://valuenet/ontop/ref-part_fault> ?T1 . ?T1 <http://valuenet/ontop/fault_short_name> ?T1_fault_short_name . ?T2 <http://valuenet/ontop/skill_description> ?T2_skill_description . ?T2 a <http://valuenet/ontop/skills> . ?T13 <http://valuenet/ontop/ref-skill> ?T2 . ?T1 <http://valuenet/ontop/fault_short_name> ?T1_fault_short_name . ?T2 <http://valuenet/ontop/skill_description> ?T2_skill_description . }
How many assets can each parts be used in? List the part name and the number.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a :parts . ?T2 a :asset_parts . ?T2 :ref-part ?T1 . ?T1 :part_name ?T1_part_name . } GROUP BY ?T1_part_name",SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/parts> . ?T2 a <http://valuenet/ontop/asset_parts> . ?T2 <http://valuenet/ontop/ref-part> ?T1 . ?T1 <http://valuenet/ontop/part_name> ?T1_part_name . } GROUP BY ?T1_part_name
How many engineer visits are required at most for a single fault log? List the number and the log entry id.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_fault_log_entry_id WHERE { ?T1 a :engineer_visits . ?T2 a :fault_log . ?T1 :ref-fault_log_entry ?T2 . ?T2 :fault_log_entry_id ?T2_fault_log_entry_id . } GROUP BY ?T2_fault_log_entry_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT (count( *) as ?aggregation_all) ?T2_fault_log_entry_id WHERE { ?T1 a <http://valuenet/ontop/engineer_visits> . ?T2 a <http://valuenet/ontop/fault_log> . ?T1 <http://valuenet/ontop/ref-fault_log_entry> ?T2 . ?T2 <http://valuenet/ontop/fault_log_entry_id> ?T2_fault_log_entry_id . } GROUP BY ?T2_fault_log_entry_id ORDER BY DESC (?aggregation_all) LIMIT 1
Which engineers have never visited to maintain the assets? List the engineer first name and last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :maintenance_engineers . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :engineer_id ?T1_engineer_id . FILTER(?T1_engineer_id not in (?T22_engineer_id)) . {SELECT ?T22_engineer_id WHERE { ?T22 a :engineer_visits . ?T22 :engineer_id ?T22_engineer_id . } } }",SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/maintenance_engineers> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/engineer_id> ?T1_engineer_id . FILTER(?T1_engineer_id not in (?T22_engineer_id)) . {SELECT ?T22_engineer_id WHERE { ?T22 a <http://valuenet/ontop/engineer_visits> . ?T22 <http://valuenet/ontop/engineer_id> ?T22_engineer_id . } } }
"List the asset id, details, make and model for every asset.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_asset_id ?T1_asset_details ?T1_asset_make ?T1_asset_model WHERE { ?T1 a :assets . ?T1 :asset_id ?T1_asset_id . ?T1 :asset_details ?T1_asset_details . ?T1 :asset_make ?T1_asset_make . ?T1 :asset_model ?T1_asset_model . }",SELECT ?T1_asset_id ?T1_asset_details ?T1_asset_make ?T1_asset_model WHERE { ?T1 a <http://valuenet/ontop/assets> . ?T1 <http://valuenet/ontop/asset_id> ?T1_asset_id . ?T1 <http://valuenet/ontop/asset_details> ?T1_asset_details . ?T1 <http://valuenet/ontop/asset_make> ?T1_asset_make . ?T1 <http://valuenet/ontop/asset_model> ?T1_asset_model . }
Which part fault requires the most number of skills to fix? List part id and name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_part_id (count( *) as ?aggregation_all) ?T1_part_name WHERE { ?T1 a :parts . ?T1 :part_id ?T1_part_id . ?T1 :part_name ?T1_part_name . } GROUP BY ?T1_part_id ?T1_part_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_part_id (count( *) as ?aggregation_all) ?T1_part_name WHERE { ?T1 a <http://valuenet/ontop/parts> . ?T1 <http://valuenet/ontop/part_id> ?T1_part_id . ?T1 <http://valuenet/ontop/part_name> ?T1_part_name . } GROUP BY ?T1_part_id ?T1_part_name ORDER BY DESC (?aggregation_all) LIMIT 1
Which kind of part has the least number of faults? List the part name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a :parts . ?T2 a :part_faults . ?T2 :ref-part ?T1 . ?T1 :part_name ?T1_part_name . } GROUP BY ?T1_part_name ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT ?T1_part_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/parts> . ?T2 a <http://valuenet/ontop/part_faults> . ?T2 <http://valuenet/ontop/ref-part> ?T1 . ?T1 <http://valuenet/ontop/part_name> ?T1_part_name . } GROUP BY ?T1_part_name ORDER BY ASC (?aggregation_all) LIMIT 1
Which staff have contacted which engineers? List the staff name and the engineer first name and last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_name ?T2_first_name ?T2_last_name WHERE { ?T1 a :staff . ?T13 a :engineer_visits . ?T13 :ref-contact_staff ?T1 . ?T1 :staff_name ?T1_staff_name . ?T2 :first_name ?T2_first_name . ?T2 :last_name ?T2_last_name . ?T2 a :maintenance_engineers . ?T13 :ref-engineer ?T2 . ?T1 :staff_name ?T1_staff_name . ?T2 :first_name ?T2_first_name . ?T2 :last_name ?T2_last_name . }",SELECT ?T1_staff_name ?T2_first_name ?T2_last_name WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T13 a <http://valuenet/ontop/engineer_visits> . ?T13 <http://valuenet/ontop/ref-contact_staff> ?T1 . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . ?T2 <http://valuenet/ontop/first_name> ?T2_first_name . ?T2 <http://valuenet/ontop/last_name> ?T2_last_name . ?T2 a <http://valuenet/ontop/maintenance_engineers> . ?T13 <http://valuenet/ontop/ref-engineer> ?T2 . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . ?T2 <http://valuenet/ontop/first_name> ?T2_first_name . ?T2 <http://valuenet/ontop/last_name> ?T2_last_name . }
"Which fault log included the most number of faulty parts? List the fault log id, description and record time.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fault_log_entry_id (count( *) as ?aggregation_all) ?T1_fault_description ?T1_fault_log_entry_datetime WHERE { ?T1 a :fault_log . ?T2 a :fault_log_parts . ?T2 :ref-fault_log_entry ?T1 . ?T1 :fault_log_entry_id ?T1_fault_log_entry_id . ?T1 :fault_description ?T1_fault_description . ?T1 :fault_log_entry_datetime ?T1_fault_log_entry_datetime . } GROUP BY ?T1_fault_log_entry_id ?T1_fault_description ?T1_fault_log_entry_datetime ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_fault_log_entry_id (count( *) as ?aggregation_all) ?T1_fault_description ?T1_fault_log_entry_datetime WHERE { ?T1 a <http://valuenet/ontop/fault_log> . ?T2 a <http://valuenet/ontop/fault_log_parts> . ?T2 <http://valuenet/ontop/ref-fault_log_entry> ?T1 . ?T1 <http://valuenet/ontop/fault_log_entry_id> ?T1_fault_log_entry_id . ?T1 <http://valuenet/ontop/fault_description> ?T1_fault_description . ?T1 <http://valuenet/ontop/fault_log_entry_datetime> ?T1_fault_log_entry_datetime . } GROUP BY ?T1_fault_log_entry_id ?T1_fault_description ?T1_fault_log_entry_datetime ORDER BY DESC (?aggregation_all) LIMIT 1
Which skill is used in fixing the most number of faults? List the skill id and description.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_skill_id (count( *) as ?aggregation_all) ?T1_skill_description WHERE { ?T1 a :skills . ?T2 a :skills_required_to_fix . ?T2 :ref-skill ?T1 . ?T1 :skill_id ?T1_skill_id . ?T1 :skill_description ?T1_skill_description . } GROUP BY ?T1_skill_id ?T1_skill_description ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_skill_id (count( *) as ?aggregation_all) ?T1_skill_description WHERE { ?T1 a <http://valuenet/ontop/skills> . ?T2 a <http://valuenet/ontop/skills_required_to_fix> . ?T2 <http://valuenet/ontop/ref-skill> ?T1 . ?T1 <http://valuenet/ontop/skill_id> ?T1_skill_id . ?T1 <http://valuenet/ontop/skill_description> ?T1_skill_description . } GROUP BY ?T1_skill_id ?T1_skill_description ORDER BY DESC (?aggregation_all) LIMIT 1
"List the all the assets make, model, details by the disposed date ascendingly.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_asset_make ?T1_asset_model ?T1_asset_details WHERE { ?T1 a :assets . ?T1 :asset_make ?T1_asset_make . ?T1 :asset_model ?T1_asset_model . ?T1 :asset_details ?T1_asset_details . ?T1 :asset_disposed_date ?T1_asset_disposed_date . } ORDER BY ASC (?T1_asset_disposed_date)",SELECT ?T1_asset_make ?T1_asset_model ?T1_asset_details WHERE { ?T1 a <http://valuenet/ontop/assets> . ?T1 <http://valuenet/ontop/asset_make> ?T1_asset_make . ?T1 <http://valuenet/ontop/asset_model> ?T1_asset_model . ?T1 <http://valuenet/ontop/asset_details> ?T1_asset_details . ?T1 <http://valuenet/ontop/asset_disposed_date> ?T1_asset_disposed_date . } ORDER BY ASC (?T1_asset_disposed_date)
Which part has the least chargeable amount? List the part id and amount.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_part_id ?T1_chargeable_amount WHERE { ?T1 a :parts . ?T1 :part_id ?T1_part_id . ?T1 :chargeable_amount ?T1_chargeable_amount . ?T1 :chargeable_amount ?T1_chargeable_amount . } ORDER BY ASC (?T1_chargeable_amount) LIMIT 1",SELECT ?T1_part_id ?T1_chargeable_amount WHERE { ?T1 a <http://valuenet/ontop/parts> . ?T1 <http://valuenet/ontop/part_id> ?T1_part_id . ?T1 <http://valuenet/ontop/chargeable_amount> ?T1_chargeable_amount . ?T1 <http://valuenet/ontop/chargeable_amount> ?T1_chargeable_amount . } ORDER BY ASC (?T1_chargeable_amount) LIMIT 1
Which company started the earliest the maintenance contract? Show the company name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company_name WHERE { ?T1 a :third_party_companies . ?T2 a :maintenance_contracts . ?T2 :ref-maintenance_contract_company ?T1 . ?T1 :company_name ?T1_company_name . ?T2 :contract_start_date ?T2_contract_start_date . } ORDER BY ASC (?T2_contract_start_date) LIMIT 1",SELECT ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/third_party_companies> . ?T2 a <http://valuenet/ontop/maintenance_contracts> . ?T2 <http://valuenet/ontop/ref-maintenance_contract_company> ?T1 . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T2 <http://valuenet/ontop/contract_start_date> ?T2_contract_start_date . } ORDER BY ASC (?T2_contract_start_date) LIMIT 1
How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_name (count( *) as ?aggregation_all) WHERE { ?T1 a :staff . ?T2 a :engineer_visits . ?T2 :ref-contact_staff ?T1 . ?T1 :staff_name ?T1_staff_name . } GROUP BY ?T1_staff_name",SELECT ?T1_staff_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/engineer_visits> . ?T2 <http://valuenet/ontop/ref-contact_staff> ?T1 . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . } GROUP BY ?T1_staff_name
Which assets did not incur any fault log? List the asset model.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_asset_model WHERE { ?T1 a :assets . ?T1 :asset_model ?T1_asset_model . ?T1 :asset_id ?T1_asset_id . FILTER(?T1_asset_id not in (?T22_asset_id)) . {SELECT ?T22_asset_id WHERE { ?T22 a :fault_log . ?T22 :asset_id ?T22_asset_id . } } }",SELECT ?T1_asset_model WHERE { ?T1 a <http://valuenet/ontop/assets> . ?T1 <http://valuenet/ontop/asset_model> ?T1_asset_model . ?T1 <http://valuenet/ontop/asset_id> ?T1_asset_id . FILTER(?T1_asset_id not in (?T22_asset_id)) . {SELECT ?T22_asset_id WHERE { ?T22 a <http://valuenet/ontop/fault_log> . ?T22 <http://valuenet/ontop/asset_id> ?T22_asset_id . } } }
