nl_question,sparql_partial_uri,sparql_complete_uri
List the total scores of body builders in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_total WHERE { ?T1 a :body_builder . ?T1 :total ?T1_total . ?T1 :total ?T1_total . } ORDER BY ASC (?T1_total)",SELECT ?T1_total WHERE { ?T1 a <http://valuenet/ontop/body_builder> . ?T1 <http://valuenet/ontop/total> ?T1_total . ?T1 <http://valuenet/ontop/total> ?T1_total . } ORDER BY ASC (?T1_total)
List the snatch score and clean jerk score of body builders in ascending order of snatch score.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_snatch ?T1_clean_jerk WHERE { ?T1 a :body_builder . ?T1 :snatch ?T1_snatch . ?T1 :clean_jerk ?T1_clean_jerk . ?T1 :snatch ?T1_snatch . } ORDER BY ASC (?T1_snatch)",SELECT ?T1_snatch ?T1_clean_jerk WHERE { ?T1 a <http://valuenet/ontop/body_builder> . ?T1 <http://valuenet/ontop/snatch> ?T1_snatch . ?T1 <http://valuenet/ontop/clean_jerk> ?T1_clean_jerk . ?T1 <http://valuenet/ontop/snatch> ?T1_snatch . } ORDER BY ASC (?T1_snatch)
List each birth place along with the number of people from there.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_birth_place (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :birth_place ?T1_birth_place . } GROUP BY ?T1_birth_place",SELECT ?T1_birth_place (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/birth_place> ?T1_birth_place . } GROUP BY ?T1_birth_place
List the height and weight of people in descending order of height.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_height ?T1_weight WHERE { ?T1 a :people . ?T1 :height ?T1_height . ?T1 :weight ?T1_weight . ?T1 :height ?T1_height . } ORDER BY DESC (?T1_height)",SELECT ?T1_height ?T1_weight WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/height> ?T1_height . ?T1 <http://valuenet/ontop/weight> ?T1_weight . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY DESC (?T1_height)
Show all information about each body builder.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :body_builder . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/body_builder> . }
List the names and origins of people who are not body builders.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_birth_place as ?col2) WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :birth_place ?T1_birth_place . }} MINUS {SELECT (?T2_name as ?col1) (?T2_birth_place as ?col2) WHERE { ?T2 a :people . ?T2 :name ?T2_name . ?T2 :birth_place ?T2_birth_place . } } }",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_birth_place as ?col2) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/birth_place> ?T1_birth_place . }} MINUS {SELECT (?T2_name as ?col1) (?T2_birth_place as ?col2) WHERE { ?T2 a <http://valuenet/ontop/people> . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/birth_place> ?T2_birth_place . } } }
List the weight of the body builders who have snatch score higher than 140 or have the height greater than 200.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_weight WHERE { ?T1 a :people . ?T2 a :body_builder . ?T2 :ref-people ?T1 . ?T1 :weight ?T1_weight . ?T2 :snatch ?T2_snatch . ?T1 :height ?T1_height . FILTER(?T2_snatch > 140 || ?T1_height > 200) . }",SELECT ?T1_weight WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/body_builder> . ?T2 <http://valuenet/ontop/ref-people> ?T1 . ?T1 <http://valuenet/ontop/weight> ?T1_weight . ?T2 <http://valuenet/ontop/snatch> ?T2_snatch . ?T1 <http://valuenet/ontop/height> ?T1_height . FILTER(?T2_snatch > 140 || ?T1_height > 200) . }
