nl_question,sparql_partial_uri,sparql_complete_uri
List the writers of the books in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_writer WHERE { ?T1 a :book . ?T1 :writer ?T1_writer . ?T1 :writer ?T1_writer . } ORDER BY ASC (?T1_writer)",SELECT ?T1_writer WHERE { ?T1 a <http://valuenet/ontop/book> . ?T1 <http://valuenet/ontop/writer> ?T1_writer . ?T1 <http://valuenet/ontop/writer> ?T1_writer . } ORDER BY ASC (?T1_writer)
List the titles of the books in ascending order of issues.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :book . ?T1 :title ?T1_title . ?T1 :issues ?T1_issues . } ORDER BY ASC (?T1_issues)",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/book> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/issues> ?T1_issues . } ORDER BY ASC (?T1_issues)
List the publisher of the publication with the highest price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publisher WHERE { ?T1 a :publication . ?T1 :publisher ?T1_publisher . ?T1 :price ?T1_price . } ORDER BY DESC (?T1_price) LIMIT 1",SELECT ?T1_publisher WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . ?T1 <http://valuenet/ontop/price> ?T1_price . } ORDER BY DESC (?T1_price) LIMIT 1
List the publication dates of publications with 3 lowest prices.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publication_date WHERE { ?T1 a :publication . ?T1 :publication_date ?T1_publication_date . ?T1 :price ?T1_price . } ORDER BY ASC (?T1_price) LIMIT 1",SELECT ?T1_publication_date WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/publication_date> ?T1_publication_date . ?T1 <http://valuenet/ontop/price> ?T1_price . } ORDER BY ASC (?T1_price) LIMIT 1
Show the title and publication dates of books.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title ?T2_publication_date WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :ref-book ?T1 . ?T1 :title ?T1_title . ?T2 :publication_date ?T2_publication_date . }",SELECT ?T1_title ?T2_publication_date WHERE { ?T1 a <http://valuenet/ontop/book> . ?T2 a <http://valuenet/ontop/publication> . ?T2 <http://valuenet/ontop/ref-book> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/publication_date> ?T2_publication_date . }
Show writers who have published a book with price more than 4000000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_writer WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :ref-book ?T1 . ?T1 :writer ?T1_writer . ?T2 :price ?T2_price . FILTER(?T2_price > 4000000) . }",SELECT ?T1_writer WHERE { ?T1 a <http://valuenet/ontop/book> . ?T2 a <http://valuenet/ontop/publication> . ?T2 <http://valuenet/ontop/ref-book> ?T1 . ?T1 <http://valuenet/ontop/writer> ?T1_writer . ?T2 <http://valuenet/ontop/price> ?T2_price . FILTER(?T2_price > 4000000) . }
Show the titles of books in descending order of publication price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :book . ?T2 a :publication . ?T2 :ref-book ?T1 . ?T1 :title ?T1_title . ?T2 :price ?T2_price . } ORDER BY DESC (?T2_price)",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/book> . ?T2 a <http://valuenet/ontop/publication> . ?T2 <http://valuenet/ontop/ref-book> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/price> ?T2_price . } ORDER BY DESC (?T2_price)
Show publishers that have more than one publication.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publisher WHERE { ?T1 a :publication . ?T1 :publisher ?T1_publisher . } GROUP BY ?T1_publisher HAVING(count( *) > 1)",SELECT ?T1_publisher WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . } GROUP BY ?T1_publisher HAVING(count( *) > 1)
Show different publishers together with the number of publications they have.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :publication . ?T1 :publisher ?T1_publisher . } GROUP BY ?T1_publisher",SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . } GROUP BY ?T1_publisher
Please show the most common publication date.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publication_date (count( *) as ?aggregation_all) WHERE { ?T1 a :publication . ?T1 :publication_date ?T1_publication_date . } GROUP BY ?T1_publication_date ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_publication_date (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/publication_date> ?T1_publication_date . } GROUP BY ?T1_publication_date ORDER BY DESC (?aggregation_all) LIMIT 1
List the writers who have written more than one book.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_writer WHERE { ?T1 a :book . ?T1 :writer ?T1_writer . } GROUP BY ?T1_writer HAVING(count( *) > 1)",SELECT ?T1_writer WHERE { ?T1 a <http://valuenet/ontop/book> . ?T1 <http://valuenet/ontop/writer> ?T1_writer . } GROUP BY ?T1_writer HAVING(count( *) > 1)
List the titles of books that are not published.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :book . ?T1 :title ?T1_title . ?T1 :book_id ?T1_book_id . FILTER(?T1_book_id not in (?T22_book_id)) . {SELECT ?T22_book_id WHERE { ?T22 a :publication . ?T22 :book_id ?T22_book_id . } } }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/book> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/book_id> ?T1_book_id . FILTER(?T1_book_id not in (?T22_book_id)) . {SELECT ?T22_book_id WHERE { ?T22 a <http://valuenet/ontop/publication> . ?T22 <http://valuenet/ontop/book_id> ?T22_book_id . } } }
Show the publishers that have publications with price higher than 10000000 and publications with price lower than 5000000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :publication . ?T1 :publisher ?T1_publisher . ?T1 :price ?T1_price . FILTER(?T1_price > 10000000) . FILTER (?T1_publisher in (?T2_publisher)) . ?T2 a :publication . ?T2 :publisher ?T2_publisher . ?T2 :price ?T2_price . FILTER(?T2_price < 5000000) . }",SELECT DISTINCT ?T1_publisher WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . ?T1 <http://valuenet/ontop/price> ?T1_price . FILTER(?T1_price > 10000000) . FILTER (?T1_publisher in (?T2_publisher)) . ?T2 a <http://valuenet/ontop/publication> . ?T2 <http://valuenet/ontop/publisher> ?T2_publisher . ?T2 <http://valuenet/ontop/price> ?T2_price . FILTER(?T2_price < 5000000) . }
Show the prices of publications whose publisher is either 'Person' or 'Wiley',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_price WHERE { ?T1 a :publication . ?T1 :price ?T1_price . ?T1 :publisher ?T1_publisher . ?T1 :publisher ?T1_publisher . FILTER(?T1_publisher = 'Person' || ?T1_publisher = 'Wiley') . }",SELECT ?T1_price WHERE { ?T1 a <http://valuenet/ontop/publication> . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . FILTER(?T1_publisher = 'Person' || ?T1_publisher = 'Wiley') . }
