nl_question,sparql_partial_uri,sparql_complete_uri
List the name of browsers in descending order by market share.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :browser . ?T1 :name ?T1_name . ?T1 :market_share ?T1_market_share . } ORDER BY DESC (?T1_market_share)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/browser> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/market_share> ?T1_market_share . } ORDER BY DESC (?T1_market_share)
"List the ids, names and market shares of all browsers.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_id ?T1_name ?T1_market_share WHERE { ?T1 a :browser . ?T1 :id ?T1_id . ?T1 :name ?T1_name . ?T1 :market_share ?T1_market_share . }",SELECT ?T1_id ?T1_name ?T1_market_share WHERE { ?T1 a <http://valuenet/ontop/browser> . ?T1 <http://valuenet/ontop/id> ?T1_id . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/market_share> ?T1_market_share . }
List the names of the browser that are compatible with both 'CACHEbox' and 'Fasterfox'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :browser . ?T13 a :accelerator_compatible_browser . ?T13 :ref-browser ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :web_client_accelerator . ?T13 :ref-accelerator ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'CACHEbox') . FILTER (?T1_name in (?T3_name)) . ?T3 a :browser . ?T15 a :accelerator_compatible_browser . ?T15 :ref-browser ?T3 . ?T3 :name ?T3_name . ?T4 :name ?T4_name . ?T4 a :web_client_accelerator . ?T15 :ref-accelerator ?T4 . ?T3 :name ?T3_name . ?T4 :name ?T4_name . FILTER(?T4_name = 'Fasterfox') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/browser> . ?T13 a <http://valuenet/ontop/accelerator_compatible_browser> . ?T13 <http://valuenet/ontop/ref-browser> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/web_client_accelerator> . ?T13 <http://valuenet/ontop/ref-accelerator> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'CACHEbox') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/browser> . ?T15 a <http://valuenet/ontop/accelerator_compatible_browser> . ?T15 <http://valuenet/ontop/ref-browser> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/name> ?T4_name . ?T4 a <http://valuenet/ontop/web_client_accelerator> . ?T15 <http://valuenet/ontop/ref-accelerator> ?T4 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/name> ?T4_name . FILTER(?T4_name = 'Fasterfox') . }
Show the accelerator names and supporting operating systems that are not compatible with the browser named 'Opera'.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_operating_system as ?col2) WHERE { ?T1 a :web_client_accelerator . ?T1 :name ?T1_name . ?T1 :operating_system ?T1_operating_system . }} MINUS {SELECT (?T2_name as ?col1) (?T2_operating_system as ?col2) WHERE { ?T2 a :web_client_accelerator . ?T14 a :accelerator_compatible_browser . ?T14 :ref-accelerator ?T2 . ?T2 :name ?T2_name . ?T2 :operating_system ?T2_operating_system . ?T3 :name ?T3_name . ?T3 a :browser . ?T14 :ref-browser ?T3 . ?T2 :name ?T2_name . ?T2 :operating_system ?T2_operating_system . ?T3 :name ?T3_name . FILTER(?T3_name = 'Opera') . } } }",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_operating_system as ?col2) WHERE { ?T1 a <http://valuenet/ontop/web_client_accelerator> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/operating_system> ?T1_operating_system . }} MINUS {SELECT (?T2_name as ?col1) (?T2_operating_system as ?col2) WHERE { ?T2 a <http://valuenet/ontop/web_client_accelerator> . ?T14 a <http://valuenet/ontop/accelerator_compatible_browser> . ?T14 <http://valuenet/ontop/ref-accelerator> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/operating_system> ?T2_operating_system . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T3 a <http://valuenet/ontop/browser> . ?T14 <http://valuenet/ontop/ref-browser> ?T3 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/operating_system> ?T2_operating_system . ?T3 <http://valuenet/ontop/name> ?T3_name . FILTER(?T3_name = 'Opera') . } } }
Find the number of web accelerators used for each Operating system.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_operating_system (count( *) as ?aggregation_all) WHERE { ?T1 a :web_client_accelerator . ?T1 :operating_system ?T1_operating_system . } GROUP BY ?T1_operating_system",SELECT ?T1_operating_system (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/web_client_accelerator> . ?T1 <http://valuenet/ontop/operating_system> ?T1_operating_system . } GROUP BY ?T1_operating_system
give me names of all compatible browsers and accelerators in the descending order of compatible year,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :browser . ?T3 a :accelerator_compatible_browser . ?T3 :ref-browser ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :compatible_since_year ?T3_compatible_since_year . ?T2 a :web_client_accelerator . ?T3 :ref-accelerator ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :compatible_since_year ?T3_compatible_since_year . } ORDER BY DESC (?T3_compatible_since_year)",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/browser> . ?T3 a <http://valuenet/ontop/accelerator_compatible_browser> . ?T3 <http://valuenet/ontop/ref-browser> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/compatible_since_year> ?T3_compatible_since_year . ?T2 a <http://valuenet/ontop/web_client_accelerator> . ?T3 <http://valuenet/ontop/ref-accelerator> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/compatible_since_year> ?T3_compatible_since_year . } ORDER BY DESC (?T3_compatible_since_year)
