nl_question,sparql_partial_uri,sparql_complete_uri
Show all the locations where no cinema has capacity over 800.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_location as ?col1) WHERE { ?T1 a :cinema . ?T1 :location ?T1_location . }} MINUS {SELECT (?T2_location as ?col1) WHERE { ?T2 a :cinema . ?T2 :location ?T2_location . ?T2 :capacity ?T2_capacity . FILTER(?T2_capacity > 800) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_location as ?col1) WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/location> ?T1_location . }} MINUS {SELECT (?T2_location as ?col1) WHERE { ?T2 a <http://valuenet/ontop/cinema> . ?T2 <http://valuenet/ontop/location> ?T2_location . ?T2 <http://valuenet/ontop/capacity> ?T2_capacity . FILTER(?T2_capacity > 800) . } } }
Show all the locations where some cinemas were opened in both year 2010 and year 2011.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_location WHERE { ?T1 a :cinema . ?T1 :location ?T1_location . ?T1 :openning_year ?T1_openning_year . FILTER(?T1_openning_year = 2010) . FILTER (?T1_location in (?T2_location)) . ?T2 a :cinema . ?T2 :location ?T2_location . ?T2 :openning_year ?T2_openning_year . FILTER(?T2_openning_year = 2011) . }",SELECT DISTINCT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/openning_year> ?T1_openning_year . FILTER(?T1_openning_year = 2010) . FILTER (?T1_location in (?T2_location)) . ?T2 a <http://valuenet/ontop/cinema> . ?T2 <http://valuenet/ontop/location> ?T2_location . ?T2 <http://valuenet/ontop/openning_year> ?T2_openning_year . FILTER(?T2_openning_year = 2011) . }
Count the number of cinemas.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :cinema . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/cinema> . }
"Show name, opening year, and capacity for each cinema.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_openning_year ?T1_capacity WHERE { ?T1 a :cinema . ?T1 :name ?T1_name . ?T1 :openning_year ?T1_openning_year . ?T1 :capacity ?T1_capacity . }",SELECT ?T1_name ?T1_openning_year ?T1_capacity WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/openning_year> ?T1_openning_year . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . }
Show the cinema name and location for cinemas with capacity above average.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location WHERE { ?T1 a :cinema . ?T1 :name ?T1_name . ?T1 :location ?T1_location . ?T1 :capacity ?T1_capacity . FILTER(?T1_capacity > (?aggregation_T22_capacity_104)) . {SELECT (avg( ?T22_capacity) as ?aggregation_T22_capacity_104 ) WHERE { ?T22 a :cinema . ?T22 :capacity ?T22_capacity . } } }",SELECT ?T1_name ?T1_location WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . FILTER(?T1_capacity > (?aggregation_T22_capacity_104)) . {SELECT (avg( ?T22_capacity) as ?aggregation_T22_capacity_104 ) WHERE { ?T22 a <http://valuenet/ontop/cinema> . ?T22 <http://valuenet/ontop/capacity> ?T22_capacity . } } }
Find the distinct locations that has a cinema.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_location WHERE { ?T1 a :cinema . ?T1 :location ?T1_location . }",SELECT DISTINCT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/location> ?T1_location . }
Show all the cinema names and opening years in descending order of opening year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_openning_year WHERE { ?T1 a :cinema . ?T1 :name ?T1_name . ?T1 :openning_year ?T1_openning_year . ?T1 :openning_year ?T1_openning_year . } ORDER BY DESC (?T1_openning_year)",SELECT ?T1_name ?T1_openning_year WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/openning_year> ?T1_openning_year . ?T1 <http://valuenet/ontop/openning_year> ?T1_openning_year . } ORDER BY DESC (?T1_openning_year)
"Show the average, minimum, and maximum capacity for all the cinemas opened in year 2011 or later.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_capacity) as ?aggregation_T1_capacity_113 ) (min( ?T1_capacity) as ?aggregation_T1_capacity_152 ) (max( ?T1_capacity) as ?aggregation_T1_capacity_75 ) WHERE { ?T1 a :cinema . ?T1 :capacity ?T1_capacity . ?T1 :capacity ?T1_capacity . ?T1 :capacity ?T1_capacity . ?T1 :openning_year ?T1_openning_year . FILTER(?T1_openning_year >= 2011) . }",SELECT (avg( ?T1_capacity) as ?aggregation_T1_capacity_113 ) (min( ?T1_capacity) as ?aggregation_T1_capacity_152 ) (max( ?T1_capacity) as ?aggregation_T1_capacity_75 ) WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . ?T1 <http://valuenet/ontop/openning_year> ?T1_openning_year . FILTER(?T1_openning_year >= 2011) . }
Show each location and the number of cinemas there.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :cinema . ?T1 :location ?T1_location . } GROUP BY ?T1_location",SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location
Show all the locations with at least two cinemas with capacity above 300.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :cinema . ?T1 :location ?T1_location . ?T1 :capacity ?T1_capacity . FILTER(?T1_capacity > 300) . } GROUP BY ?T1_location HAVING(count( *) >= 2)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . FILTER(?T1_capacity > 300) . } GROUP BY ?T1_location HAVING(count( *) >= 2)
Show the title and director for all films.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title ?T1_directed_by WHERE { ?T1 a :film . ?T1 :title ?T1_title . ?T1 :directed_by ?T1_directed_by . }",SELECT ?T1_title ?T1_directed_by WHERE { ?T1 a <http://valuenet/ontop/film> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/directed_by> ?T1_directed_by . }
Show all directors.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_directed_by WHERE { ?T1 a :film . ?T1 :directed_by ?T1_directed_by . }",SELECT DISTINCT ?T1_directed_by WHERE { ?T1 a <http://valuenet/ontop/film> . ?T1 <http://valuenet/ontop/directed_by> ?T1_directed_by . }
List all directors along with the number of films directed by each director.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_directed_by (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :directed_by ?T1_directed_by . } GROUP BY ?T1_directed_by",SELECT ?T1_directed_by (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/film> . ?T1 <http://valuenet/ontop/directed_by> ?T1_directed_by . } GROUP BY ?T1_directed_by
Give me the title and highest price for each film.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title (max( ?T2_price) as ?aggregation_T2_price_122 ) WHERE { ?T1 a :film . ?T2 a :schedule . ?T2 :ref-film ?T1 . ?T1 :title ?T1_title . ?T2 :price ?T2_price . } GROUP BY ?T1_title",SELECT ?T1_title (max( ?T2_price) as ?aggregation_T2_price_122 ) WHERE { ?T1 a <http://valuenet/ontop/film> . ?T2 a <http://valuenet/ontop/schedule> . ?T2 <http://valuenet/ontop/ref-film> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/price> ?T2_price . } GROUP BY ?T1_title
"Show cinema name, film title, date, and price for each record in schedule.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_title ?T3_date ?T3_price WHERE { ?T1 a :cinema . ?T3 a :schedule . ?T3 :ref-cinema ?T1 . ?T1 :name ?T1_name . ?T2 :title ?T2_title . ?T3 :date ?T3_date . ?T3 :price ?T3_price . ?T2 a :film . ?T3 :ref-film ?T2 . ?T1 :name ?T1_name . ?T2 :title ?T2_title . ?T3 :date ?T3_date . ?T3 :price ?T3_price . }",SELECT ?T1_name ?T2_title ?T3_date ?T3_price WHERE { ?T1 a <http://valuenet/ontop/cinema> . ?T3 a <http://valuenet/ontop/schedule> . ?T3 <http://valuenet/ontop/ref-cinema> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/title> ?T2_title . ?T3 <http://valuenet/ontop/date> ?T3_date . ?T3 <http://valuenet/ontop/price> ?T3_price . ?T2 a <http://valuenet/ontop/film> . ?T3 <http://valuenet/ontop/ref-film> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/title> ?T2_title . ?T3 <http://valuenet/ontop/date> ?T3_date . ?T3 <http://valuenet/ontop/price> ?T3_price . }
Show director with the largest number of show times in total.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_directed_by WHERE { ?T1 a :film . ?T2 a :schedule . ?T2 :ref-film ?T1 . ?T1 :directed_by ?T1_directed_by . ?T2 :show_times_per_day ?T2_show_times_per_day . } GROUP BY ?T1_directed_by ORDER BY DESC (sum( ?T2_show_times_per_day)) LIMIT 1",SELECT ?T1_directed_by WHERE { ?T1 a <http://valuenet/ontop/film> . ?T2 a <http://valuenet/ontop/schedule> . ?T2 <http://valuenet/ontop/ref-film> ?T1 . ?T1 <http://valuenet/ontop/directed_by> ?T1_directed_by . ?T2 <http://valuenet/ontop/show_times_per_day> ?T2_show_times_per_day . } GROUP BY ?T1_directed_by ORDER BY DESC (sum( ?T2_show_times_per_day)) LIMIT 1
Count the number of films whose title contains the word 'Dummy'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :film . ?T1 :title ?T1_title . FILTER(contains (?T1_title, 'Dummy')) . }","SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/film> . ?T1 <http://valuenet/ontop/title> ?T1_title . FILTER(contains (?T1_title, 'Dummy')) . }"
