nl_question,sparql_partial_uri,sparql_complete_uri
Find the city that hosted the most events.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :ref-host_city ?T1 . ?T1 :city ?T1_city . } GROUP BY ?T1_city ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T2 a <http://valuenet/ontop/hosting_city> . ?T2 <http://valuenet/ontop/ref-host_city> ?T1 . ?T1 <http://valuenet/ontop/city> ?T1_city . } GROUP BY ?T1_city ORDER BY DESC (?aggregation_all) LIMIT 1
Find the venue of the competition '1994 FIFA World Cup qualification' which was hosted by 'Nanjing ( Jiangsu )'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_venue WHERE { ?T1 a :match . ?T13 a :hosting_city . ?T13 :ref-match ?T1 . ?T1 :venue ?T1_venue . ?T2 :city ?T2_city . ?T1 :competition ?T1_competition . ?T2 a :city . ?T13 :ref-host_city ?T2 . ?T1 :venue ?T1_venue . ?T2 :city ?T2_city . ?T1 :competition ?T1_competition . FILTER(?T2_city = 'Nanjing ( Jiangsu )' && ?T1_competition = '1994 FIFA World Cup qualification') . }",SELECT ?T1_venue WHERE { ?T1 a <http://valuenet/ontop/match> . ?T13 a <http://valuenet/ontop/hosting_city> . ?T13 <http://valuenet/ontop/ref-match> ?T1 . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T2 <http://valuenet/ontop/city> ?T2_city . ?T1 <http://valuenet/ontop/competition> ?T1_competition . ?T2 a <http://valuenet/ontop/city> . ?T13 <http://valuenet/ontop/ref-host_city> ?T2 . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T2 <http://valuenet/ontop/city> ?T2_city . ?T1 <http://valuenet/ontop/competition> ?T1_competition . FILTER(?T2_city = 'Nanjing ( Jiangsu )' && ?T1_competition = '1994 FIFA World Cup qualification') . }
Give me the temperature of Shanghai in January.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_jan WHERE { ?T1 a :temperature . ?T2 a :city . ?T1 :ref-city ?T2 . ?T1 :jan ?T1_jan . ?T2 :city ?T2_city . FILTER(?T2_city = 'Shanghai') . }",SELECT ?T1_jan WHERE { ?T1 a <http://valuenet/ontop/temperature> . ?T2 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/ref-city> ?T2 . ?T1 <http://valuenet/ontop/jan> ?T1_jan . ?T2 <http://valuenet/ontop/city> ?T2_city . FILTER(?T2_city = 'Shanghai') . }
Which city has the lowest GDP? Please list the city name and its GDP.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city ?T1_gdp WHERE { ?T1 a :city . ?T1 :city ?T1_city . ?T1 :gdp ?T1_gdp . ?T1 :gdp ?T1_gdp . } ORDER BY ASC (?T1_gdp) LIMIT 1",SELECT ?T1_city ?T1_gdp WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/gdp> ?T1_gdp . ?T1 <http://valuenet/ontop/gdp> ?T1_gdp . } ORDER BY ASC (?T1_gdp) LIMIT 1
Please give me a list of cities whose regional population is over 10000000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city WHERE { ?T1 a :city . ?T1 :city ?T1_city . ?T1 :regional_population ?T1_regional_population . FILTER(?T1_regional_population > 10000000) . }",SELECT ?T1_city WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/regional_population> ?T1_regional_population . FILTER(?T1_regional_population > 10000000) . }
Please give me a list of cities whose regional population is over 8000000 or under 5000000.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T1 :city ?T1_city . ?T1 :regional_population ?T1_regional_population . FILTER(?T1_regional_population > 10000000) . }} UNION {SELECT (?T1_city as ?col1) WHERE { ?T1 a :city . ?T1 :city ?T1_city . ?T1 :regional_population ?T1_regional_population . FILTER(?T1_regional_population < 5000000) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/regional_population> ?T1_regional_population . FILTER(?T1_regional_population > 10000000) . }} UNION {SELECT (?T1_city as ?col1) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/regional_population> ?T1_regional_population . FILTER(?T1_regional_population < 5000000) . } } }
Find the number of matches in different competitions.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_competition WHERE { ?T1 a :match . ?T1 :competition ?T1_competition . } GROUP BY ?T1_competition",SELECT (count( *) as ?aggregation_all) ?T1_competition WHERE { ?T1 a <http://valuenet/ontop/match> . ?T1 <http://valuenet/ontop/competition> ?T1_competition . } GROUP BY ?T1_competition
List venues of all matches in the order of their dates starting from the most recent one.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_venue WHERE { ?T1 a :match . ?T1 :venue ?T1_venue . ?T1 :date ?T1_date . } ORDER BY DESC (?T1_date)",SELECT ?T1_venue WHERE { ?T1 a <http://valuenet/ontop/match> . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T1 <http://valuenet/ontop/date> ?T1_date . } ORDER BY DESC (?T1_date)
what is the GDP of the city with the largest population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gdp WHERE { ?T1 a :city . ?T1 :gdp ?T1_gdp . ?T1 :regional_population ?T1_regional_population . } ORDER BY DESC (?T1_regional_population) LIMIT 1",SELECT ?T1_gdp WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/gdp> ?T1_gdp . ?T1 <http://valuenet/ontop/regional_population> ?T1_regional_population . } ORDER BY DESC (?T1_regional_population) LIMIT 1
Which cities have served as host cities more than once? Return me their GDP and population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gdp ?T1_regional_population WHERE { ?T1 a :city . ?T2 a :hosting_city . ?T2 :ref-host_city ?T1 . ?T1 :gdp ?T1_gdp . ?T1 :regional_population ?T1_regional_population . } GROUP BY ?T1_gdp ?T1_regional_population HAVING(count( *) > 1)",SELECT ?T1_gdp ?T1_regional_population WHERE { ?T1 a <http://valuenet/ontop/city> . ?T2 a <http://valuenet/ontop/hosting_city> . ?T2 <http://valuenet/ontop/ref-host_city> ?T1 . ?T1 <http://valuenet/ontop/gdp> ?T1_gdp . ?T1 <http://valuenet/ontop/regional_population> ?T1_regional_population . } GROUP BY ?T1_gdp ?T1_regional_population HAVING(count( *) > 1)
