nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of climbers.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :climber . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/climber> . }
List the names of climbers in descending order of points.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :climber . ?T1 :name ?T1_name . ?T1 :points ?T1_points . } ORDER BY DESC (?T1_points)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/points> ?T1_points . } ORDER BY DESC (?T1_points)
List the names of climbers whose country is not Switzerland.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :climber . ?T1 :name ?T1_name . ?T1 :country ?T1_country . FILTER(?T1_country != 'Switzerland') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country != 'Switzerland') . }
Return the maximum number of points for climbers from the United Kingdom.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_points) as ?aggregation_T1_points_136 ) WHERE { ?T1 a :climber . ?T1 :points ?T1_points . ?T1 :country ?T1_country . FILTER(?T1_country = 'United Kingdom') . }",SELECT (max( ?T1_points) as ?aggregation_T1_points_136 ) WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T1 <http://valuenet/ontop/points> ?T1_points . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country = 'United Kingdom') . }
Count the number of different countries that climbers are from.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_country) as ?aggregation_T1_country_127 ) WHERE { ?T1 a :climber . ?T1 :country ?T1_country . }",SELECT DISTINCT (count(DISTINCT ?T1_country) as ?aggregation_T1_country_127 ) WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T1 <http://valuenet/ontop/country> ?T1_country . }
Give the names of mountains in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Return the countries of the mountains that have a height larger than 5000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country WHERE { ?T1 a :mountain . ?T1 :country ?T1_country . ?T1 :height ?T1_height . FILTER(?T1_height > 5000) . }",SELECT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/height> ?T1_height . FILTER(?T1_height > 5000) . }
Return the name of the mountain with the greatest height.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :name ?T1_name . ?T1 :height ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1
List the distinct ranges of the mountains with the top 3 prominence.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_range ?T1_prominence WHERE { ?T1 a :mountain . ?T1 :range ?T1_range . ?T1 :prominence ?T1_prominence . ?T1 :prominence ?T1_prominence . } ORDER BY DESC (?T1_prominence) LIMIT 1",SELECT DISTINCT ?T1_range ?T1_prominence WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/range> ?T1_range . ?T1 <http://valuenet/ontop/prominence> ?T1_prominence . ?T1 <http://valuenet/ontop/prominence> ?T1_prominence . } ORDER BY DESC (?T1_prominence) LIMIT 1
Show names of climbers and the names of mountains they climb.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :climber . ?T2 a :mountain . ?T1 :ref-mountain ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . }",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T2 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/ref-mountain> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the names of climbers and the heights of mountains they climb.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_height WHERE { ?T1 a :climber . ?T2 a :mountain . ?T1 :ref-mountain ?T2 . ?T1 :name ?T1_name . ?T2 :height ?T2_height . }",SELECT ?T1_name ?T2_height WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T2 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/ref-mountain> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/height> ?T2_height . }
Show the height of the mountain climbed by the climber with the maximum points.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_height WHERE { ?T1 a :mountain . ?T2 a :climber . ?T2 :ref-mountain ?T1 . ?T1 :height ?T1_height . ?T2 :points ?T2_points . } ORDER BY DESC (?T2_points) LIMIT 1",SELECT ?T1_height WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T2 a <http://valuenet/ontop/climber> . ?T2 <http://valuenet/ontop/ref-mountain> ?T1 . ?T1 <http://valuenet/ontop/height> ?T1_height . ?T2 <http://valuenet/ontop/points> ?T2_points . } ORDER BY DESC (?T2_points) LIMIT 1
Show the distinct names of mountains climbed by climbers from country 'West Germany'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :mountain . ?T2 a :climber . ?T2 :ref-mountain ?T1 . ?T1 :name ?T1_name . ?T2 :country ?T2_country . FILTER(?T2_country = 'West Germany') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T2 a <http://valuenet/ontop/climber> . ?T2 <http://valuenet/ontop/ref-mountain> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/country> ?T2_country . FILTER(?T2_country = 'West Germany') . }
Show the times used by climbers to climb mountains in Country Uganda.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_time WHERE { ?T1 a :climber . ?T2 a :mountain . ?T1 :ref-mountain ?T2 . ?T1 :time ?T1_time . ?T2 :country ?T2_country . FILTER(?T2_country = 'Uganda') . }",SELECT ?T1_time WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T2 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/ref-mountain> ?T2 . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T2 <http://valuenet/ontop/country> ?T2_country . FILTER(?T2_country = 'Uganda') . }
Please show the countries and the number of climbers from each country.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :climber . ?T1 :country ?T1_country . } GROUP BY ?T1_country",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/climber> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country
List the countries that have more than one mountain.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country WHERE { ?T1 a :mountain . ?T1 :country ?T1_country . } GROUP BY ?T1_country HAVING(count( *) > 1)",SELECT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country HAVING(count( *) > 1)
List the names of mountains that do not have any climber.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :name ?T1_name . ?T1 :mountain_id ?T1_mountain_id . FILTER(?T1_mountain_id not in (?T22_mountain_id)) . {SELECT ?T22_mountain_id WHERE { ?T22 a :climber . ?T22 :mountain_id ?T22_mountain_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/mountain_id> ?T1_mountain_id . FILTER(?T1_mountain_id not in (?T22_mountain_id)) . {SELECT ?T22_mountain_id WHERE { ?T22 a <http://valuenet/ontop/climber> . ?T22 <http://valuenet/ontop/mountain_id> ?T22_mountain_id . } } }
Show the countries that have mountains with height more than 5600 stories and mountains with height less than 5200.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :mountain . ?T1 :country ?T1_country . ?T1 :height ?T1_height . FILTER(?T1_height > 5600) . FILTER (?T1_country in (?T2_country)) . ?T2 a :mountain . ?T2 :country ?T2_country . ?T2 :height ?T2_height . FILTER(?T2_height < 5200) . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/height> ?T1_height . FILTER(?T1_height > 5600) . FILTER (?T1_country in (?T2_country)) . ?T2 a <http://valuenet/ontop/mountain> . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T2 <http://valuenet/ontop/height> ?T2_height . FILTER(?T2_height < 5200) . }
Show the range that has the most number of mountains.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_range (count( *) as ?aggregation_all) WHERE { ?T1 a :mountain . ?T1 :range ?T1_range . } GROUP BY ?T1_range ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_range (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/range> ?T1_range . } GROUP BY ?T1_range ORDER BY DESC (?aggregation_all) LIMIT 1
Show the names of mountains with height more than 5000 or prominence more than 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :mountain . ?T1 :name ?T1_name . ?T1 :height ?T1_height . ?T1 :prominence ?T1_prominence . FILTER(?T1_height > 5000 || ?T1_prominence > 1000) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/height> ?T1_height . ?T1 <http://valuenet/ontop/prominence> ?T1_prominence . FILTER(?T1_height > 5000 || ?T1_prominence > 1000) . }
