nl_question,sparql_partial_uri,sparql_complete_uri
Count the total number of clubs.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/club> . }
Give me the name of each club.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clubname WHERE { ?T1 a :club . ?T1 :clubname ?T1_clubname . }",SELECT ?T1_clubname WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . }
Count the total number of students.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . }
Find each student's first name.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . }",SELECT DISTINCT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . }
Find the last names of the members of the club 'Bootup Baltimore'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :ref-stu ?T1 . ?T1 :lname ?T1_lname . ?T2 :clubname ?T2_clubname . ?T2 a :club . ?T13 :ref-club ?T2 . ?T1 :lname ?T1_lname . ?T2 :clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') . }",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T2 a <http://valuenet/ontop/club> . ?T13 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') . }
Count the members of the club 'Tennis Club'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') . }
Find the number of members of club 'Pen and Paper Gaming'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') . }
Find the number of clubs where 'Tracy Kim' is a member.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :member_of_club . ?T2 a :student . ?T13 :ref-stu ?T2 . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Tracy' && ?T2_lname = 'Kim') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a <http://valuenet/ontop/member_of_club> . ?T2 a <http://valuenet/ontop/student> . ?T13 <http://valuenet/ontop/ref-stu> ?T2 . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Tracy' && ?T2_lname = 'Kim') . }
Find all the female members of club 'Bootup Baltimore'. Show the first name and last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :clubname ?T2_clubname . ?T1 :sex ?T1_sex . ?T2 a :club . ?T13 :ref-club ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :clubname ?T2_clubname . ?T1 :sex ?T1_sex . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T1_sex = 'F') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T2 a <http://valuenet/ontop/club> . ?T13 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T1_sex = 'F') . }
Find the club which has the largest number of members majoring in '600'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :member_of_club . ?T2 :ref-club ?T1 . ?T1 :clubname ?T1_clubname . ?T3 :major ?T3_major . ?T3 a :student . ?T2 :ref-stu ?T3 . ?T1 :clubname ?T1_clubname . ?T3 :major ?T3_major . FILTER(?T3_major = 600) . } GROUP BY ?T1_clubname ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_clubname (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/club> . ?T2 a <http://valuenet/ontop/member_of_club> . ?T2 <http://valuenet/ontop/ref-club> ?T1 . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T3 <http://valuenet/ontop/major> ?T3_major . ?T3 a <http://valuenet/ontop/student> . ?T2 <http://valuenet/ontop/ref-stu> ?T3 . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T3 <http://valuenet/ontop/major> ?T3_major . FILTER(?T3_major = 600) . } GROUP BY ?T1_clubname ORDER BY DESC (?aggregation_all) LIMIT 1
Find the description of the club called 'Tennis Club'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :clubdesc ?T1_clubdesc . ?T1 :clubname ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') . }",SELECT ?T1_clubdesc WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clubdesc> ?T1_clubdesc . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . FILTER(?T1_clubname = 'Tennis Club') . }
Find the description of the club 'Pen and Paper Gaming'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clubdesc WHERE { ?T1 a :club . ?T1 :clubdesc ?T1_clubdesc . ?T1 :clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') . }",SELECT ?T1_clubdesc WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clubdesc> ?T1_clubdesc . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') . }
Find the location of the club 'Pen and Paper Gaming'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :clublocation ?T1_clublocation . ?T1 :clubname ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') . }",SELECT ?T1_clublocation WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clublocation> ?T1_clublocation . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . FILTER(?T1_clubname = 'Pen && Paper Gaming') . }
Tell me the location of the club 'Hopkins Student Enterprises'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clublocation WHERE { ?T1 a :club . ?T1 :clublocation ?T1_clublocation . ?T1 :clubname ?T1_clubname . FILTER(?T1_clubname = 'Hopkins Student Enterprises') . }",SELECT ?T1_clublocation WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clublocation> ?T1_clublocation . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . FILTER(?T1_clubname = 'Hopkins Student Enterprises') . }
Find the name of all the clubs at 'AKW'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_clubname WHERE { ?T1 a :club . ?T1 :clubname ?T1_clubname . ?T1 :clublocation ?T1_clublocation . FILTER(?T1_clublocation = 'AKW') . }",SELECT ?T1_clubname WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T1 <http://valuenet/ontop/clublocation> ?T1_clublocation . FILTER(?T1_clublocation = 'AKW') . }
Count the number of clubs located at 'HHH'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T1 :clublocation ?T1_clublocation . FILTER(?T1_clublocation = 'HHH') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/clublocation> ?T1_clublocation . FILTER(?T1_clublocation = 'HHH') . }
Who is the president of the club 'Bootup Baltimore'? Give me the first and last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T3 a :member_of_club . ?T3 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :clubname ?T2_clubname . ?T3 :position ?T3_position . ?T2 a :club . ?T3 :ref-club ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :clubname ?T2_clubname . ?T3 :position ?T3_position . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_position = 'President') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T3 a <http://valuenet/ontop/member_of_club> . ?T3 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T3 <http://valuenet/ontop/position> ?T3_position . ?T2 a <http://valuenet/ontop/club> . ?T3 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T3 <http://valuenet/ontop/position> ?T3_position . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_position = 'President') . }
Count the number of different positions in the club 'Bootup Baltimore'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_5 ) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :ref-club ?T2 . ?T1 :position ?T1_position . ?T2 :clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') . }",SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_5 ) WHERE { ?T1 a <http://valuenet/ontop/member_of_club> . ?T2 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') . }
Count the number of members in club 'Bootup Baltimore' whose age is above 18.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :member_of_club . ?T2 a :club . ?T1 :ref-club ?T2 . ?T2 :clubname ?T2_clubname . ?T3 :age ?T3_age . ?T3 a :student . ?T1 :ref-stu ?T3 . ?T2 :clubname ?T2_clubname . ?T3 :age ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age > 18) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/member_of_club> . ?T2 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/ref-club> ?T2 . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T3 <http://valuenet/ontop/age> ?T3_age . ?T3 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/ref-stu> ?T3 . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T3 <http://valuenet/ontop/age> ?T3_age . FILTER(?T2_clubname = 'Bootup Baltimore' && ?T3_age > 18) . }
Find the names of all the clubs that have at least a member from the city with city code 'BAL'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_clubname WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :ref-club ?T1 . ?T1 :clubname ?T1_clubname . ?T2 :city_code ?T2_city_code . ?T2 a :student . ?T13 :ref-stu ?T2 . ?T1 :clubname ?T1_clubname . ?T2 :city_code ?T2_city_code . FILTER(?T2_city_code = 'BAL') . }",SELECT DISTINCT ?T1_clubname WHERE { ?T1 a <http://valuenet/ontop/club> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-club> ?T1 . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T2 <http://valuenet/ontop/city_code> ?T2_city_code . ?T2 a <http://valuenet/ontop/student> . ?T13 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T2 <http://valuenet/ontop/city_code> ?T2_city_code . FILTER(?T2_city_code = 'BAL') . }
Count the number of clubs for which the student named 'Eric Tai' is a member.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_11 ) WHERE { ?T1 a :club . ?T13 a :member_of_club . ?T13 :ref-club ?T1 . ?T1 :clubname ?T1_clubname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T2 a :student . ?T13 :ref-stu ?T2 . ?T1 :clubname ?T1_clubname . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai') . }",SELECT DISTINCT (count(DISTINCT ?T1_clubname) as ?aggregation_T1_clubname_11 ) WHERE { ?T1 a <http://valuenet/ontop/club> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-club> ?T1 . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/student> . ?T13 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/clubname> ?T1_clubname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Eric' && ?T2_lname = 'Tai') . }
Find the average age of the members in the club 'Bootup Baltimore'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_156 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :ref-stu ?T1 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . ?T2 a :club . ?T13 :ref-club ?T2 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_156 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T2 a <http://valuenet/ontop/club> . ?T13 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . FILTER(?T2_clubname = 'Bootup Baltimore') . }
Find the average age of members of the club 'Hopkins Student Enterprises'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_192 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :ref-stu ?T1 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . ?T2 a :club . ?T13 :ref-club ?T2 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . FILTER(?T2_clubname = 'Hopkins Student Enterprises') . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_192 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T2 a <http://valuenet/ontop/club> . ?T13 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . FILTER(?T2_clubname = 'Hopkins Student Enterprises') . }
Retrieve the average age of members of the club 'Tennis Club'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :ref-stu ?T1 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . ?T2 a :club . ?T13 :ref-club ?T2 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_36 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T2 a <http://valuenet/ontop/club> . ?T13 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') . }
Compute the average age of the members in the club 'Tennis Club'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_161 ) WHERE { ?T1 a :student . ?T13 a :member_of_club . ?T13 :ref-stu ?T1 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . ?T2 a :club . ?T13 :ref-club ?T2 . ?T1 :age ?T1_age . ?T2 :clubname ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_161 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/member_of_club> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . ?T2 a <http://valuenet/ontop/club> . ?T13 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/clubname> ?T2_clubname . FILTER(?T2_clubname = 'Tennis Club') . }
