nl_question,sparql_partial_uri,sparql_complete_uri
Find the number of members living in each address.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_address WHERE { ?T1 a :member . ?T1 :address ?T1_address . } GROUP BY ?T1_address",SELECT (count( *) as ?aggregation_all) ?T1_address WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/address> ?T1_address . } GROUP BY ?T1_address
Give me the names of members whose address is in Harford or Waterbury.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :address ?T1_address . ?T1 :address ?T1_address . FILTER(?T1_address = 'Harford' || ?T1_address = 'Waterbury') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/address> ?T1_address . ?T1 <http://valuenet/ontop/address> ?T1_address . FILTER(?T1_address = 'Harford' || ?T1_address = 'Waterbury') . }
Find the ids and names of members who are under age 30 or with black membership card.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_member_id WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :member_id ?T1_member_id . ?T1 :membership_card ?T1_membership_card . ?T1 :age ?T1_age . FILTER(?T1_membership_card = 'Black' || ?T1_age < 30) . }",SELECT ?T1_name ?T1_member_id WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/member_id> ?T1_member_id . ?T1 <http://valuenet/ontop/membership_card> ?T1_membership_card . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_membership_card = 'Black' || ?T1_age < 30) . }
"Find the purchase time, age and address of each member, and show the results in the order of purchase time.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_time_of_purchase ?T1_age ?T1_address WHERE { ?T1 a :member . ?T1 :time_of_purchase ?T1_time_of_purchase . ?T1 :age ?T1_age . ?T1 :address ?T1_address . ?T1 :time_of_purchase ?T1_time_of_purchase . } ORDER BY ASC (?T1_time_of_purchase)",SELECT ?T1_time_of_purchase ?T1_age ?T1_address WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/time_of_purchase> ?T1_time_of_purchase . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/address> ?T1_address . ?T1 <http://valuenet/ontop/time_of_purchase> ?T1_time_of_purchase . } ORDER BY ASC (?T1_time_of_purchase)
Show the shop addresses ordered by their opening year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address WHERE { ?T1 a :shop . ?T1 :address ?T1_address . ?T1 :open_year ?T1_open_year . } ORDER BY ASC (?T1_open_year)",SELECT ?T1_address WHERE { ?T1 a <http://valuenet/ontop/shop> . ?T1 <http://valuenet/ontop/address> ?T1_address . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . } ORDER BY ASC (?T1_open_year)
Find the id and address of the shops whose score is below the average score.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_shop_id ?T1_address WHERE { ?T1 a :shop . ?T1 :shop_id ?T1_shop_id . ?T1 :address ?T1_address . ?T1 :score ?T1_score . FILTER(?T1_score < (?aggregation_T22_score_36)) . {SELECT (avg( ?T22_score) as ?aggregation_T22_score_36 ) WHERE { ?T22 a :shop . ?T22 :score ?T22_score . } } }",SELECT ?T1_shop_id ?T1_address WHERE { ?T1 a <http://valuenet/ontop/shop> . ?T1 <http://valuenet/ontop/shop_id> ?T1_shop_id . ?T1 <http://valuenet/ontop/address> ?T1_address . ?T1 <http://valuenet/ontop/score> ?T1_score . FILTER(?T1_score < (?aggregation_T22_score_36)) . {SELECT (avg( ?T22_score) as ?aggregation_T22_score_36 ) WHERE { ?T22 a <http://valuenet/ontop/shop> . ?T22 <http://valuenet/ontop/score> ?T22_score . } } }
Find the address and staff number of the shops that do not have any happy hour.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address ?T1_num_of_staff WHERE { ?T1 a :shop . ?T1 :address ?T1_address . ?T1 :num_of_staff ?T1_num_of_staff . ?T1 :shop_id ?T1_shop_id . FILTER(?T1_shop_id not in (?T22_shop_id)) . {SELECT ?T22_shop_id WHERE { ?T22 a :happy_hour . ?T22 :shop_id ?T22_shop_id . } } }",SELECT ?T1_address ?T1_num_of_staff WHERE { ?T1 a <http://valuenet/ontop/shop> . ?T1 <http://valuenet/ontop/address> ?T1_address . ?T1 <http://valuenet/ontop/num_of_staff> ?T1_num_of_staff . ?T1 <http://valuenet/ontop/shop_id> ?T1_shop_id . FILTER(?T1_shop_id not in (?T22_shop_id)) . {SELECT ?T22_shop_id WHERE { ?T22 a <http://valuenet/ontop/happy_hour> . ?T22 <http://valuenet/ontop/shop_id> ?T22_shop_id . } } }
