nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of courses.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :course . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/course> . }
Count the number of courses with more than 2 credits.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :course . ?T1 :credits ?T1_credits . FILTER(?T1_credits > 2) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/credits> ?T1_credits . FILTER(?T1_credits > 2) . }
Give the phones for departments in room 268.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dphone WHERE { ?T1 a :department . ?T1 :dphone ?T1_dphone . ?T1 :room ?T1_room . FILTER(?T1_room = '268') . }",SELECT ?T1_dphone WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dphone> ?T1_dphone . ?T1 <http://valuenet/ontop/room> ?T1_room . FILTER(?T1_room = '268') . }
Find the number of students that have at least one grade 'B'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_19 ) WHERE { ?T1 a :enrolled_in . ?T1 :stuid ?T1_stuid . ?T1 :grade ?T1_grade . FILTER(?T1_grade = 'B') . }",SELECT DISTINCT (count(DISTINCT ?T1_stuid) as ?aggregation_T1_stuid_19 ) WHERE { ?T1 a <http://valuenet/ontop/enrolled_in> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/grade> ?T1_grade . FILTER(?T1_grade = 'B') . }
Find the max and min grade point for all letter grade.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_gradepoint) as ?aggregation_T1_gradepoint_67 ) (min( ?T1_gradepoint) as ?aggregation_T1_gradepoint_95 ) WHERE { ?T1 a :gradeconversion . ?T1 :gradepoint ?T1_gradepoint . ?T1 :gradepoint ?T1_gradepoint . }",SELECT (max( ?T1_gradepoint) as ?aggregation_T1_gradepoint_67 ) (min( ?T1_gradepoint) as ?aggregation_T1_gradepoint_95 ) WHERE { ?T1 a <http://valuenet/ontop/gradeconversion> . ?T1 <http://valuenet/ontop/gradepoint> ?T1_gradepoint . ?T1 <http://valuenet/ontop/gradepoint> ?T1_gradepoint . }
Find the first names of students whose first names contain letter 'a'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :fname ?T1_fname . FILTER(contains (?T1_fname, 'a')) . }","SELECT DISTINCT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/fname> ?T1_fname . FILTER(contains (?T1_fname, 'a')) . }"
Find the first names and last names of male (sex is M) faculties who live in building NEB.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :sex ?T1_sex . ?T1 :building ?T1_building . FILTER(?T1_sex = 'M' && ?T1_building = 'NEB') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/building> ?T1_building . FILTER(?T1_sex = 'M' && ?T1_building = 'NEB') . }
Find the rooms of faculties with rank professor who live in building NEB.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_room WHERE { ?T1 a :faculty . ?T1 :room ?T1_room . ?T1 :rank ?T1_rank . ?T1 :building ?T1_building . FILTER(?T1_rank = 'Professor' && ?T1_building = 'NEB') . }",SELECT ?T1_room WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/room> ?T1_room . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/building> ?T1_building . FILTER(?T1_rank = 'Professor' && ?T1_building = 'NEB') . }
Find the department name that is in Building 'Mergenthaler'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dname WHERE { ?T1 a :department . ?T1 :dname ?T1_dname . ?T1 :building ?T1_building . FILTER(?T1_building = 'Mergenthaler') . }",SELECT ?T1_dname WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dname> ?T1_dname . ?T1 <http://valuenet/ontop/building> ?T1_building . FILTER(?T1_building = 'Mergenthaler') . }
List all information about courses sorted by credits in the ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :course . ?T1 :credits ?T1_credits . } ORDER BY ASC (?T1_credits)",SELECT * WHERE { ?T1 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/credits> ?T1_credits . } ORDER BY ASC (?T1_credits)
List the course name of courses sorted by credits.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cname WHERE { ?T1 a :course . ?T1 :cname ?T1_cname . ?T1 :credits ?T1_credits . } ORDER BY ASC (?T1_credits)",SELECT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/credits> ?T1_credits . } ORDER BY ASC (?T1_credits)
Find the first name of students in the descending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age)",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age)
Find the last name of female (sex is F) students in the descending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :student . ?T1 :lname ?T1_lname . ?T1 :age ?T1_age . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'F') . } ORDER BY DESC (?T1_age)",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'F') . } ORDER BY DESC (?T1_age)
Find the last names of faculties in building Barton in alphabetic order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :faculty . ?T1 :lname ?T1_lname . ?T1 :lname ?T1_lname . ?T1 :building ?T1_building . FILTER(?T1_building = 'Barton') . } ORDER BY ASC (?T1_lname)",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/building> ?T1_building . FILTER(?T1_building = 'Barton') . } ORDER BY ASC (?T1_lname)
Find the first names of faculties of rank Professor in alphabetic order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :faculty . ?T1 :fname ?T1_fname . ?T1 :fname ?T1_fname . ?T1 :rank ?T1_rank . FILTER(?T1_rank = 'Professor') . } ORDER BY ASC (?T1_fname)",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_rank = 'Professor') . } ORDER BY ASC (?T1_fname)
Find the name of the department that has the fewest members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :member_of . ?T2 :ref-dno ?T1 . ?T1 :dname ?T1_dname . } GROUP BY ?T1_dname ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT ?T1_dname (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/department> . ?T2 a <http://valuenet/ontop/member_of> . ?T2 <http://valuenet/ontop/ref-dno> ?T1 . ?T1 <http://valuenet/ontop/dname> ?T1_dname . } GROUP BY ?T1_dname ORDER BY ASC (?aggregation_all) LIMIT 1
Give the building that the instructor who teaches the greatest number of courses lives in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :ref-instructor ?T1 . ?T1 :building ?T1_building . } GROUP BY ?T1_building ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_building (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T2 a <http://valuenet/ontop/course> . ?T2 <http://valuenet/ontop/ref-instructor> ?T1 . ?T1 <http://valuenet/ontop/building> ?T1_building . } GROUP BY ?T1_building ORDER BY DESC (?aggregation_all) LIMIT 1
Give the names of the courses with at least five enrollments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cname WHERE { ?T1 a :course . ?T2 a :enrolled_in . ?T2 :ref-c ?T1 . ?T1 :cname ?T1_cname . } GROUP BY ?T1_cname HAVING(count( *) >= 5)",SELECT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/course> . ?T2 a <http://valuenet/ontop/enrolled_in> . ?T2 <http://valuenet/ontop/ref-c> ?T1 . ?T1 <http://valuenet/ontop/cname> ?T1_cname . } GROUP BY ?T1_cname HAVING(count( *) >= 5)
Find the first name and last name of the instructor of course that has course name,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :course . ?T2 :ref-instructor ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :cname ?T2_cname . FILTER(?T2_cname = 'COMPUTER LITERACY') . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T2 a <http://valuenet/ontop/course> . ?T2 <http://valuenet/ontop/ref-instructor> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/cname> ?T2_cname . FILTER(?T2_cname = 'COMPUTER LITERACY') . }
Find the student first and last names and grade points of all enrollments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname ?T2_gradepoint WHERE { ?T1 a :student . ?T13 a :enrolled_in . ?T13 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :gradepoint ?T2_gradepoint . ?T2 a :gradeconversion . ?T13 :ref-grade ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :gradepoint ?T2_gradepoint . }",SELECT ?T1_fname ?T1_lname ?T2_gradepoint WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/enrolled_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/gradepoint> ?T2_gradepoint . ?T2 a <http://valuenet/ontop/gradeconversion> . ?T13 <http://valuenet/ontop/ref-grade> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/gradepoint> ?T2_gradepoint . }
Find the distinct student first names of all students that have grade point at least 3.8 in one course.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_fname WHERE { ?T1 a :student . ?T13 a :enrolled_in . ?T13 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T2 :gradepoint ?T2_gradepoint . ?T2 a :gradeconversion . ?T13 :ref-grade ?T2 . ?T1 :fname ?T1_fname . ?T2 :gradepoint ?T2_gradepoint . FILTER(?T2_gradepoint >= 3.8) . }",SELECT DISTINCT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/enrolled_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/gradepoint> ?T2_gradepoint . ?T2 a <http://valuenet/ontop/gradeconversion> . ?T13 <http://valuenet/ontop/ref-grade> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/gradepoint> ?T2_gradepoint . FILTER(?T2_gradepoint >= 3.8) . }
Find the full names of faculties who are members of department with department number 520.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :faculty . ?T2 a :member_of . ?T2 :ref-fac ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :dno ?T2_dno . FILTER(?T2_dno = 520) . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T2 a <http://valuenet/ontop/member_of> . ?T2 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/dno> ?T2_dno . FILTER(?T2_dno = 520) . }
What are the first names and last names of the students that minor in the department with DNO 140.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T2 a :minor_in . ?T2 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :dno ?T2_dno . FILTER(?T2_dno = 140) . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/minor_in> . ?T2 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/dno> ?T2_dno . FILTER(?T2_dno = 140) . }
Find the last names of faculties who are members of computer science department.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :faculty . ?T13 a :member_of . ?T13 :ref-fac ?T1 . ?T1 :lname ?T1_lname . ?T2 :dname ?T2_dname . ?T2 a :department . ?T13 :ref-dno ?T2 . ?T1 :lname ?T1_lname . ?T2 :dname ?T2_dname . FILTER(?T2_dname = 'Computer Science') . }",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/faculty> . ?T13 a <http://valuenet/ontop/member_of> . ?T13 <http://valuenet/ontop/ref-fac> ?T1 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/dname> ?T2_dname . ?T2 a <http://valuenet/ontop/department> . ?T13 <http://valuenet/ontop/ref-dno> ?T2 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/dname> ?T2_dname . FILTER(?T2_dname = 'Computer Science') . }
Find the average grade point of student whose last name is Smith.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_gradepoint) as ?aggregation_T1_gradepoint_8 ) WHERE { ?T1 a :gradeconversion . ?T13 a :enrolled_in . ?T13 :ref-grade ?T1 . ?T1 :gradepoint ?T1_gradepoint . ?T2 :lname ?T2_lname . ?T2 a :student . ?T13 :ref-stu ?T2 . ?T1 :gradepoint ?T1_gradepoint . ?T2 :lname ?T2_lname . FILTER(?T2_lname = 'Smith') . }",SELECT (avg( ?T1_gradepoint) as ?aggregation_T1_gradepoint_8 ) WHERE { ?T1 a <http://valuenet/ontop/gradeconversion> . ?T13 a <http://valuenet/ontop/enrolled_in> . ?T13 <http://valuenet/ontop/ref-grade> ?T1 . ?T1 <http://valuenet/ontop/gradepoint> ?T1_gradepoint . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/student> . ?T13 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/gradepoint> ?T1_gradepoint . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_lname = 'Smith') . }
Find the names of courses that have either 3 credits or 1 credit but 4 hours.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a :course . ?T1 :cname ?T1_cname . ?T1 :credits ?T1_credits . FILTER(?T1_credits = 3) . }} UNION {SELECT (?T1_cname as ?col1) WHERE { ?T1 a :course . ?T1 :cname ?T1_cname . ?T1 :credits ?T1_credits . ?T1 :hours ?T1_hours . FILTER(?T1_credits = 1 && ?T1_hours = '4') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/credits> ?T1_credits . FILTER(?T1_credits = 3) . }} UNION {SELECT (?T1_cname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/credits> ?T1_credits . ?T1 <http://valuenet/ontop/hours> ?T1_hours . FILTER(?T1_credits = 1 && ?T1_hours = '4') . } } }
Find the names of departments that are either in division AS or in division EN and in Building NEB.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_dname as ?col1) WHERE { ?T1 a :department . ?T1 :dname ?T1_dname . ?T1 :division ?T1_division . FILTER(?T1_division = 'AS') . }} UNION {SELECT (?T1_dname as ?col1) WHERE { ?T1 a :department . ?T1 :dname ?T1_dname . ?T1 :division ?T1_division . ?T1 :building ?T1_building . FILTER(?T1_division = 'EN' && ?T1_building = 'NEB') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_dname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dname> ?T1_dname . ?T1 <http://valuenet/ontop/division> ?T1_division . FILTER(?T1_division = 'AS') . }} UNION {SELECT (?T1_dname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dname> ?T1_dname . ?T1 <http://valuenet/ontop/division> ?T1_division . ?T1 <http://valuenet/ontop/building> ?T1_building . FILTER(?T1_division = 'EN' && ?T1_building = 'NEB') . } } }
Find the first name of students not enrolled in any course.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :stuid ?T1_stuid . FILTER(?T1_stuid not in (?T22_stuid)) . {SELECT ?T22_stuid WHERE { ?T22 a :enrolled_in . ?T22 :stuid ?T22_stuid . } } }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER(?T1_stuid not in (?T22_stuid)) . {SELECT ?T22_stuid WHERE { ?T22 a <http://valuenet/ontop/enrolled_in> . ?T22 <http://valuenet/ontop/stuid> ?T22_stuid . } } }
