nl_question,sparql_partial_uri,sparql_complete_uri
Find the number of professors in accounting department.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :professor . ?T2 a :department . ?T1 :ref-dept_code ?T2 . ?T2 :dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/professor> . ?T2 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/ref-dept_code> ?T2 . ?T2 <http://valuenet/ontop/dept_name> ?T2_dept_name . FILTER(?T2_dept_name = 'Accounting') . }
Count different addresses of each school.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_dept_address) as ?aggregation_T1_dept_address_129 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :dept_address ?T1_dept_address . ?T1 :school_code ?T1_school_code . } GROUP BY ?T1_school_code",SELECT DISTINCT (count(DISTINCT ?T1_dept_address) as ?aggregation_T1_dept_address_129 ) ?T1_school_code WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dept_address> ?T1_dept_address . ?T1 <http://valuenet/ontop/school_code> ?T1_school_code . } GROUP BY ?T1_school_code
Find the number of departments in each school.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_151 ) ?T1_school_code WHERE { ?T1 a :department . ?T1 :dept_name ?T1_dept_name . ?T1 :school_code ?T1_school_code . } GROUP BY ?T1_school_code",SELECT DISTINCT (count(DISTINCT ?T1_dept_name) as ?aggregation_T1_dept_name_151 ) ?T1_school_code WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dept_name> ?T1_dept_name . ?T1 <http://valuenet/ontop/school_code> ?T1_school_code . } GROUP BY ?T1_school_code
Find the number of classes offered for all class rooms that held at least 2 classes.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_class_room WHERE { ?T1 a :class . ?T1 :class_room ?T1_class_room . } GROUP BY ?T1_class_room HAVING(count( *) >= 2)",SELECT (count( *) as ?aggregation_all) ?T1_class_room WHERE { ?T1 a <http://valuenet/ontop/class> . ?T1 <http://valuenet/ontop/class_room> ?T1_class_room . } GROUP BY ?T1_class_room HAVING(count( *) >= 2)
Find the number of classes in each department.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a :class . ?T2 a :course . ?T1 :ref-crs_code ?T2 . ?T2 :dept_code ?T2_dept_code . } GROUP BY ?T2_dept_code",SELECT (count( *) as ?aggregation_all) ?T2_dept_code WHERE { ?T1 a <http://valuenet/ontop/class> . ?T2 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/ref-crs_code> ?T2 . ?T2 <http://valuenet/ontop/dept_code> ?T2_dept_code . } GROUP BY ?T2_dept_code
Find the number of classes in each school.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T13 a :employee . ?T2 a :department . ?T2 :ref-emp_num ?T13 . ?T2 :school_code ?T2_school_code . } GROUP BY ?T2_school_code",SELECT (count( *) as ?aggregation_all) ?T2_school_code WHERE { ?T13 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T13 . ?T2 <http://valuenet/ontop/school_code> ?T2_school_code . } GROUP BY ?T2_school_code
Find the number of professors with a Ph.D. degree in each department.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a :professor . ?T1 :dept_code ?T1_dept_code . ?T1 :prof_high_degree ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.') . } GROUP BY ?T1_dept_code",SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a <http://valuenet/ontop/professor> . ?T1 <http://valuenet/ontop/dept_code> ?T1_dept_code . ?T1 <http://valuenet/ontop/prof_high_degree> ?T1_prof_high_degree . FILTER(?T1_prof_high_degree = 'Ph.D.') . } GROUP BY ?T1_dept_code
Find the number of students for each department.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :dept_code ?T1_dept_code . } GROUP BY ?T1_dept_code",SELECT (count( *) as ?aggregation_all) ?T1_dept_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/dept_code> ?T1_dept_code . } GROUP BY ?T1_dept_code
Find the total number of hours have done for all students in each department.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_stu_hrs) as ?aggregation_T1_stu_hrs_105 ) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :stu_hrs ?T1_stu_hrs . ?T1 :dept_code ?T1_dept_code . } GROUP BY ?T1_dept_code",SELECT (sum( ?T1_stu_hrs) as ?aggregation_T1_stu_hrs_105 ) ?T1_dept_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stu_hrs> ?T1_stu_hrs . ?T1 <http://valuenet/ontop/dept_code> ?T1_dept_code . } GROUP BY ?T1_dept_code
"Find the max, average, and minimum gpa of all students in each department.","PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_30 ) (avg( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_86 ) (min( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_5 ) ?T1_dept_code WHERE { ?T1 a :student . ?T1 :stu_gpa ?T1_stu_gpa . ?T1 :stu_gpa ?T1_stu_gpa . ?T1 :stu_gpa ?T1_stu_gpa . ?T1 :dept_code ?T1_dept_code . } GROUP BY ?T1_dept_code",SELECT (max( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_30 ) (avg( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_86 ) (min( ?T1_stu_gpa) as ?aggregation_T1_stu_gpa_5 ) ?T1_dept_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stu_gpa> ?T1_stu_gpa . ?T1 <http://valuenet/ontop/stu_gpa> ?T1_stu_gpa . ?T1 <http://valuenet/ontop/stu_gpa> ?T1_stu_gpa . ?T1 <http://valuenet/ontop/dept_code> ?T1_dept_code . } GROUP BY ?T1_dept_code
Find the total credits of all classes offered by each department.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_crs_credit) as ?aggregation_T1_crs_credit_130 ) ?T1_dept_code WHERE { ?T1 a :course . ?T1 :crs_credit ?T1_crs_credit . ?T1 :dept_code ?T1_dept_code . } GROUP BY ?T1_dept_code",SELECT (sum( ?T1_crs_credit) as ?aggregation_T1_crs_credit_130 ) ?T1_dept_code WHERE { ?T1 a <http://valuenet/ontop/course> . ?T1 <http://valuenet/ontop/crs_credit> ?T1_crs_credit . ?T1 <http://valuenet/ontop/dept_code> ?T1_dept_code . } GROUP BY ?T1_dept_code
Find the name of the department that offers the largest number of credits of all classes.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T2 a :course . ?T2 :ref-dept_code ?T1 . ?T1 :dept_name ?T1_dept_name . ?T2 :crs_credit ?T2_crs_credit . } GROUP BY ?T1_dept_name ORDER BY DESC (sum( ?T2_crs_credit)) LIMIT 1",SELECT ?T1_dept_name WHERE { ?T1 a <http://valuenet/ontop/department> . ?T2 a <http://valuenet/ontop/course> . ?T2 <http://valuenet/ontop/ref-dept_code> ?T1 . ?T1 <http://valuenet/ontop/dept_name> ?T1_dept_name . ?T2 <http://valuenet/ontop/crs_credit> ?T2_crs_credit . } GROUP BY ?T1_dept_name ORDER BY DESC (sum( ?T2_crs_credit)) LIMIT 1
list names of all departments ordered by their names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dept_name WHERE { ?T1 a :department . ?T1 :dept_name ?T1_dept_name . ?T1 :dept_name ?T1_dept_name . } ORDER BY ASC (?T1_dept_name)",SELECT ?T1_dept_name WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dept_name> ?T1_dept_name . ?T1 <http://valuenet/ontop/dept_name> ?T1_dept_name . } ORDER BY ASC (?T1_dept_name)
List the codes of all courses that take place in room KLR209.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_class_code WHERE { ?T1 a :class . ?T1 :class_code ?T1_class_code . ?T1 :class_room ?T1_class_room . FILTER(?T1_class_room = 'KLR209') . }",SELECT ?T1_class_code WHERE { ?T1 a <http://valuenet/ontop/class> . ?T1 <http://valuenet/ontop/class_code> ?T1_class_code . ?T1 <http://valuenet/ontop/class_room> ?T1_class_room . FILTER(?T1_class_room = 'KLR209') . }
List the first name of all employees with job code PROF ordered by their date of birth.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname WHERE { ?T1 a :employee . ?T1 :emp_fname ?T1_emp_fname . ?T1 :emp_dob ?T1_emp_dob . ?T1 :emp_jobcode ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') . } ORDER BY ASC (?T1_emp_dob)",SELECT ?T1_emp_fname WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T1 <http://valuenet/ontop/emp_dob> ?T1_emp_dob . ?T1 <http://valuenet/ontop/emp_jobcode> ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') . } ORDER BY ASC (?T1_emp_dob)
Find the first names and offices of all professors sorted by alphabetical order of their first name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname ?T2_prof_office WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T1 :emp_fname ?T1_emp_fname . } ORDER BY ASC (?T1_emp_fname)",SELECT ?T1_emp_fname ?T2_prof_office WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/professor> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . } ORDER BY ASC (?T1_emp_fname)
What are the first names of the professors who do not teach a class.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T1 :emp_fname ?T1_emp_fname . ?T1 :emp_jobcode ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') . }} MINUS {SELECT (?T2_emp_fname as ?col1) WHERE { ?T2 a :employee . ?T2 :emp_fname ?T2_emp_fname . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T1 <http://valuenet/ontop/emp_jobcode> ?T1_emp_jobcode . FILTER(?T1_emp_jobcode = 'PROF') . }} MINUS {SELECT (?T2_emp_fname as ?col1) WHERE { ?T2 a <http://valuenet/ontop/employee> . ?T2 <http://valuenet/ontop/emp_fname> ?T2_emp_fname . } } }
What is the first names of the professors from the history department who do not teach a class.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a :employee . ?T2 a :department . ?T2 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :dept_name ?T2_dept_name . FILTER(?T2_dept_name = 'History') . }} MINUS {SELECT (?T3_emp_fname as ?col1) WHERE { ?T3 a :employee . ?T3 :emp_fname ?T3_emp_fname . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_emp_fname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/dept_name> ?T2_dept_name . FILTER(?T2_dept_name = 'History') . }} MINUS {SELECT (?T3_emp_fname as ?col1) WHERE { ?T3 a <http://valuenet/ontop/employee> . ?T3 <http://valuenet/ontop/emp_fname> ?T3_emp_fname . } } }
Find the last name and hire date of the professor who is in office DRE 102.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_lname ?T1_emp_hiredate WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :ref-emp_num ?T1 . ?T1 :emp_lname ?T1_emp_lname . ?T1 :emp_hiredate ?T1_emp_hiredate . ?T2 :prof_office ?T2_prof_office . FILTER(?T2_prof_office = 'DRE 102') . }",SELECT ?T1_emp_lname ?T1_emp_hiredate WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/professor> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_lname> ?T1_emp_lname . ?T1 <http://valuenet/ontop/emp_hiredate> ?T1_emp_hiredate . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . FILTER(?T2_prof_office = 'DRE 102') . }
Find the first name of the professor who is teaching two courses with code CIS-220 and QM-261.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :ref-prof_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :crs_code ?T2_crs_code . FILTER(?T2_crs_code = 'CIS-220') . FILTER (?T1_emp_fname in (?T3_emp_fname)) . ?T3 a :employee . ?T4 a :class . ?T4 :ref-prof_num ?T3 . ?T3 :emp_fname ?T3_emp_fname . ?T4 :crs_code ?T4_crs_code . FILTER(?T4_crs_code = 'QM-261') . }",SELECT DISTINCT ?T1_emp_fname WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/class> . ?T2 <http://valuenet/ontop/ref-prof_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/crs_code> ?T2_crs_code . FILTER(?T2_crs_code = 'CIS-220') . FILTER (?T1_emp_fname in (?T3_emp_fname)) . ?T3 a <http://valuenet/ontop/employee> . ?T4 a <http://valuenet/ontop/class> . ?T4 <http://valuenet/ontop/ref-prof_num> ?T3 . ?T3 <http://valuenet/ontop/emp_fname> ?T3_emp_fname . ?T4 <http://valuenet/ontop/crs_code> ?T4_crs_code . FILTER(?T4_crs_code = 'QM-261') . }
Find the first name and gpa of the students whose gpa is lower than the average gpa of all students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stu_fname ?T1_stu_gpa WHERE { ?T1 a :student . ?T1 :stu_fname ?T1_stu_fname . ?T1 :stu_gpa ?T1_stu_gpa . ?T1 :stu_gpa ?T1_stu_gpa . FILTER(?T1_stu_gpa < (?aggregation_T22_stu_gpa_95)) . {SELECT (avg( ?T22_stu_gpa) as ?aggregation_T22_stu_gpa_95 ) WHERE { ?T22 a :student . ?T22 :stu_gpa ?T22_stu_gpa . } } }",SELECT ?T1_stu_fname ?T1_stu_gpa WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stu_fname> ?T1_stu_fname . ?T1 <http://valuenet/ontop/stu_gpa> ?T1_stu_gpa . ?T1 <http://valuenet/ontop/stu_gpa> ?T1_stu_gpa . FILTER(?T1_stu_gpa < (?aggregation_T22_stu_gpa_95)) . {SELECT (avg( ?T22_stu_gpa) as ?aggregation_T22_stu_gpa_95 ) WHERE { ?T22 a <http://valuenet/ontop/student> . ?T22 <http://valuenet/ontop/stu_gpa> ?T22_stu_gpa . } } }
Find the first names of all instructors who have taught some course and the course code.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname ?T2_crs_code WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :ref-prof_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :crs_code ?T2_crs_code . }",SELECT ?T1_emp_fname ?T2_crs_code WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/class> . ?T2 <http://valuenet/ontop/ref-prof_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/crs_code> ?T2_crs_code . }
Find the first names of all instructors who have taught some course and the course description.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname ?T2_crs_description WHERE { ?T1 a :employee . ?T13 a :department . ?T13 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :crs_description ?T2_crs_description . ?T2 a :course . ?T2 :ref-dept_code ?T13 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :crs_description ?T2_crs_description . }",SELECT ?T1_emp_fname ?T2_crs_description WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T13 a <http://valuenet/ontop/department> . ?T13 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/crs_description> ?T2_crs_description . ?T2 a <http://valuenet/ontop/course> . ?T2 <http://valuenet/ontop/ref-dept_code> ?T13 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/crs_description> ?T2_crs_description . }
Find the first names and offices of all instructors who have taught some course and also find the course description.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T3 :crs_description ?T3_crs_description . ?T14 a :department . ?T2 :ref-dept_code ?T14 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T3 :crs_description ?T3_crs_description . ?T3 a :course . ?T3 :ref-dept_code ?T14 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T3 :crs_description ?T3_crs_description . }",SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/professor> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T3 <http://valuenet/ontop/crs_description> ?T3_crs_description . ?T14 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-dept_code> ?T14 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T3 <http://valuenet/ontop/crs_description> ?T3_crs_description . ?T3 a <http://valuenet/ontop/course> . ?T3 <http://valuenet/ontop/ref-dept_code> ?T14 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T3 <http://valuenet/ontop/crs_description> ?T3_crs_description . }
Find the first names and offices of all instructors who have taught some course and the course description and the department name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description ?T4_dept_name WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T3 :crs_description ?T3_crs_description . ?T4 :dept_name ?T4_dept_name . ?T4 a :department . ?T2 :ref-dept_code ?T4 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T3 :crs_description ?T3_crs_description . ?T4 :dept_name ?T4_dept_name . ?T3 a :course . ?T3 :ref-dept_code ?T4 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_office ?T2_prof_office . ?T3 :crs_description ?T3_crs_description . ?T4 :dept_name ?T4_dept_name . }",SELECT ?T1_emp_fname ?T2_prof_office ?T3_crs_description ?T4_dept_name WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/professor> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T3 <http://valuenet/ontop/crs_description> ?T3_crs_description . ?T4 <http://valuenet/ontop/dept_name> ?T4_dept_name . ?T4 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-dept_code> ?T4 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T3 <http://valuenet/ontop/crs_description> ?T3_crs_description . ?T4 <http://valuenet/ontop/dept_name> ?T4_dept_name . ?T3 a <http://valuenet/ontop/course> . ?T3 <http://valuenet/ontop/ref-dept_code> ?T4 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_office> ?T2_prof_office . ?T3 <http://valuenet/ontop/crs_description> ?T3_crs_description . ?T4 <http://valuenet/ontop/dept_name> ?T4_dept_name . }
Find names of all students who took some course and got A or C.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stu_fname ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :ref-stu_num ?T1 . ?T1 :stu_fname ?T1_stu_fname . ?T1 :stu_lname ?T1_stu_lname . ?T2 :enroll_grade ?T2_enroll_grade . ?T2 :enroll_grade ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C' || ?T2_enroll_grade = 'A') . }",SELECT ?T1_stu_fname ?T1_stu_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/enroll> . ?T2 <http://valuenet/ontop/ref-stu_num> ?T1 . ?T1 <http://valuenet/ontop/stu_fname> ?T1_stu_fname . ?T1 <http://valuenet/ontop/stu_lname> ?T1_stu_lname . ?T2 <http://valuenet/ontop/enroll_grade> ?T2_enroll_grade . ?T2 <http://valuenet/ontop/enroll_grade> ?T2_enroll_grade . FILTER(?T2_enroll_grade = 'C' || ?T2_enroll_grade = 'A') . }
Find the first names of all professors in the Accounting department who is teaching some course and the class room.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname ?T2_class_room WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :ref-prof_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :class_room ?T2_class_room . ?T3 :dept_name ?T3_dept_name . ?T3 a :department . ?T3 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :class_room ?T2_class_room . ?T3 :dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Accounting') . }",SELECT ?T1_emp_fname ?T2_class_room WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/class> . ?T2 <http://valuenet/ontop/ref-prof_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/class_room> ?T2_class_room . ?T3 <http://valuenet/ontop/dept_name> ?T3_dept_name . ?T3 a <http://valuenet/ontop/department> . ?T3 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/class_room> ?T2_class_room . ?T3 <http://valuenet/ontop/dept_name> ?T3_dept_name . FILTER(?T3_dept_name = 'Accounting') . }
Find the first names and degree of all professors who are teaching some class in Computer Info. Systems department.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_emp_fname ?T2_prof_high_degree WHERE { ?T1 a :employee . ?T2 a :professor . ?T2 :ref-emp_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_high_degree ?T2_prof_high_degree . ?T3 :dept_name ?T3_dept_name . ?T3 a :department . ?T2 :ref-dept_code ?T3 . ?T1 :emp_fname ?T1_emp_fname . ?T2 :prof_high_degree ?T2_prof_high_degree . ?T3 :dept_name ?T3_dept_name . FILTER(?T3_dept_name = 'Computer Info. Systems') . }",SELECT DISTINCT ?T1_emp_fname ?T2_prof_high_degree WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/professor> . ?T2 <http://valuenet/ontop/ref-emp_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_high_degree> ?T2_prof_high_degree . ?T3 <http://valuenet/ontop/dept_name> ?T3_dept_name . ?T3 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-dept_code> ?T3 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . ?T2 <http://valuenet/ontop/prof_high_degree> ?T2_prof_high_degree . ?T3 <http://valuenet/ontop/dept_name> ?T3_dept_name . FILTER(?T3_dept_name = 'Computer Info. Systems') . }
What is the last name of the student who got a grade A in the class with code 10018.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stu_lname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :ref-stu_num ?T1 . ?T1 :stu_lname ?T1_stu_lname . ?T2 :enroll_grade ?T2_enroll_grade . ?T2 :class_code ?T2_class_code . FILTER(?T2_enroll_grade = 'A' && ?T2_class_code = '10018') . }",SELECT ?T1_stu_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/enroll> . ?T2 <http://valuenet/ontop/ref-stu_num> ?T1 . ?T1 <http://valuenet/ontop/stu_lname> ?T1_stu_lname . ?T2 <http://valuenet/ontop/enroll_grade> ?T2_enroll_grade . ?T2 <http://valuenet/ontop/class_code> ?T2_class_code . FILTER(?T2_enroll_grade = 'A' && ?T2_class_code = '10018') . }
Find the first names of professors who are teaching more than one class.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_emp_fname WHERE { ?T1 a :employee . ?T2 a :class . ?T2 :ref-prof_num ?T1 . ?T1 :emp_fname ?T1_emp_fname . } GROUP BY ?T1_emp_fname HAVING(count( *) > 1)",SELECT ?T1_emp_fname WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T2 a <http://valuenet/ontop/class> . ?T2 <http://valuenet/ontop/ref-prof_num> ?T1 . ?T1 <http://valuenet/ontop/emp_fname> ?T1_emp_fname . } GROUP BY ?T1_emp_fname HAVING(count( *) > 1)
Find the first names of students who took exactly one class.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stu_fname WHERE { ?T1 a :student . ?T2 a :enroll . ?T2 :ref-stu_num ?T1 . ?T1 :stu_fname ?T1_stu_fname . } GROUP BY ?T1_stu_fname HAVING(count( *) = 1)",SELECT ?T1_stu_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/enroll> . ?T2 <http://valuenet/ontop/ref-stu_num> ?T1 . ?T1 <http://valuenet/ontop/stu_fname> ?T1_stu_fname . } GROUP BY ?T1_stu_fname HAVING(count( *) = 1)
