nl_question,sparql_partial_uri,sparql_complete_uri
List the names of companies by ascending number of sales.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :company . ?T1 :name ?T1_name . ?T1 :sales_in_billion ?T1_sales_in_billion . } ORDER BY ASC (?T1_sales_in_billion)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/sales_in_billion> ?T1_sales_in_billion . } ORDER BY ASC (?T1_sales_in_billion)
Show the most common headquarter for companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_headquarters (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . } GROUP BY ?T1_headquarters ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_headquarters (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . } GROUP BY ?T1_headquarters ORDER BY DESC (?aggregation_all) LIMIT 1
Show the headquarters that have at least two companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . } GROUP BY ?T1_headquarters HAVING(count( *) >= 2)",SELECT ?T1_headquarters WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . } GROUP BY ?T1_headquarters HAVING(count( *) >= 2)
Show the headquarters that have both companies in banking industry and companies in oil and gas industry.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . ?T1 :industry ?T1_industry . FILTER(?T1_industry = 'Banking') . FILTER (?T1_headquarters in (?T2_headquarters)) . ?T2 a :company . ?T2 :headquarters ?T2_headquarters . ?T2 :industry ?T2_industry . FILTER(?T2_industry = 'Oil && gas') . }",SELECT DISTINCT ?T1_headquarters WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . ?T1 <http://valuenet/ontop/industry> ?T1_industry . FILTER(?T1_industry = 'Banking') . FILTER (?T1_headquarters in (?T2_headquarters)) . ?T2 a <http://valuenet/ontop/company> . ?T2 <http://valuenet/ontop/headquarters> ?T2_headquarters . ?T2 <http://valuenet/ontop/industry> ?T2_industry . FILTER(?T2_industry = 'Oil && gas') . }
Show the names of companies and of employees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :company . ?T13 a :employment . ?T13 :ref-company ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :people . ?T13 :ref-people ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . }",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/company> . ?T13 a <http://valuenet/ontop/employment> . ?T13 <http://valuenet/ontop/ref-company> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/people> . ?T13 <http://valuenet/ontop/ref-people> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show names of companies and that of employees in descending order of number of years working for that employee.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :company . ?T3 a :employment . ?T3 :ref-company ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :year_working ?T3_year_working . ?T2 a :people . ?T3 :ref-people ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :year_working ?T3_year_working . } ORDER BY ASC (?T3_year_working)",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/company> . ?T3 a <http://valuenet/ontop/employment> . ?T3 <http://valuenet/ontop/ref-company> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/year_working> ?T3_year_working . ?T2 a <http://valuenet/ontop/people> . ?T3 <http://valuenet/ontop/ref-people> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/year_working> ?T3_year_working . } ORDER BY ASC (?T3_year_working)
Show the names of employees that work for companies with sales bigger than 200.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T13 a :employment . ?T13 :ref-people ?T1 . ?T1 :name ?T1_name . ?T2 :sales_in_billion ?T2_sales_in_billion . ?T2 a :company . ?T13 :ref-company ?T2 . ?T1 :name ?T1_name . ?T2 :sales_in_billion ?T2_sales_in_billion . FILTER(?T2_sales_in_billion > 200) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T13 a <http://valuenet/ontop/employment> . ?T13 <http://valuenet/ontop/ref-people> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/sales_in_billion> ?T2_sales_in_billion . ?T2 a <http://valuenet/ontop/company> . ?T13 <http://valuenet/ontop/ref-company> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/sales_in_billion> ?T2_sales_in_billion . FILTER(?T2_sales_in_billion > 200) . }
Show the names of companies and the number of employees they have,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T2 a :employment . ?T2 :ref-company ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T2 a <http://valuenet/ontop/employment> . ?T2 <http://valuenet/ontop/ref-company> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
List the names of people that are not employed by any company,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) . {SELECT ?T22_people_id WHERE { ?T22 a :employment . ?T22 :people_id ?T22_people_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/people_id> ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) . {SELECT ?T22_people_id WHERE { ?T22 a <http://valuenet/ontop/employment> . ?T22 <http://valuenet/ontop/people_id> ?T22_people_id . } } }
list the names of the companies with more than 200 sales in the descending order of sales and profits.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :company . ?T1 :name ?T1_name . ?T1 :sales_in_billion ?T1_sales_in_billion . ?T1 :sales_in_billion ?T1_sales_in_billion . FILTER(?T1_sales_in_billion > 200) . } ORDER BY DESC (?T1_sales_in_billion)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/sales_in_billion> ?T1_sales_in_billion . ?T1 <http://valuenet/ontop/sales_in_billion> ?T1_sales_in_billion . FILTER(?T1_sales_in_billion > 200) . } ORDER BY DESC (?T1_sales_in_billion)
