nl_question,sparql_partial_uri,sparql_complete_uri
List all department names ordered by their starting date.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dname WHERE { ?T1 a :department . ?T1 :dname ?T1_dname . ?T1 :mgr_start_date ?T1_mgr_start_date . } ORDER BY ASC (?T1_mgr_start_date)",SELECT ?T1_dname WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/dname> ?T1_dname . ?T1 <http://valuenet/ontop/mgr_start_date> ?T1_mgr_start_date . } ORDER BY ASC (?T1_mgr_start_date)
find all dependent names who have a spouse relation with some employee.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dependent_name WHERE { ?T1 a :dependent . ?T1 :dependent_name ?T1_dependent_name . ?T1 :relationship ?T1_relationship . FILTER(?T1_relationship = 'Spouse') . }",SELECT ?T1_dependent_name WHERE { ?T1 a <http://valuenet/ontop/dependent> . ?T1 <http://valuenet/ontop/dependent_name> ?T1_dependent_name . ?T1 <http://valuenet/ontop/relationship> ?T1_relationship . FILTER(?T1_relationship = 'Spouse') . }
Return the first names and last names of employees who earn more than 30000 in salary.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :employee . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :salary ?T1_salary . FILTER(?T1_salary > 30000) . }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary > 30000) . }
Find the number of employees of each gender whose salary is lower than 50000.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a :employee . ?T1 :sex ?T1_sex . ?T1 :salary ?T1_salary . FILTER(?T1_salary < 50000) . } GROUP BY ?T1_sex",SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary < 50000) . } GROUP BY ?T1_sex
"list the first and last names, and the addresses of all employees in the ascending order of their birth date.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname ?T1_address WHERE { ?T1 a :employee . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :address ?T1_address . ?T1 :bdate ?T1_bdate . } ORDER BY ASC (?T1_bdate)",SELECT ?T1_fname ?T1_lname ?T1_address WHERE { ?T1 a <http://valuenet/ontop/employee> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/address> ?T1_address . ?T1 <http://valuenet/ontop/bdate> ?T1_bdate . } ORDER BY ASC (?T1_bdate)
