nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of companies.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/companies> . }
List the names of companies in descending order of market value.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :companies . ?T1 :name ?T1_name . ?T1 :market_value_billion ?T1_market_value_billion . } ORDER BY DESC (?T1_market_value_billion)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/market_value_billion> ?T1_market_value_billion . } ORDER BY DESC (?T1_market_value_billion)
Find the names of the companies whose headquarters are not located in 'USA'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :companies . ?T1 :name ?T1_name . ?T1 :headquarters ?T1_headquarters . FILTER(?T1_headquarters != 'USA') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . FILTER(?T1_headquarters != 'USA') . }
List the name and assets of each company in ascending order of company name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_assets_billion WHERE { ?T1 a :companies . ?T1 :name ?T1_name . ?T1 :assets_billion ?T1_assets_billion . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name ?T1_assets_billion WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/assets_billion> ?T1_assets_billion . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Compute the average profits companies make.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_profits_billion) as ?aggregation_T1_profits_billion_38 ) WHERE { ?T1 a :companies . ?T1 :profits_billion ?T1_profits_billion . }",SELECT (avg( ?T1_profits_billion) as ?aggregation_T1_profits_billion_38 ) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/profits_billion> ?T1_profits_billion . }
What are the maximum and minimum sales of the companies whose industries are not 'Banking'.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_sales_billion) as ?aggregation_T1_sales_billion_134 ) (min( ?T1_sales_billion) as ?aggregation_T1_sales_billion_73 ) WHERE { ?T1 a :companies . ?T1 :sales_billion ?T1_sales_billion . ?T1 :sales_billion ?T1_sales_billion . ?T1 :industry ?T1_industry . FILTER(?T1_industry != 'Banking') . }",SELECT (max( ?T1_sales_billion) as ?aggregation_T1_sales_billion_134 ) (min( ?T1_sales_billion) as ?aggregation_T1_sales_billion_73 ) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/sales_billion> ?T1_sales_billion . ?T1 <http://valuenet/ontop/sales_billion> ?T1_sales_billion . ?T1 <http://valuenet/ontop/industry> ?T1_industry . FILTER(?T1_industry != 'Banking') . }
Find the maximum and minimum sales of the companies that are not in the 'Banking' industry.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_sales_billion) as ?aggregation_T1_sales_billion_107 ) (min( ?T1_sales_billion) as ?aggregation_T1_sales_billion_129 ) WHERE { ?T1 a :companies . ?T1 :sales_billion ?T1_sales_billion . ?T1 :sales_billion ?T1_sales_billion . ?T1 :industry ?T1_industry . FILTER(?T1_industry != 'Banking') . }",SELECT (max( ?T1_sales_billion) as ?aggregation_T1_sales_billion_107 ) (min( ?T1_sales_billion) as ?aggregation_T1_sales_billion_129 ) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/sales_billion> ?T1_sales_billion . ?T1 <http://valuenet/ontop/sales_billion> ?T1_sales_billion . ?T1 <http://valuenet/ontop/industry> ?T1_industry . FILTER(?T1_industry != 'Banking') . }
Count the number of distinct company industries.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_industry) as ?aggregation_T1_industry_26 ) WHERE { ?T1 a :companies . ?T1 :industry ?T1_industry . }",SELECT DISTINCT (count(DISTINCT ?T1_industry) as ?aggregation_T1_industry_26 ) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/industry> ?T1_industry . }
List the names of buildings in descending order of building height.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :buildings . ?T1 :name ?T1_name . ?T1 :height ?T1_height . } ORDER BY DESC (?T1_height)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/buildings> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY DESC (?T1_height)
Find the stories of the building with the largest height.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stories WHERE { ?T1 a :buildings . ?T1 :stories ?T1_stories . ?T1 :height ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1",SELECT ?T1_stories WHERE { ?T1 a <http://valuenet/ontop/buildings> . ?T1 <http://valuenet/ontop/stories> ?T1_stories . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1
List the name of a building along with the name of a company whose office is in the building.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :companies . ?T13 a :office_locations . ?T13 :ref-company ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :buildings . ?T13 :ref-building ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . }",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T13 a <http://valuenet/ontop/office_locations> . ?T13 <http://valuenet/ontop/ref-company> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/buildings> . ?T13 <http://valuenet/ontop/ref-building> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the names of the buildings that have more than one company offices.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :buildings . ?T2 a :office_locations . ?T2 :ref-building ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/buildings> . ?T2 a <http://valuenet/ontop/office_locations> . ?T2 <http://valuenet/ontop/ref-building> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)
Show the name of the building that has the most company offices.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :buildings . ?T2 a :office_locations . ?T2 :ref-building ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/buildings> . ?T2 a <http://valuenet/ontop/office_locations> . ?T2 <http://valuenet/ontop/ref-building> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
"Please show the names of the buildings whose status is 'on-hold', in ascending order of stories.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :buildings . ?T1 :name ?T1_name . ?T1 :stories ?T1_stories . ?T1 :status ?T1_status . FILTER(?T1_status = 'on-hold') . } ORDER BY ASC (?T1_stories)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/buildings> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/stories> ?T1_stories . ?T1 <http://valuenet/ontop/status> ?T1_status . FILTER(?T1_status = 'on-hold') . } ORDER BY ASC (?T1_stories)
Please show each industry and the corresponding number of companies in that industry.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :industry ?T1_industry . } GROUP BY ?T1_industry",SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/industry> ?T1_industry . } GROUP BY ?T1_industry
Please show the industries of companies in descending order of the number of companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_industry WHERE { ?T1 a :companies . ?T1 :industry ?T1_industry . } GROUP BY ?T1_industry ORDER BY DESC (count( *) )",SELECT ?T1_industry WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/industry> ?T1_industry . } GROUP BY ?T1_industry ORDER BY DESC (count( *) )
List the industry shared by the most companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :industry ?T1_industry . } GROUP BY ?T1_industry ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_industry (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/industry> ?T1_industry . } GROUP BY ?T1_industry ORDER BY DESC (?aggregation_all) LIMIT 1
List the names of buildings that have no company office.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :buildings . ?T1 :name ?T1_name . ?T1 :id ?T1_id . FILTER(?T1_id not in (?T22_building_id)) . {SELECT ?T22_building_id WHERE { ?T22 a :office_locations . ?T22 :building_id ?T22_building_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/buildings> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/id> ?T1_id . FILTER(?T1_id not in (?T22_building_id)) . {SELECT ?T22_building_id WHERE { ?T22 a <http://valuenet/ontop/office_locations> . ?T22 <http://valuenet/ontop/building_id> ?T22_building_id . } } }
Show the industries shared by companies whose headquarters are 'USA' and companies whose headquarters are 'China'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_industry WHERE { ?T1 a :companies . ?T1 :industry ?T1_industry . ?T1 :headquarters ?T1_headquarters . FILTER(?T1_headquarters = 'USA') . FILTER (?T1_industry in (?T2_industry)) . ?T2 a :companies . ?T2 :industry ?T2_industry . ?T2 :headquarters ?T2_headquarters . FILTER(?T2_headquarters = 'China') . }",SELECT DISTINCT ?T1_industry WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/industry> ?T1_industry . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . FILTER(?T1_headquarters = 'USA') . FILTER (?T1_industry in (?T2_industry)) . ?T2 a <http://valuenet/ontop/companies> . ?T2 <http://valuenet/ontop/industry> ?T2_industry . ?T2 <http://valuenet/ontop/headquarters> ?T2_headquarters . FILTER(?T2_headquarters = 'China') . }
"Find the number of companies whose industry is 'Banking' or 'Conglomerate',","PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :companies . ?T1 :industry ?T1_industry . ?T1 :industry ?T1_industry . FILTER(?T1_industry = 'Banking' || ?T1_industry = 'Conglomerate') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/industry> ?T1_industry . ?T1 <http://valuenet/ontop/industry> ?T1_industry . FILTER(?T1_industry = 'Banking' || ?T1_industry = 'Conglomerate') . }
Show the headquarters shared by more than two companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_headquarters WHERE { ?T1 a :companies . ?T1 :headquarters ?T1_headquarters . } GROUP BY ?T1_headquarters HAVING(count( *) > 2)",SELECT ?T1_headquarters WHERE { ?T1 a <http://valuenet/ontop/companies> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . } GROUP BY ?T1_headquarters HAVING(count( *) > 2)
