nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of countries.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . }
List the names of counties in descending order of population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :name ?T1_name . ?T1 :population ?T1_population . } ORDER BY DESC (?T1_population)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY DESC (?T1_population)
List the distinct police forces of counties whose location is not on east side.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_police_force WHERE { ?T1 a :county_public_safety . ?T1 :police_force ?T1_police_force . ?T1 :location ?T1_location . FILTER(?T1_location != 'East') . }",SELECT DISTINCT ?T1_police_force WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/police_force> ?T1_police_force . ?T1 <http://valuenet/ontop/location> ?T1_location . FILTER(?T1_location != 'East') . }
Return the minimum and maximum crime rates across all counties.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_crime_rate) as ?aggregation_T1_crime_rate_147 ) (max( ?T1_crime_rate) as ?aggregation_T1_crime_rate_11 ) WHERE { ?T1 a :county_public_safety . ?T1 :crime_rate ?T1_crime_rate . ?T1 :crime_rate ?T1_crime_rate . }",SELECT (min( ?T1_crime_rate) as ?aggregation_T1_crime_rate_147 ) (max( ?T1_crime_rate) as ?aggregation_T1_crime_rate_11 ) WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/crime_rate> ?T1_crime_rate . ?T1 <http://valuenet/ontop/crime_rate> ?T1_crime_rate . }
Show the crime rates of counties in ascending order of number of police officers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_crime_rate WHERE { ?T1 a :county_public_safety . ?T1 :crime_rate ?T1_crime_rate . ?T1 :police_officers ?T1_police_officers . } ORDER BY ASC (?T1_police_officers)",SELECT ?T1_crime_rate WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/crime_rate> ?T1_crime_rate . ?T1 <http://valuenet/ontop/police_officers> ?T1_police_officers . } ORDER BY ASC (?T1_police_officers)
"Return the names of cities, ordered alphabetically.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Return the hispanic percentage for cities in which the black percentage is greater than 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hispanic WHERE { ?T1 a :city . ?T1 :hispanic ?T1_hispanic . ?T1 :black ?T1_black . FILTER(?T1_black > 10) . }",SELECT ?T1_hispanic WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/hispanic> ?T1_hispanic . ?T1 <http://valuenet/ontop/black> ?T1_black . FILTER(?T1_black > 10) . }
List the name of the county with the largest population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :name ?T1_name . ?T1 :population ?T1_population . } ORDER BY DESC (?T1_population) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY DESC (?T1_population) LIMIT 1
List the names of the city with the top 5 white percentages.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :name ?T1_name . ?T1 :white ?T1_white . } ORDER BY DESC (?T1_white) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/white> ?T1_white . } ORDER BY DESC (?T1_white) LIMIT 1
Show names of cities and names of counties they are in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :city . ?T2 a :county_public_safety . ?T1 :ref-county ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . }",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T2 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/ref-county> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show white percentages of cities and the crime rates of counties they are in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_white ?T2_crime_rate WHERE { ?T1 a :city . ?T2 a :county_public_safety . ?T1 :ref-county ?T2 . ?T1 :white ?T1_white . ?T2 :crime_rate ?T2_crime_rate . }",SELECT ?T1_white ?T2_crime_rate WHERE { ?T1 a <http://valuenet/ontop/city> . ?T2 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/ref-county> ?T2 . ?T1 <http://valuenet/ontop/white> ?T1_white . ?T2 <http://valuenet/ontop/crime_rate> ?T2_crime_rate . }
Show the name of cities in the county that has the largest number of police officers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :name ?T1_name . ?T1 :county_id ?T1_county_id . FILTER(?T1_county_id = (?T22_police_officers)) . {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_id ?T22_county_id . ?T22 :police_officers ?T22_police_officers . } ORDER BY DESC (?T22_police_officers) LIMIT 1 } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/county_id> ?T1_county_id . FILTER(?T1_county_id = (?T22_police_officers)) . {SELECT ?T22_county_id WHERE { ?T22 a <http://valuenet/ontop/county_public_safety> . ?T22 <http://valuenet/ontop/county_id> ?T22_county_id . ?T22 <http://valuenet/ontop/police_officers> ?T22_police_officers . } ORDER BY DESC (?T22_police_officers) LIMIT 1 } }
Show the number of cities in counties that have a population more than 20000.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T1 :county_id ?T1_county_id . FILTER(?T1_county_id in (?T22_population)) . {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_id ?T22_county_id . ?T22 :population ?T22_population . FILTER(?T22_population > 20000) . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/county_id> ?T1_county_id . FILTER(?T1_county_id in (?T22_population)) . {SELECT ?T22_county_id WHERE { ?T22 a <http://valuenet/ontop/county_public_safety> . ?T22 <http://valuenet/ontop/county_id> ?T22_county_id . ?T22 <http://valuenet/ontop/population> ?T22_population . FILTER(?T22_population > 20000) . } } }
Show the crime rate of counties with a city having white percentage more than 90.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_crime_rate WHERE { ?T1 a :county_public_safety . ?T2 a :city . ?T2 :ref-county ?T1 . ?T1 :crime_rate ?T1_crime_rate . ?T2 :white ?T2_white . FILTER(?T2_white > 90) . }",SELECT ?T1_crime_rate WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T2 a <http://valuenet/ontop/city> . ?T2 <http://valuenet/ontop/ref-county> ?T1 . ?T1 <http://valuenet/ontop/crime_rate> ?T1_crime_rate . ?T2 <http://valuenet/ontop/white> ?T2_white . FILTER(?T2_white > 90) . }
Please show the police forces and the number of counties with each police force.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_police_force (count( *) as ?aggregation_all) WHERE { ?T1 a :county_public_safety . ?T1 :police_force ?T1_police_force . } GROUP BY ?T1_police_force",SELECT ?T1_police_force (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/police_force> ?T1_police_force . } GROUP BY ?T1_police_force
List the names of counties that do not have any cities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :county_public_safety . ?T1 :name ?T1_name . ?T1 :county_id ?T1_county_id . FILTER(?T1_county_id not in (?T22_county_id)) . {SELECT ?T22_county_id WHERE { ?T22 a :city . ?T22 :county_id ?T22_county_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/county_id> ?T1_county_id . FILTER(?T1_county_id not in (?T22_county_id)) . {SELECT ?T22_county_id WHERE { ?T22 a <http://valuenet/ontop/city> . ?T22 <http://valuenet/ontop/county_id> ?T22_county_id . } } }
Show the names of cities in counties that have a crime rate less than 100.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :city . ?T1 :name ?T1_name . ?T1 :county_id ?T1_county_id . FILTER(?T1_county_id in (?T22_crime_rate)) . {SELECT ?T22_county_id WHERE { ?T22 a :county_public_safety . ?T22 :county_id ?T22_county_id . ?T22 :crime_rate ?T22_crime_rate . FILTER(?T22_crime_rate < 100) . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/county_id> ?T1_county_id . FILTER(?T1_county_id in (?T22_crime_rate)) . {SELECT ?T22_county_id WHERE { ?T22 a <http://valuenet/ontop/county_public_safety> . ?T22 <http://valuenet/ontop/county_id> ?T22_county_id . ?T22 <http://valuenet/ontop/crime_rate> ?T22_crime_rate . FILTER(?T22_crime_rate < 100) . } } }
Show the case burden of counties in descending order of population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_case_burden WHERE { ?T1 a :county_public_safety . ?T1 :case_burden ?T1_case_burden . ?T1 :population ?T1_population . } ORDER BY DESC (?T1_population)",SELECT ?T1_case_burden WHERE { ?T1 a <http://valuenet/ontop/county_public_safety> . ?T1 <http://valuenet/ontop/case_burden> ?T1_case_burden . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY DESC (?T1_population)
