nl_question,sparql_partial_uri,sparql_complete_uri
Report the name of all campuses in Los Angeles county.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses-campus ?T1_campus . ?T1 :county ?T1_county . FILTER(?T1_county = 'Los Angeles') . }",SELECT ?T1_campus WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T1 <http://valuenet/ontop/county> ?T1_county . FILTER(?T1_county = 'Los Angeles') . }
Find all the campuses opened in 1958.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses-campus ?T1_campus . ?T1 :year ?T1_year . FILTER(?T1_year = 1958) . }",SELECT ?T1_campus WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 1958) . }
Find the name of the campuses opened before 1800.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T1 :campuses-campus ?T1_campus . ?T1 :year ?T1_year . FILTER(?T1_year < 1800) . }",SELECT ?T1_campus WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year < 1800) . }
"Find the name of the campuses that is in Northridge, Los Angeles or in San Francisco, San Francisco.","PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_campus as ?col1) WHERE { ?T1 a :campuses . ?T1 :campuses-campus ?T1_campus . ?T1 :location ?T1_location . ?T1 :county ?T1_county . FILTER(?T1_location = 'Northridge' && ?T1_county = 'Los Angeles') . }} UNION {SELECT (?T1_campus as ?col1) WHERE { ?T1 a :campuses . ?T1 :campuses-campus ?T1_campus . ?T1 :location ?T1_location . ?T1 :county ?T1_county . FILTER(?T1_location = 'San Francisco' && ?T1_county = 'San Francisco') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_campus as ?col1) WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/county> ?T1_county . FILTER(?T1_location = 'Northridge' && ?T1_county = 'Los Angeles') . }} UNION {SELECT (?T1_campus as ?col1) WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/county> ?T1_county . FILTER(?T1_location = 'San Francisco' && ?T1_county = 'San Francisco') . } } }
Find the count of universities whose campus fee is greater than the average campus fee.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :csu_fees . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_193)) . {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_193 ) WHERE { ?T22 a :csu_fees . ?T22 <http://valuenet/ontop/csu_fees-campusfee> ?T22_campusfee . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/csu_fees> . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_193)) . {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_193 ) WHERE { ?T22 a <http://valuenet/ontop/csu_fees> . ?T22 <http://valuenet/ontop/csu_fees-campusfee> ?T22_campusfee . } } }
Find the count of universities whose campus fee is greater than the average campus fee.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :csu_fees . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_82)) . {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_82 ) WHERE { ?T22 a :csu_fees . ?T22 <http://valuenet/ontop/csu_fees-campusfee> ?T22_campusfee . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/csu_fees> . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . FILTER(?T1_campusfee > (?aggregation_T22_campusfee_82)) . {SELECT (avg( ?T22_campusfee) as ?aggregation_T22_campusfee_82 ) WHERE { ?T22 a <http://valuenet/ontop/csu_fees> . ?T22 <http://valuenet/ontop/csu_fees-campusfee> ?T22_campusfee . } } }
Find the average fee on a CSU campus in 1996,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_campusfee) as ?aggregation_T1_campusfee_122 ) WHERE { ?T1 a :csu_fees . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . ?T1 :year ?T1_year . FILTER(?T1_year = 1996) . }",SELECT (avg( ?T1_campusfee) as ?aggregation_T1_campusfee_122 ) WHERE { ?T1 a <http://valuenet/ontop/csu_fees> . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 1996) . }
report the total number of degrees granted between 1998 and 2002.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_139 ) WHERE { ?T1 a :campuses . ?T2 a :degrees . ?T2 :ref-campus ?T1 . ?T1 :campuses-campus ?T1_campus . ?T2 :degrees ?T2_degrees . ?T2 :year ?T2_year . ?T2 :year ?T2_year . FILTER(?T2_year >= 1998 && ?T2_year <= 2002) . } GROUP BY ?T1_campus",SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_139 ) WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T2 a <http://valuenet/ontop/degrees> . ?T2 <http://valuenet/ontop/ref-campus> ?T1 . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T2 <http://valuenet/ontop/degrees> ?T2_degrees . ?T2 <http://valuenet/ontop/year> ?T2_year . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year >= 1998 && ?T2_year <= 2002) . } GROUP BY ?T1_campus
"For each Orange county campus, report the number of degrees granted after 2000.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_123 ) WHERE { ?T1 a :campuses . ?T2 a :degrees . ?T2 :ref-campus ?T1 . ?T1 :campuses-campus ?T1_campus . ?T2 :degrees ?T2_degrees . ?T1 :county ?T1_county . ?T2 :year ?T2_year . FILTER(?T1_county = 'Orange' && ?T2_year >= 2000) . } GROUP BY ?T1_campus",SELECT ?T1_campus (sum( ?T2_degrees) as ?aggregation_T2_degrees_123 ) WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T2 a <http://valuenet/ontop/degrees> . ?T2 <http://valuenet/ontop/ref-campus> ?T1 . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T2 <http://valuenet/ontop/degrees> ?T2_degrees . ?T1 <http://valuenet/ontop/county> ?T1_county . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T1_county = 'Orange' && ?T2_year >= 2000) . } GROUP BY ?T1_campus
Find the names of the campus which has more faculties in 2002 than every campus in Orange county.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T2 a :faculty . ?T2 :ref-campus ?T1 . ?T1 :campuses-campus ?T1_campus . ?T2 :year ?T2_year . ?T2 :faculty ?T2_faculty . FILTER(?T2_year = 2002 && ?T2_faculty > (?T24_county)) . {SELECT (max( ?T23_faculty) as ?aggregation_T23_faculty_197 ) WHERE { ?T23 a :faculty . ?T24 a :campuses . ?T23 :ref-campus ?T24 . ?T23 :faculty ?T23_faculty . ?T23 :year ?T23_year . ?T24 :county ?T24_county . FILTER(?T23_year = 2002 && ?T24_county = 'Orange') . } } }",SELECT ?T1_campus WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T2 a <http://valuenet/ontop/faculty> . ?T2 <http://valuenet/ontop/ref-campus> ?T1 . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T2 <http://valuenet/ontop/year> ?T2_year . ?T2 <http://valuenet/ontop/faculty> ?T2_faculty . FILTER(?T2_year = 2002 && ?T2_faculty > (?T24_county)) . {SELECT (max( ?T23_faculty) as ?aggregation_T23_faculty_197 ) WHERE { ?T23 a <http://valuenet/ontop/faculty> . ?T24 a <http://valuenet/ontop/campuses> . ?T23 <http://valuenet/ontop/ref-campus> ?T24 . ?T23 <http://valuenet/ontop/faculty> ?T23_faculty . ?T23 <http://valuenet/ontop/year> ?T23_year . ?T24 <http://valuenet/ontop/county> ?T24_county . FILTER(?T23_year = 2002 && ?T24_county = 'Orange') . } } }
What are the degrees conferred in 'San Francisco State University' in 2001.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_degrees WHERE { ?T1 a :degrees . ?T2 a :campuses . ?T1 :ref-campus ?T2 . ?T1 :degrees ?T1_degrees . ?T2 :campuses-campus ?T2_campus . ?T1 :year ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 2001) . }",SELECT ?T1_degrees WHERE { ?T1 a <http://valuenet/ontop/degrees> . ?T2 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/ref-campus> ?T2 . ?T1 <http://valuenet/ontop/degrees> ?T1_degrees . ?T2 <http://valuenet/ontop/campuses-campus> ?T2_campus . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T2_campus = 'San Francisco State University' && ?T1_year = 2001) . }
List the campus that have between 600 and 1000 faculty lines in year 2004.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campus WHERE { ?T1 a :campuses . ?T2 a :faculty . ?T2 :ref-campus ?T1 . ?T1 :campuses-campus ?T1_campus . ?T2 :faculty ?T2_faculty . ?T2 :faculty ?T2_faculty . ?T1 :year ?T1_year . FILTER(?T2_faculty >= 600 && ?T2_faculty <= 1000 && ?T1_year = 2004) . }",SELECT ?T1_campus WHERE { ?T1 a <http://valuenet/ontop/campuses> . ?T2 a <http://valuenet/ontop/faculty> . ?T2 <http://valuenet/ontop/ref-campus> ?T1 . ?T1 <http://valuenet/ontop/campuses-campus> ?T1_campus . ?T2 <http://valuenet/ontop/faculty> ?T2_faculty . ?T2 <http://valuenet/ontop/faculty> ?T2_faculty . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T2_faculty >= 600 && ?T2_faculty <= 1000 && ?T1_year = 2004) . }
How many undergraduates are there at San Jose State,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_undergraduate) as ?aggregation_T1_undergraduate_8 ) WHERE { ?T1 a :discipline_enrollments . ?T2 a :campuses . ?T1 :ref-campus ?T2 . ?T1 :undergraduate ?T1_undergraduate . ?T1 :year ?T1_year . ?T2 :campuses-campus ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Jose State University') . }",SELECT (sum( ?T1_undergraduate) as ?aggregation_T1_undergraduate_8 ) WHERE { ?T1 a <http://valuenet/ontop/discipline_enrollments> . ?T2 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/ref-campus> ?T2 . ?T1 <http://valuenet/ontop/undergraduate> ?T1_undergraduate . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T2 <http://valuenet/ontop/campuses-campus> ?T2_campus . FILTER(?T1_year = 2004 && ?T2_campus = 'San Jose State University') . }
Find the campus fee of 'San Jose State University' in year 2000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_campusfee WHERE { ?T1 a :csu_fees . ?T2 a :campuses . ?T1 :ref-campus ?T2 . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . ?T2 :campuses-campus ?T2_campus . ?T1 :year ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 2000) . }",SELECT ?T1_campusfee WHERE { ?T1 a <http://valuenet/ontop/csu_fees> . ?T2 a <http://valuenet/ontop/campuses> . ?T1 <http://valuenet/ontop/ref-campus> ?T2 . ?T1 <http://valuenet/ontop/csu_fees-campusfee> ?T1_campusfee . ?T2 <http://valuenet/ontop/campuses-campus> ?T2_campus . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T2_campus = 'San Jose State University' && ?T1_year = 2000) . }
