nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of book clubs.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/book_club> . }
"show the titles, and authors or editors for all books made after the year 1989.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_book_title ?T1_author_or_editor WHERE { ?T1 a :book_club . ?T1 :book_title ?T1_book_title . ?T1 :author_or_editor ?T1_author_or_editor . ?T1 :year ?T1_year . FILTER(?T1_year > 1989) . }",SELECT ?T1_book_title ?T1_author_or_editor WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/book_title> ?T1_book_title . ?T1 <http://valuenet/ontop/author_or_editor> ?T1_author_or_editor . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year > 1989) . }
Show all distinct publishers for books.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :publisher ?T1_publisher . }",SELECT DISTINCT ?T1_publisher WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . }
"Show the years, book titles, and publishers for all books, in descending order by year.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_year ?T1_book_title ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :year ?T1_year . ?T1 :book_title ?T1_book_title . ?T1 :publisher ?T1_publisher . ?T1 :year ?T1_year . } ORDER BY DESC (?T1_year)",SELECT ?T1_year ?T1_book_title ?T1_publisher WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/book_title> ?T1_book_title . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . ?T1 <http://valuenet/ontop/year> ?T1_year . } ORDER BY DESC (?T1_year)
Show all publishers and the number of books for each publisher.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :publisher ?T1_publisher . } GROUP BY ?T1_publisher",SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . } GROUP BY ?T1_publisher
Return the publisher that has published the most books.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :publisher ?T1_publisher . } GROUP BY ?T1_publisher ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . } GROUP BY ?T1_publisher ORDER BY DESC (?aggregation_all) LIMIT 1
Show all book categories and the number of books in each category.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a :book_club . ?T1 :category ?T1_category . } GROUP BY ?T1_category",SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/category> ?T1_category . } GROUP BY ?T1_category
List categories that have at least two books after year 1989.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_category WHERE { ?T1 a :book_club . ?T1 :category ?T1_category . ?T1 :year ?T1_year . FILTER(?T1_year > 1989) . } GROUP BY ?T1_category HAVING(count( *) >= 2)",SELECT ?T1_category WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/category> ?T1_category . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year > 1989) . } GROUP BY ?T1_category HAVING(count( *) >= 2)
Show publishers with a book published in 1989 and a book in 1990.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_publisher WHERE { ?T1 a :book_club . ?T1 :publisher ?T1_publisher . ?T1 :year ?T1_year . FILTER(?T1_year = 1989) . FILTER (?T1_publisher in (?T2_publisher)) . ?T2 a :book_club . ?T2 :publisher ?T2_publisher . ?T2 :year ?T2_year . FILTER(?T2_year = 1990) . }",SELECT DISTINCT ?T1_publisher WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 1989) . FILTER (?T1_publisher in (?T2_publisher)) . ?T2 a <http://valuenet/ontop/book_club> . ?T2 <http://valuenet/ontop/publisher> ?T2_publisher . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year = 1990) . }
Show all publishers which do not have a book in 1989.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_publisher as ?col1) WHERE { ?T1 a :book_club . ?T1 :publisher ?T1_publisher . }} MINUS {SELECT (?T2_publisher as ?col1) WHERE { ?T2 a :book_club . ?T2 :publisher ?T2_publisher . ?T2 :year ?T2_year . FILTER(?T2_year = 1989) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_publisher as ?col1) WHERE { ?T1 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/publisher> ?T1_publisher . }} MINUS {SELECT (?T2_publisher as ?col1) WHERE { ?T2 a <http://valuenet/ontop/book_club> . ?T2 <http://valuenet/ontop/publisher> ?T2_publisher . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year = 1989) . } } }
"Show all movie titles, years, and directors, ordered by budget.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title ?T1_year ?T1_director WHERE { ?T1 a :movie . ?T1 :title ?T1_title . ?T1 :year ?T1_year . ?T1 :director ?T1_director . ?T1 :budget_million ?T1_budget_million . } ORDER BY ASC (?T1_budget_million)",SELECT ?T1_title ?T1_year ?T1_director WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/director> ?T1_director . ?T1 <http://valuenet/ontop/budget_million> ?T1_budget_million . } ORDER BY ASC (?T1_budget_million)
Count the number of different directors.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_director) as ?aggregation_T1_director_87 ) WHERE { ?T1 a :movie . ?T1 :director ?T1_director . }",SELECT DISTINCT (count(DISTINCT ?T1_director) as ?aggregation_T1_director_87 ) WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/director> ?T1_director . }
Return the title and director of the movie released in the year 2000 or earlier that had the highest worldwide gross.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title ?T1_director WHERE { ?T1 a :movie . ?T1 :title ?T1_title . ?T1 :director ?T1_director . ?T1 :gross_worldwide ?T1_gross_worldwide . ?T1 :year ?T1_year . FILTER(?T1_year <= 2000) . } ORDER BY DESC (?T1_gross_worldwide) LIMIT 1",SELECT ?T1_title ?T1_director WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/director> ?T1_director . ?T1 <http://valuenet/ontop/gross_worldwide> ?T1_gross_worldwide . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year <= 2000) . } ORDER BY DESC (?T1_gross_worldwide) LIMIT 1
Show all director names who have a movie in both year 1999 and 2000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_director WHERE { ?T1 a :movie . ?T1 :director ?T1_director . ?T1 :year ?T1_year . FILTER(?T1_year = 2000) . FILTER (?T1_director in (?T2_director)) . ?T2 a :movie . ?T2 :director ?T2_director . ?T2 :year ?T2_year . FILTER(?T2_year = 1999) . }",SELECT DISTINCT ?T1_director WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/director> ?T1_director . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 2000) . FILTER (?T1_director in (?T2_director)) . ?T2 a <http://valuenet/ontop/movie> . ?T2 <http://valuenet/ontop/director> ?T2_director . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year = 1999) . }
Show all director names who have a movie in the year 1999 or 2000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_director WHERE { ?T1 a :movie . ?T1 :director ?T1_director . ?T1 :year ?T1_year . ?T1 :year ?T1_year . FILTER(?T1_year = 1999 || ?T1_year = 2000) . }",SELECT ?T1_director WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/director> ?T1_director . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 1999 || ?T1_year = 2000) . }
"Return the average, maximum, and minimum budgets in millions for movies made before the year 2000.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_budget_million) as ?aggregation_T1_budget_million_74 ) (max( ?T1_budget_million) as ?aggregation_T1_budget_million_22 ) (min( ?T1_budget_million) as ?aggregation_T1_budget_million_44 ) WHERE { ?T1 a :movie . ?T1 :budget_million ?T1_budget_million . ?T1 :budget_million ?T1_budget_million . ?T1 :budget_million ?T1_budget_million . ?T1 :year ?T1_year . FILTER(?T1_year < 2000) . }",SELECT (avg( ?T1_budget_million) as ?aggregation_T1_budget_million_74 ) (max( ?T1_budget_million) as ?aggregation_T1_budget_million_22 ) (min( ?T1_budget_million) as ?aggregation_T1_budget_million_44 ) WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/budget_million> ?T1_budget_million . ?T1 <http://valuenet/ontop/budget_million> ?T1_budget_million . ?T1 <http://valuenet/ontop/budget_million> ?T1_budget_million . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year < 2000) . }
List all company names with a book published by Alyson.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company_name WHERE { ?T1 a :culture_company . ?T2 a :book_club . ?T1 :ref-book_club ?T2 . ?T1 :company_name ?T1_company_name . ?T2 :publisher ?T2_publisher . FILTER(?T2_publisher = 'Alyson') . }",SELECT ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/culture_company> . ?T2 a <http://valuenet/ontop/book_club> . ?T1 <http://valuenet/ontop/ref-book_club> ?T2 . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T2 <http://valuenet/ontop/publisher> ?T2_publisher . FILTER(?T2_publisher = 'Alyson') . }
Show the movie titles and book titles for all companies in China.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title ?T2_book_title WHERE { ?T1 a :movie . ?T3 a :culture_company . ?T3 :ref-movie ?T1 . ?T1 :title ?T1_title . ?T2 :book_title ?T2_book_title . ?T3 :incorporated_in ?T3_incorporated_in . ?T2 a :book_club . ?T3 :ref-book_club ?T2 . ?T1 :title ?T1_title . ?T2 :book_title ?T2_book_title . ?T3 :incorporated_in ?T3_incorporated_in . FILTER(?T3_incorporated_in = 'China') . }",SELECT ?T1_title ?T2_book_title WHERE { ?T1 a <http://valuenet/ontop/movie> . ?T3 a <http://valuenet/ontop/culture_company> . ?T3 <http://valuenet/ontop/ref-movie> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/book_title> ?T2_book_title . ?T3 <http://valuenet/ontop/incorporated_in> ?T3_incorporated_in . ?T2 a <http://valuenet/ontop/book_club> . ?T3 <http://valuenet/ontop/ref-book_club> ?T2 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/book_title> ?T2_book_title . ?T3 <http://valuenet/ontop/incorporated_in> ?T3_incorporated_in . FILTER(?T3_incorporated_in = 'China') . }
Show all company names with a movie directed in year 1999.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company_name WHERE { ?T1 a :culture_company . ?T2 a :movie . ?T1 :ref-movie ?T2 . ?T1 :company_name ?T1_company_name . ?T2 :year ?T2_year . FILTER(?T2_year = 1999) . }",SELECT ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/culture_company> . ?T2 a <http://valuenet/ontop/movie> . ?T1 <http://valuenet/ontop/ref-movie> ?T2 . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year = 1999) . }
