nl_question,sparql_partial_uri,sparql_complete_uri
List the venues of debates in ascending order of the number of audience.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_venue WHERE { ?T1 a :debate . ?T1 :venue ?T1_venue . ?T1 :num_of_audience ?T1_num_of_audience . } ORDER BY ASC (?T1_num_of_audience)",SELECT ?T1_venue WHERE { ?T1 a <http://valuenet/ontop/debate> . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T1 <http://valuenet/ontop/num_of_audience> ?T1_num_of_audience . } ORDER BY ASC (?T1_num_of_audience)
List the dates of debates with number of audience bigger than 150,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date WHERE { ?T1 a :debate . ?T1 :date ?T1_date . ?T1 :num_of_audience ?T1_num_of_audience . FILTER(?T1_num_of_audience > 150) . }",SELECT ?T1_date WHERE { ?T1 a <http://valuenet/ontop/debate> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/num_of_audience> ?T1_num_of_audience . FILTER(?T1_num_of_audience > 150) . }
Show the names of people aged either 35 or 36.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age = 35 || ?T1_age = 36) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age = 35 || ?T1_age = 36) . }
Show different parties of people along with the number of people in each party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :party ?T1_party . } GROUP BY ?T1_party",SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/party> ?T1_party . } GROUP BY ?T1_party
Show the party that has the most people.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :party ?T1_party . } GROUP BY ?T1_party ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/party> ?T1_party . } GROUP BY ?T1_party ORDER BY DESC (?aggregation_all) LIMIT 1
Show the distinct venues of debates,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_venue WHERE { ?T1 a :debate . ?T1 :venue ?T1_venue . }",SELECT DISTINCT ?T1_venue WHERE { ?T1 a <http://valuenet/ontop/debate> . ?T1 <http://valuenet/ontop/venue> ?T1_venue . }
"Show the names of people, and dates and venues of debates they are on the affirmative side.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_date ?T2_venue WHERE { ?T1 a :people . ?T13 a :debate_people . ?T13 :ref-affirmative ?T1 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . ?T2 :venue ?T2_venue . ?T2 a :debate . ?T13 :ref-debate ?T2 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . ?T2 :venue ?T2_venue . }",SELECT ?T1_name ?T2_date ?T2_venue WHERE { ?T1 a <http://valuenet/ontop/people> . ?T13 a <http://valuenet/ontop/debate_people> . ?T13 <http://valuenet/ontop/ref-affirmative> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 <http://valuenet/ontop/venue> ?T2_venue . ?T2 a <http://valuenet/ontop/debate> . ?T13 <http://valuenet/ontop/ref-debate> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 <http://valuenet/ontop/venue> ?T2_venue . }
Show the names of people that are on affirmative side of debates with number of audience bigger than 200.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T13 a :debate_people . ?T13 :ref-affirmative ?T1 . ?T1 :name ?T1_name . ?T2 :num_of_audience ?T2_num_of_audience . ?T2 a :debate . ?T13 :ref-debate ?T2 . ?T1 :name ?T1_name . ?T2 :num_of_audience ?T2_num_of_audience . FILTER(?T2_num_of_audience > 200) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T13 a <http://valuenet/ontop/debate_people> . ?T13 <http://valuenet/ontop/ref-affirmative> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_audience> ?T2_num_of_audience . ?T2 a <http://valuenet/ontop/debate> . ?T13 <http://valuenet/ontop/ref-debate> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_audience> ?T2_num_of_audience . FILTER(?T2_num_of_audience > 200) . }
Show the names of people and the number of times they have been on the affirmative side of debates.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T2 a :debate_people . ?T2 :ref-affirmative ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/debate_people> . ?T2 <http://valuenet/ontop/ref-affirmative> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Show the names of people who have been on the negative side of debates at least twice.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :debate_people . ?T2 :ref-affirmative ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/debate_people> . ?T2 <http://valuenet/ontop/ref-affirmative> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)
List the names of people that have not been on the affirmative side of debates.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_affirmative)) . {SELECT ?T22_affirmative WHERE { ?T22 a :debate_people . ?T22 :affirmative ?T22_affirmative . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/people_id> ?T1_people_id . FILTER(?T1_people_id not in (?T22_affirmative)) . {SELECT ?T22_affirmative WHERE { ?T22 a <http://valuenet/ontop/debate_people> . ?T22 <http://valuenet/ontop/affirmative> ?T22_affirmative . } } }
