nl_question,sparql_partial_uri,sparql_complete_uri
List the names of members in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Show the names of members whose country is 'United States' or 'Canada'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :country ?T1_country . ?T1 :country ?T1_country . FILTER(?T1_country = 'United States' || ?T1_country = 'Canada') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country = 'United States' || ?T1_country = 'Canada') . }
Show the different countries and the number of members from each.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :country ?T1_country . } GROUP BY ?T1_country",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country
Show the most common country across members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :country ?T1_country . } GROUP BY ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1
Show the leader names and locations of colleges.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_leader_name ?T1_college_location WHERE { ?T1 a :college . ?T1 :leader_name ?T1_leader_name . ?T1 :college_location ?T1_college_location . }",SELECT ?T1_leader_name ?T1_college_location WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/leader_name> ?T1_leader_name . ?T1 <http://valuenet/ontop/college_location> ?T1_college_location . }
Show the names of members and names of colleges they go to.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :member . ?T2 a :college . ?T1 :ref-college ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . }",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/ref-college> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the names of members and the locations of colleges they go to in ascending alphabetical order of member names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_college_location WHERE { ?T1 a :member . ?T2 a :college . ?T1 :ref-college ?T2 . ?T1 :name ?T1_name . ?T2 :college_location ?T2_college_location . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name ?T2_college_location WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/ref-college> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/college_location> ?T2_college_location . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Show the distinct leader names of colleges associated with members from country 'Canada'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_leader_name WHERE { ?T1 a :college . ?T2 a :member . ?T2 :ref-college ?T1 . ?T1 :leader_name ?T1_leader_name . ?T2 :country ?T2_country . FILTER(?T2_country = 'Canada') . }",SELECT DISTINCT ?T1_leader_name WHERE { ?T1 a <http://valuenet/ontop/college> . ?T2 a <http://valuenet/ontop/member> . ?T2 <http://valuenet/ontop/ref-college> ?T1 . ?T1 <http://valuenet/ontop/leader_name> ?T1_leader_name . ?T2 <http://valuenet/ontop/country> ?T2_country . FILTER(?T2_country = 'Canada') . }
Show the names of members and the decoration themes they have.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_decoration_theme WHERE { ?T1 a :member . ?T2 a :round . ?T2 :ref-member ?T1 . ?T1 :name ?T1_name . ?T2 :decoration_theme ?T2_decoration_theme . }",SELECT ?T1_name ?T2_decoration_theme WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/round> . ?T2 <http://valuenet/ontop/ref-member> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/decoration_theme> ?T2_decoration_theme . }
Show the names of members that have a rank in round higher than 3.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T2 a :round . ?T2 :ref-member ?T1 . ?T1 :name ?T1_name . ?T2 :rank_in_round ?T2_rank_in_round . FILTER(?T2_rank_in_round > 3) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/round> . ?T2 <http://valuenet/ontop/ref-member> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/rank_in_round> ?T2_rank_in_round . FILTER(?T2_rank_in_round > 3) . }
List the names of members who did not participate in any round.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :member_id ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) . {SELECT ?T22_member_id WHERE { ?T22 a :round . ?T22 :member_id ?T22_member_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/member_id> ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) . {SELECT ?T22_member_id WHERE { ?T22 a <http://valuenet/ontop/round> . ?T22 <http://valuenet/ontop/member_id> ?T22_member_id . } } }
