nl_question,sparql_partial_uri,sparql_complete_uri
Find the name and gender of the staff who has been assigned the job of Sales Person but never Clerical Staff.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2 WHERE { { SELECT (?T1_staff_name as ?col1) (?T1_staff_gender as ?col2) WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :ref-staff ?T1 . ?T1 :staff_name ?T1_staff_name . ?T1 :staff_gender ?T1_staff_gender . ?T2 :job_title_code ?T2_job_title_code . FILTER(?T2_job_title_code = 'Sales Person') . }} MINUS {SELECT (?T3_staff_name as ?col1) (?T3_staff_gender as ?col2) WHERE { ?T3 a :staff . ?T4 a :staff_department_assignments . ?T4 :ref-staff ?T3 . ?T3 :staff_name ?T3_staff_name . ?T3 :staff_gender ?T3_staff_gender . ?T4 :job_title_code ?T4_job_title_code . FILTER(?T4_job_title_code = 'Clerical Staff') . } } }",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_staff_name as ?col1) (?T1_staff_gender as ?col2) WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/staff_department_assignments> . ?T2 <http://valuenet/ontop/ref-staff> ?T1 . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . ?T1 <http://valuenet/ontop/staff_gender> ?T1_staff_gender . ?T2 <http://valuenet/ontop/job_title_code> ?T2_job_title_code . FILTER(?T2_job_title_code = 'Sales Person') . }} MINUS {SELECT (?T3_staff_name as ?col1) (?T3_staff_gender as ?col2) WHERE { ?T3 a <http://valuenet/ontop/staff> . ?T4 a <http://valuenet/ontop/staff_department_assignments> . ?T4 <http://valuenet/ontop/ref-staff> ?T3 . ?T3 <http://valuenet/ontop/staff_name> ?T3_staff_name . ?T3 <http://valuenet/ontop/staff_gender> ?T3_staff_gender . ?T4 <http://valuenet/ontop/job_title_code> ?T4_job_title_code . FILTER(?T4_job_title_code = 'Clerical Staff') . } } }
Find the id and name of customers whose address contains WY state and do not use credit card for payment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_id ?T1_customer_name WHERE { ?T1 a :customers . ?T1 :customer_id ?T1_customer_id . ?T1 :customer_name ?T1_customer_name . ?T1 :customer_address ?T1_customer_address . ?T1 :payment_method_code ?T1_payment_method_code . FILTER(contains (?T1_customer_address, 'WY') && ?T1_payment_method_code != 'Credit Card') . }","SELECT ?T1_customer_id ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T1 <http://valuenet/ontop/customer_address> ?T1_customer_address . ?T1 <http://valuenet/ontop/payment_method_code> ?T1_payment_method_code . FILTER(contains (?T1_customer_address, 'WY') && ?T1_payment_method_code != 'Credit Card') . }"
Find the average price of all product clothes.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_129 ) WHERE { ?T1 a :products . ?T1 :product_price ?T1_product_price . ?T1 :product_type_code ?T1_product_type_code . FILTER(?T1_product_type_code = 'Clothes') . }",SELECT (avg( ?T1_product_price) as ?aggregation_T1_product_price_129 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . FILTER(?T1_product_type_code = 'Clothes') . }
Find the name of the most expensive hardware product.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :product_price ?T1_product_price . ?T1 :product_type_code ?T1_product_type_code . FILTER(?T1_product_type_code = 'Hardware') . } ORDER BY DESC (?T1_product_price) LIMIT 1",SELECT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . FILTER(?T1_product_type_code = 'Hardware') . } ORDER BY DESC (?T1_product_price) LIMIT 1
