nl_question,sparql_partial_uri,sparql_complete_uri
Give the ids of the three products purchased in the largest amounts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_id WHERE { ?T1 a :product_suppliers . ?T1 :product_id ?T1_product_id . ?T1 :total_amount_purchased ?T1_total_amount_purchased . } ORDER BY DESC (?T1_total_amount_purchased) LIMIT 1",SELECT ?T1_product_id WHERE { ?T1 a <http://valuenet/ontop/product_suppliers> . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T1 <http://valuenet/ontop/total_amount_purchased> ?T1_total_amount_purchased . } ORDER BY DESC (?T1_total_amount_purchased) LIMIT 1
Give the id and product type of the product with the lowest price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_id ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :product_id ?T1_product_id . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_price ?T1_product_price . } ORDER BY ASC (?T1_product_price) LIMIT 1",SELECT ?T1_product_id ?T1_product_type_code WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . } ORDER BY ASC (?T1_product_price) LIMIT 1
Find the number of different product types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_138 ) WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . }",SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_138 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . }
Count the number of distinct product types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_149 ) WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . }",SELECT DISTINCT (count(DISTINCT ?T1_product_type_code) as ?aggregation_T1_product_type_code_149 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . }
Return the address of customer 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address_details WHERE { ?T1 a :addresses . ?T2 a :customer_addresses . ?T2 :ref-address ?T1 . ?T1 :address_details ?T1_address_details . ?T2 :customer_id ?T2_customer_id . FILTER(?T2_customer_id = 10) . }",SELECT ?T1_address_details WHERE { ?T1 a <http://valuenet/ontop/addresses> . ?T2 a <http://valuenet/ontop/customer_addresses> . ?T2 <http://valuenet/ontop/ref-address> ?T1 . ?T1 <http://valuenet/ontop/address_details> ?T1_address_details . ?T2 <http://valuenet/ontop/customer_id> ?T2_customer_id . FILTER(?T2_customer_id = 10) . }
Return the staff ids and genders for any staff with the title Department Manager.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_id ?T1_staff_gender WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :ref-staff ?T1 . ?T1 :staff_id ?T1_staff_id . ?T1 :staff_gender ?T1_staff_gender . ?T2 :job_title_code ?T2_job_title_code . FILTER(?T2_job_title_code = 'Department Manager') . }",SELECT ?T1_staff_id ?T1_staff_gender WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/staff_department_assignments> . ?T2 <http://valuenet/ontop/ref-staff> ?T1 . ?T1 <http://valuenet/ontop/staff_id> ?T1_staff_id . ?T1 <http://valuenet/ontop/staff_gender> ?T1_staff_gender . ?T2 <http://valuenet/ontop/job_title_code> ?T2_job_title_code . FILTER(?T2_job_title_code = 'Department Manager') . }
"For each payment method, return how many customers use it.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :payment_method_code ?T1_payment_method_code . } GROUP BY ?T1_payment_method_code",SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/payment_method_code> ?T1_payment_method_code . } GROUP BY ?T1_payment_method_code
Give the product id for the product that was ordered most frequently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_id (count( *) as ?aggregation_all) WHERE { ?T1 a :order_items . ?T1 :product_id ?T1_product_id . } GROUP BY ?T1_product_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_product_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/order_items> . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . } GROUP BY ?T1_product_id ORDER BY DESC (?aggregation_all) LIMIT 1
"Return the name, phone number and email address for the customer with the most orders.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name (count( *) as ?aggregation_all) ?T1_customer_phone ?T1_customer_email WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T1 :customer_phone ?T1_customer_phone . ?T1 :customer_email ?T1_customer_email . } GROUP BY ?T1_customer_name ?T1_customer_phone ?T1_customer_email ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_customer_name (count( *) as ?aggregation_all) ?T1_customer_phone ?T1_customer_email WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/customer_orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T1 <http://valuenet/ontop/customer_phone> ?T1_customer_phone . ?T1 <http://valuenet/ontop/customer_email> ?T1_customer_email . } GROUP BY ?T1_customer_name ?T1_customer_phone ?T1_customer_email ORDER BY DESC (?aggregation_all) LIMIT 1
Return the average price for each product type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code (avg( ?T1_product_price) as ?aggregation_T1_product_price_172 ) WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_price ?T1_product_price . } GROUP BY ?T1_product_type_code",SELECT ?T1_product_type_code (avg( ?T1_product_price) as ?aggregation_T1_product_price_172 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . } GROUP BY ?T1_product_type_code
Count the number of stores the chain South has.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :department_stores . ?T2 a :department_store_chain . ?T1 :ref-dept_store_chain ?T2 . ?T2 :dept_store_chain_name ?T2_dept_store_chain_name . FILTER(?T2_dept_store_chain_name = 'South') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/department_stores> . ?T2 a <http://valuenet/ontop/department_store_chain> . ?T1 <http://valuenet/ontop/ref-dept_store_chain> ?T2 . ?T2 <http://valuenet/ontop/dept_store_chain_name> ?T2_dept_store_chain_name . FILTER(?T2_dept_store_chain_name = 'South') . }
Return the name and job title of the staff with the latest date assigned.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_name ?T2_job_title_code WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :ref-staff ?T1 . ?T1 :staff_name ?T1_staff_name . ?T2 :job_title_code ?T2_job_title_code . ?T2 :date_assigned_to ?T2_date_assigned_to . } ORDER BY DESC (?T2_date_assigned_to) LIMIT 1",SELECT ?T1_staff_name ?T2_job_title_code WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/staff_department_assignments> . ?T2 <http://valuenet/ontop/ref-staff> ?T1 . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . ?T2 <http://valuenet/ontop/job_title_code> ?T2_job_title_code . ?T2 <http://valuenet/ontop/date_assigned_to> ?T2_date_assigned_to . } ORDER BY DESC (?T2_date_assigned_to) LIMIT 1
"Give me the product type, name and price for all the products supplied by supplier id 3.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code ?T1_product_name ?T1_product_price WHERE { ?T1 a :products . ?T2 a :product_suppliers . ?T2 :ref-product ?T1 . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_name ?T1_product_name . ?T1 :product_price ?T1_product_price . ?T2 :supplier_id ?T2_supplier_id . FILTER(?T2_supplier_id = 3) . }",SELECT ?T1_product_type_code ?T1_product_name ?T1_product_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/product_suppliers> . ?T2 <http://valuenet/ontop/ref-product> ?T1 . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T2 <http://valuenet/ontop/supplier_id> ?T2_supplier_id . FILTER(?T2_supplier_id = 3) . }
"Return the distinct name of customers whose order status is Pending, in the order of customer id.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_name ?T2_customer_id WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T2 :customer_id ?T2_customer_id . ?T2 :customer_id ?T2_customer_id . ?T2 :order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'Pending') . } ORDER BY ASC (?T2_customer_id)",SELECT DISTINCT ?T1_customer_name ?T2_customer_id WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/customer_orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/customer_id> ?T2_customer_id . ?T2 <http://valuenet/ontop/customer_id> ?T2_customer_id . ?T2 <http://valuenet/ontop/order_status_code> ?T2_order_status_code . FILTER(?T2_order_status_code = 'Pending') . } ORDER BY ASC (?T2_customer_id)
Find the name and address of the customers who have both New and Pending orders.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_name ?T1_customer_address WHERE { ?T1 a :customers . ?T2 a :customer_orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T1 :customer_address ?T1_customer_address . ?T2 :order_status_code ?T2_order_status_code . FILTER(?T2_order_status_code = 'New') . FILTER (?T1_customer_name in (?T3_customer_name)) . FILTER (?T1_customer_address in (?T3_customer_address)) . ?T3 a :customers . ?T4 a :customer_orders . ?T4 :ref-customer ?T3 . ?T3 :customer_name ?T3_customer_name . ?T3 :customer_address ?T3_customer_address . ?T4 :order_status_code ?T4_order_status_code . FILTER(?T4_order_status_code = 'Pending') . }",SELECT DISTINCT ?T1_customer_name ?T1_customer_address WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/customer_orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T1 <http://valuenet/ontop/customer_address> ?T1_customer_address . ?T2 <http://valuenet/ontop/order_status_code> ?T2_order_status_code . FILTER(?T2_order_status_code = 'New') . FILTER (?T1_customer_name in (?T3_customer_name)) . FILTER (?T1_customer_address in (?T3_customer_address)) . ?T3 a <http://valuenet/ontop/customers> . ?T4 a <http://valuenet/ontop/customer_orders> . ?T4 <http://valuenet/ontop/ref-customer> ?T3 . ?T3 <http://valuenet/ontop/customer_name> ?T3_customer_name . ?T3 <http://valuenet/ontop/customer_address> ?T3_customer_address . ?T4 <http://valuenet/ontop/order_status_code> ?T4_order_status_code . FILTER(?T4_order_status_code = 'Pending') . }
Return ids of all the products that are supplied by supplier id 2 and are more expensive than the average price of all products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_id WHERE { ?T1 a :product_suppliers . ?T2 a :products . ?T1 :ref-product ?T2 . ?T1 :product_id ?T1_product_id . ?T1 :supplier_id ?T1_supplier_id . ?T2 :product_price ?T2_product_price . FILTER(?T1_supplier_id = 2 && ?T2_product_price > (?aggregation_T23_product_price_182)) . {SELECT (avg( ?T23_product_price) as ?aggregation_T23_product_price_182 ) WHERE { ?T23 a :products . ?T23 :product_price ?T23_product_price . } } }",SELECT ?T1_product_id WHERE { ?T1 a <http://valuenet/ontop/product_suppliers> . ?T2 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T1 <http://valuenet/ontop/supplier_id> ?T1_supplier_id . ?T2 <http://valuenet/ontop/product_price> ?T2_product_price . FILTER(?T1_supplier_id = 2 && ?T2_product_price > (?aggregation_T23_product_price_182)) . {SELECT (avg( ?T23_product_price) as ?aggregation_T23_product_price_182 ) WHERE { ?T23 a <http://valuenet/ontop/products> . ?T23 <http://valuenet/ontop/product_price> ?T23_product_price . } } }
Return the ids of the two department store chains with the most department stores.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dept_store_chain_id (count( *) as ?aggregation_all) WHERE { ?T1 a :department_stores . ?T1 :dept_store_chain_id ?T1_dept_store_chain_id . } GROUP BY ?T1_dept_store_chain_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_dept_store_chain_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/department_stores> . ?T1 <http://valuenet/ontop/dept_store_chain_id> ?T1_dept_store_chain_id . } GROUP BY ?T1_dept_store_chain_id ORDER BY DESC (?aggregation_all) LIMIT 1
Return the id of the department with the fewest staff assignments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_department_id (count( *) as ?aggregation_all) WHERE { ?T1 a :staff_department_assignments . ?T1 :department_id ?T1_department_id . } GROUP BY ?T1_department_id ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT ?T1_department_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/staff_department_assignments> . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . } GROUP BY ?T1_department_id ORDER BY ASC (?aggregation_all) LIMIT 1
"For each product type, return the maximum and minimum price.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code (max( ?T1_product_price) as ?aggregation_T1_product_price_30 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_84 ) WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_price ?T1_product_price . ?T1 :product_price ?T1_product_price . } GROUP BY ?T1_product_type_code",SELECT ?T1_product_type_code (max( ?T1_product_price) as ?aggregation_T1_product_price_30 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_84 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . } GROUP BY ?T1_product_type_code
Find the product type whose average price is higher than the average price of all products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_price ?T1_product_price . {SELECT (avg( ?T22_product_price) as ?aggregation_T22_product_price_145 ) WHERE { ?T22 a :products . ?T22 :product_price ?T22_product_price . } } } GROUP BY ?T1_product_type_code HAVING(avg( ?T1_product_price) > (?aggregation_T22_product_price_145))",SELECT ?T1_product_type_code WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . {SELECT (avg( ?T22_product_price) as ?aggregation_T22_product_price_145 ) WHERE { ?T22 a <http://valuenet/ontop/products> . ?T22 <http://valuenet/ontop/product_price> ?T22_product_price . } } } GROUP BY ?T1_product_type_code HAVING(avg( ?T1_product_price) > (?aggregation_T22_product_price_145))
Find the id and name of the staff who has been assigned for the shortest period.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_id ?T1_staff_name WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :ref-staff ?T1 . ?T1 :staff_id ?T1_staff_id . ?T1 :staff_name ?T1_staff_name . ?T2 :date_assigned_to ?T2_date_assigned_to . ?T2 :date_assigned_from ?T2_date_assigned_from . } ORDER BY ASC (?T2_date_assigned_to - ?T2_date_assigned_from) LIMIT 1",SELECT ?T1_staff_id ?T1_staff_name WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/staff_department_assignments> . ?T2 <http://valuenet/ontop/ref-staff> ?T1 . ?T1 <http://valuenet/ontop/staff_id> ?T1_staff_id . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . ?T2 <http://valuenet/ontop/date_assigned_to> ?T2_date_assigned_to . ?T2 <http://valuenet/ontop/date_assigned_from> ?T2_date_assigned_from . } ORDER BY ASC (?T2_date_assigned_to - ?T2_date_assigned_from) LIMIT 1
Return the names and ids of all products whose price is between 600 and 700.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name ?T1_product_id WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :product_id ?T1_product_id . ?T1 :product_price ?T1_product_price . FILTER(?T1_product_price >= 600 && ?T1_product_price <= 700) . }",SELECT ?T1_product_name ?T1_product_id WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . FILTER(?T1_product_price >= 600 && ?T1_product_price <= 700) . }
Find the ids of all distinct customers who made order after some orders that were Cancelled.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_id WHERE { ?T1 a :customer_orders . ?T1 :customer_id ?T1_customer_id . ?T1 :order_date ?T1_order_date . FILTER(?T1_order_date > (?T22_order_status_code)) . {SELECT (min( ?T22_order_date) as ?aggregation_T22_order_date_37 ) WHERE { ?T22 a :customer_orders . ?T22 :order_date ?T22_order_date . ?T22 :order_status_code ?T22_order_status_code . FILTER(?T22_order_status_code = 'Cancelled') . } } }",SELECT DISTINCT ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/customer_orders> . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/order_date> ?T1_order_date . FILTER(?T1_order_date > (?T22_order_status_code)) . {SELECT (min( ?T22_order_date) as ?aggregation_T22_order_date_37 ) WHERE { ?T22 a <http://valuenet/ontop/customer_orders> . ?T22 <http://valuenet/ontop/order_date> ?T22_order_date . ?T22 <http://valuenet/ontop/order_status_code> ?T22_order_status_code . FILTER(?T22_order_status_code = 'Cancelled') . } } }
Return the id of the staff whose Staff Department Assignment was earlier than that of any Clerical Staff.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_id WHERE { ?T1 a :staff_department_assignments . ?T1 :staff_id ?T1_staff_id . ?T1 :date_assigned_to ?T1_date_assigned_to . FILTER(?T1_date_assigned_to < (?T22_job_title_code)) . {SELECT (max( ?T22_date_assigned_to) as ?aggregation_T22_date_assigned_to_5 ) WHERE { ?T22 a :staff_department_assignments . ?T22 :date_assigned_to ?T22_date_assigned_to . ?T22 :job_title_code ?T22_job_title_code . FILTER(?T22_job_title_code = 'Clerical Staff') . } } }",SELECT ?T1_staff_id WHERE { ?T1 a <http://valuenet/ontop/staff_department_assignments> . ?T1 <http://valuenet/ontop/staff_id> ?T1_staff_id . ?T1 <http://valuenet/ontop/date_assigned_to> ?T1_date_assigned_to . FILTER(?T1_date_assigned_to < (?T22_job_title_code)) . {SELECT (max( ?T22_date_assigned_to) as ?aggregation_T22_date_assigned_to_5 ) WHERE { ?T22 a <http://valuenet/ontop/staff_department_assignments> . ?T22 <http://valuenet/ontop/date_assigned_to> ?T22_date_assigned_to . ?T22 <http://valuenet/ontop/job_title_code> ?T22_job_title_code . FILTER(?T22_job_title_code = 'Clerical Staff') . } } }
Return the names and ids of customers who have TN in their address.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name ?T1_customer_id WHERE { ?T1 a :customers . ?T1 :customer_name ?T1_customer_name . ?T1 :customer_id ?T1_customer_id . ?T1 :customer_address ?T1_customer_address . FILTER(contains (?T1_customer_address, 'TN')) . }","SELECT ?T1_customer_name ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/customer_address> ?T1_customer_address . FILTER(contains (?T1_customer_address, 'TN')) . }"
List the name of staff who has been assigned multiple jobs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_name WHERE { ?T1 a :staff . ?T2 a :staff_department_assignments . ?T2 :ref-staff ?T1 . ?T1 :staff_name ?T1_staff_name . } GROUP BY ?T1_staff_name HAVING(count( *) > 1)",SELECT ?T1_staff_name WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/staff_department_assignments> . ?T2 <http://valuenet/ontop/ref-staff> ?T1 . ?T1 <http://valuenet/ontop/staff_name> ?T1_staff_name . } GROUP BY ?T1_staff_name HAVING(count( *) > 1)
List the name and phone number of all suppliers in the alphabetical order of their addresses.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a :suppliers . ?T13 a :supplier_addresses . ?T13 :ref-supplier ?T1 . ?T1 :supplier_name ?T1_supplier_name . ?T1 :supplier_phone ?T1_supplier_phone . ?T2 :address_details ?T2_address_details . ?T2 a :addresses . ?T13 :ref-address ?T2 . ?T1 :supplier_name ?T1_supplier_name . ?T1 :supplier_phone ?T1_supplier_phone . ?T2 :address_details ?T2_address_details . } ORDER BY ASC (?T2_address_details)",SELECT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a <http://valuenet/ontop/suppliers> . ?T13 a <http://valuenet/ontop/supplier_addresses> . ?T13 <http://valuenet/ontop/ref-supplier> ?T1 . ?T1 <http://valuenet/ontop/supplier_name> ?T1_supplier_name . ?T1 <http://valuenet/ontop/supplier_phone> ?T1_supplier_phone . ?T2 <http://valuenet/ontop/address_details> ?T2_address_details . ?T2 a <http://valuenet/ontop/addresses> . ?T13 <http://valuenet/ontop/ref-address> ?T2 . ?T1 <http://valuenet/ontop/supplier_name> ?T1_supplier_name . ?T1 <http://valuenet/ontop/supplier_phone> ?T1_supplier_phone . ?T2 <http://valuenet/ontop/address_details> ?T2_address_details . } ORDER BY ASC (?T2_address_details)
What are the phone numbers of all customers and suppliers.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_customer_phone as ?col1) WHERE { ?T1 a :customers . ?T1 :customer_phone ?T1_customer_phone . }} UNION {SELECT (?T1_supplier_phone as ?col1) WHERE { ?T1 a :suppliers . ?T1 :supplier_phone ?T1_supplier_phone . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_customer_phone as ?col1) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_phone> ?T1_customer_phone . }} UNION {SELECT (?T1_supplier_phone as ?col1) WHERE { ?T1 a <http://valuenet/ontop/suppliers> . ?T1 <http://valuenet/ontop/supplier_phone> ?T1_supplier_phone . } } }
Give the ids and names of products with price lower than 600 or higher than 900.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_id ?T1_product_name WHERE { ?T1 a :products . ?T1 :product_id ?T1_product_id . ?T1 :product_name ?T1_product_name . ?T1 :product_price ?T1_product_price . ?T1 :product_price ?T1_product_price . FILTER(?T1_product_price < 600 || ?T1_product_price > 900) . }",SELECT ?T1_product_id ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . FILTER(?T1_product_price < 600 || ?T1_product_price > 900) . }
What are the average amount purchased and value purchased for the supplier who supplies the most products.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_total_amount_purchased) as ?aggregation_T1_total_amount_purchased_49 ) (avg( ?T1_total_value_purchased) as ?aggregation_T1_total_value_purchased_169 ) WHERE { ?T1 a :product_suppliers . ?T1 :total_amount_purchased ?T1_total_amount_purchased . ?T1 :total_value_purchased ?T1_total_value_purchased . ?T1 :supplier_id ?T1_supplier_id . FILTER(?T1_supplier_id = (?T22_supplier_id)) . {SELECT ?T22_supplier_id (count( *) as ?aggregation_all) WHERE { ?T22 a :product_suppliers . ?T22 :supplier_id ?T22_supplier_id . } GROUP BY ?T22_supplier_id ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT (avg( ?T1_total_amount_purchased) as ?aggregation_T1_total_amount_purchased_49 ) (avg( ?T1_total_value_purchased) as ?aggregation_T1_total_value_purchased_169 ) WHERE { ?T1 a <http://valuenet/ontop/product_suppliers> . ?T1 <http://valuenet/ontop/total_amount_purchased> ?T1_total_amount_purchased . ?T1 <http://valuenet/ontop/total_value_purchased> ?T1_total_value_purchased . ?T1 <http://valuenet/ontop/supplier_id> ?T1_supplier_id . FILTER(?T1_supplier_id = (?T22_supplier_id)) . {SELECT ?T22_supplier_id (count( *) as ?aggregation_all) WHERE { ?T22 a <http://valuenet/ontop/product_suppliers> . ?T22 <http://valuenet/ontop/supplier_id> ?T22_supplier_id . } GROUP BY ?T22_supplier_id ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Return the maximum and minimum customer codes.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_customer_code) as ?aggregation_T1_customer_code_116 ) (min( ?T1_customer_code) as ?aggregation_T1_customer_code_14 ) WHERE { ?T1 a :customers . ?T1 :customer_code ?T1_customer_code . ?T1 :customer_code ?T1_customer_code . }",SELECT (max( ?T1_customer_code) as ?aggregation_T1_customer_code_116 ) (min( ?T1_customer_code) as ?aggregation_T1_customer_code_14 ) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_code> ?T1_customer_code . ?T1 <http://valuenet/ontop/customer_code> ?T1_customer_code . }
List the names of all the distinct customers who bought a keyboard.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :customer_orders . ?T13 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T2 :product_name ?T2_product_name . ?T14 a :order_items . ?T14 :ref-order ?T13 . ?T1 :customer_name ?T1_customer_name . ?T2 :product_name ?T2_product_name . ?T2 a :products . ?T14 :ref-product ?T2 . ?T1 :customer_name ?T1_customer_name . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'keyboard') . }",SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T13 a <http://valuenet/ontop/customer_orders> . ?T13 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T14 a <http://valuenet/ontop/order_items> . ?T14 <http://valuenet/ontop/ref-order> ?T13 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T2 a <http://valuenet/ontop/products> . ?T14 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'keyboard') . }
List the names and phone numbers of all the distinct suppliers who supply red jeans.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a :suppliers . ?T13 a :product_suppliers . ?T13 :ref-supplier ?T1 . ?T1 :supplier_name ?T1_supplier_name . ?T1 :supplier_phone ?T1_supplier_phone . ?T2 :product_name ?T2_product_name . ?T2 a :products . ?T13 :ref-product ?T2 . ?T1 :supplier_name ?T1_supplier_name . ?T1 :supplier_phone ?T1_supplier_phone . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'red jeans') . }",SELECT DISTINCT ?T1_supplier_name ?T1_supplier_phone WHERE { ?T1 a <http://valuenet/ontop/suppliers> . ?T13 a <http://valuenet/ontop/product_suppliers> . ?T13 <http://valuenet/ontop/ref-supplier> ?T1 . ?T1 <http://valuenet/ontop/supplier_name> ?T1_supplier_name . ?T1 <http://valuenet/ontop/supplier_phone> ?T1_supplier_phone . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T2 a <http://valuenet/ontop/products> . ?T13 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/supplier_name> ?T1_supplier_name . ?T1 <http://valuenet/ontop/supplier_phone> ?T1_supplier_phone . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'red jeans') . }
"Give the maximum and minimum product prices for each product type, grouped and ordered by product type.","PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_product_price) as ?aggregation_T1_product_price_122 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_177 ) ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :product_price ?T1_product_price . ?T1 :product_price ?T1_product_price . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_type_code ?T1_product_type_code . } GROUP BY ?T1_product_type_code ORDER BY ASC (?T1_product_type_code)",SELECT (max( ?T1_product_price) as ?aggregation_T1_product_price_122 ) (min( ?T1_product_price) as ?aggregation_T1_product_price_177 ) ?T1_product_type_code WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . } GROUP BY ?T1_product_type_code ORDER BY ASC (?T1_product_type_code)
"List the order id, customer id for orders in Cancelled status, ordered by their order dates.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id ?T1_customer_id WHERE { ?T1 a :customer_orders . ?T1 :order_id ?T1_order_id . ?T1 :customer_id ?T1_customer_id . ?T1 :order_date ?T1_order_date . ?T1 :order_status_code ?T1_order_status_code . FILTER(?T1_order_status_code = 'Cancelled') . } ORDER BY ASC (?T1_order_date)",SELECT ?T1_order_id ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/customer_orders> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/order_date> ?T1_order_date . ?T1 <http://valuenet/ontop/order_status_code> ?T1_order_status_code . FILTER(?T1_order_status_code = 'Cancelled') . } ORDER BY ASC (?T1_order_date)
