nl_question,sparql_partial_uri,sparql_complete_uri
"List the name, born state and age of the heads of departments ordered by age.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_born_state ?T1_age WHERE { ?T1 a :head . ?T1 :name ?T1_name . ?T1 :born_state ?T1_born_state . ?T1 :age ?T1_age . ?T1 :age ?T1_age . } ORDER BY ASC (?T1_age)",SELECT ?T1_name ?T1_born_state ?T1_age WHERE { ?T1 a <http://valuenet/ontop/head> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/born_state> ?T1_born_state . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY ASC (?T1_age)
"List the creation year, name and budget of each department.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_creation ?T1_name ?T1_budget_in_billions WHERE { ?T1 a :department . ?T1 :creation ?T1_creation . ?T1 :name ?T1_name . ?T1 :budget_in_billions ?T1_budget_in_billions . }",SELECT ?T1_creation ?T1_name ?T1_budget_in_billions WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/creation> ?T1_creation . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/budget_in_billions> ?T1_budget_in_billions . }
List the states where both the secretary of 'Treasury' department and the secretary of 'Homeland Security' were born.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_born_state WHERE { ?T1 a :head . ?T13 a :management . ?T13 :ref-head ?T1 . ?T1 :born_state ?T1_born_state . ?T2 :name ?T2_name . ?T2 a :department . ?T13 :ref-department ?T2 . ?T1 :born_state ?T1_born_state . ?T2 :name ?T2_name . FILTER(?T2_name = 'Treasury') . FILTER (?T1_born_state in (?T3_born_state)) . ?T3 a :head . ?T15 a :management . ?T15 :ref-head ?T3 . ?T3 :born_state ?T3_born_state . ?T4 :name ?T4_name . ?T4 a :department . ?T15 :ref-department ?T4 . ?T3 :born_state ?T3_born_state . ?T4 :name ?T4_name . FILTER(?T4_name = 'Homeland Security') . }",SELECT DISTINCT ?T1_born_state WHERE { ?T1 a <http://valuenet/ontop/head> . ?T13 a <http://valuenet/ontop/management> . ?T13 <http://valuenet/ontop/ref-head> ?T1 . ?T1 <http://valuenet/ontop/born_state> ?T1_born_state . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/department> . ?T13 <http://valuenet/ontop/ref-department> ?T2 . ?T1 <http://valuenet/ontop/born_state> ?T1_born_state . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Treasury') . FILTER (?T1_born_state in (?T3_born_state)) . ?T3 a <http://valuenet/ontop/head> . ?T15 a <http://valuenet/ontop/management> . ?T15 <http://valuenet/ontop/ref-head> ?T3 . ?T3 <http://valuenet/ontop/born_state> ?T3_born_state . ?T4 <http://valuenet/ontop/name> ?T4_name . ?T4 a <http://valuenet/ontop/department> . ?T15 <http://valuenet/ontop/ref-department> ?T4 . ?T3 <http://valuenet/ontop/born_state> ?T3_born_state . ?T4 <http://valuenet/ontop/name> ?T4_name . FILTER(?T4_name = 'Homeland Security') . }
"Which department has more than 1 head at a time? List the id, name and the number of heads.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_department_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T2 a :management . ?T2 :ref-department ?T1 . ?T1 :department_id ?T1_department_id . ?T1 :name ?T1_name . } GROUP BY ?T1_department_id ?T1_name HAVING(count( *) > 1)",SELECT ?T1_department_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/department> . ?T2 a <http://valuenet/ontop/management> . ?T2 <http://valuenet/ontop/ref-department> ?T1 . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_department_id ?T1_name HAVING(count( *) > 1)
Which head's name has the substring 'Ha'? List the id and name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_head_id ?T1_name WHERE { ?T1 a :head . ?T1 :head_id ?T1_head_id . ?T1 :name ?T1_name . ?T1 :name ?T1_name . FILTER(contains (?T1_name, 'Ha')) . }","SELECT ?T1_head_id ?T1_name WHERE { ?T1 a <http://valuenet/ontop/head> . ?T1 <http://valuenet/ontop/head_id> ?T1_head_id . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(contains (?T1_name, 'Ha')) . }"
