nl_question,sparql_partial_uri,sparql_complete_uri
"Find the name and access counts of all documents, in alphabetic order of the document name.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_name ?T1_access_count WHERE { ?T1 a :documents . ?T1 :document_name ?T1_document_name . ?T1 :access_count ?T1_access_count . ?T1 :document_name ?T1_document_name . } ORDER BY ASC (?T1_document_name)",SELECT ?T1_document_name ?T1_access_count WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . ?T1 <http://valuenet/ontop/access_count> ?T1_access_count . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . } ORDER BY ASC (?T1_document_name)
Find the types of documents with more than 4 documents.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :document_type_code ?T1_document_type_code . } GROUP BY ?T1_document_type_code HAVING(count( *) > 4)",SELECT ?T1_document_type_code WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_type_code> ?T1_document_type_code . } GROUP BY ?T1_document_type_code HAVING(count( *) > 4)
Find the total access count of all documents in the most popular document type.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_access_count) as ?aggregation_T1_access_count_176 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :access_count ?T1_access_count . } ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT (sum( ?T1_access_count) as ?aggregation_T1_access_count_176 ) (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/access_count> ?T1_access_count . } ORDER BY DESC (?aggregation_all) LIMIT 1
Return the structure description of the document that has been accessed the fewest number of times.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_structure_description (count( *) as ?aggregation_all) WHERE { ?T1 a :document_structures . ?T2 a :documents . ?T2 :ref-document_structure_code ?T1 . ?T1 :document_structure_description ?T1_document_structure_description . } GROUP BY ?T1_document_structure_description ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_document_structure_description (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/document_structures> . ?T2 a <http://valuenet/ontop/documents> . ?T2 <http://valuenet/ontop/ref-document_structure_code> ?T1 . ?T1 <http://valuenet/ontop/document_structure_description> ?T1_document_structure_description . } GROUP BY ?T1_document_structure_description ORDER BY DESC (?aggregation_all) LIMIT 1
Return the type code of the document named 'David CV'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :document_type_code ?T1_document_type_code . ?T1 :document_name ?T1_document_name . FILTER(?T1_document_name = 'David CV') . }",SELECT ?T1_document_type_code WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_type_code> ?T1_document_type_code . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . FILTER(?T1_document_name = 'David CV') . }
Find the list of documents that are both in the most three popular type and have the most three popular structure.,"PREFIX : <http://valuenet/ontop/>
SELECT ?t1_document_name { ?t1 a :documents . ?t1 :document_name ?t1_document_name . ?t1 :document_type_code ?t1_document_type_code . ?t1 :document_structure_code ?t1_document_structure_code . { SELECT ?t2_type_code (count(*) as ?agg) WHERE { ?t2 a :documents . ?t2 :document_type_code ?t2_document_type_code .} GROUP BY ?t2_type_code ORDER BY ?agg LIMIT 3 } { SELECT ?t3_structure_code (count(*) as ?agg) WHERE { ?t3 a :documents . ?t3 :document_structure_code ?t3_structure_code .} GROUP BY ?t3_structure_code ORDER BY ?agg LIMIT 3 } FILTER(?t1_document_type_code in (?t2_type_code)). FILTER(?document_structure_code in (?t3_structure_code)). }",SELECT ?t1_document_name { ?t1 a <http://valuenet/ontop/documents> . ?t1 <http://valuenet/ontop/document_name> ?t1_document_name . ?t1 <http://valuenet/ontop/document_type_code> ?t1_document_type_code . ?t1 <http://valuenet/ontop/document_structure_code> ?t1_document_structure_code . { SELECT ?t2_type_code (count(*) as ?agg) WHERE { ?t2 a <http://valuenet/ontop/documents> . ?t2 <http://valuenet/ontop/document_type_code> ?t2_document_type_code .} GROUP BY ?t2_type_code ORDER BY ?agg LIMIT 3 } { SELECT ?t3_structure_code (count(*) as ?agg) WHERE { ?t3 a <http://valuenet/ontop/documents> . ?t3 <http://valuenet/ontop/document_structure_code> ?t3_structure_code .} GROUP BY ?t3_structure_code ORDER BY ?agg LIMIT 3 } FILTER(?t1_document_type_code in (?t2_type_code)). FILTER(?document_structure_code in (?t3_structure_code)). }
What document types do have more than 10000 total access number.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :document_type_code ?T1_document_type_code . ?T1 :access_count ?T1_access_count . } GROUP BY ?T1_document_type_code HAVING(sum( ?T1_access_count) > 10000)",SELECT ?T1_document_type_code WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_type_code> ?T1_document_type_code . ?T1 <http://valuenet/ontop/access_count> ?T1_access_count . } GROUP BY ?T1_document_type_code HAVING(sum( ?T1_access_count) > 10000)
Give the section titles of the document with the name 'David CV'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_section_title WHERE { ?T1 a :document_sections . ?T2 a :documents . ?T1 :ref-document_code ?T2 . ?T1 :section_title ?T1_section_title . ?T2 :document_name ?T2_document_name . FILTER(?T2_document_name = 'David CV') . }",SELECT ?T1_section_title WHERE { ?T1 a <http://valuenet/ontop/document_sections> . ?T2 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/ref-document_code> ?T2 . ?T1 <http://valuenet/ontop/section_title> ?T1_section_title . ?T2 <http://valuenet/ontop/document_name> ?T2_document_name . FILTER(?T2_document_name = 'David CV') . }
Find all the name of documents without any sections.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :document_name ?T1_document_name . ?T1 :document_code ?T1_document_code . FILTER(?T1_document_code not in (?T22_document_code)) . {SELECT ?T22_document_code WHERE { ?T22 a :document_sections . ?T22 :document_code ?T22_document_code . } } }",SELECT ?T1_document_name WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . ?T1 <http://valuenet/ontop/document_code> ?T1_document_code . FILTER(?T1_document_code not in (?T22_document_code)) . {SELECT ?T22_document_code WHERE { ?T22 a <http://valuenet/ontop/document_sections> . ?T22 <http://valuenet/ontop/document_code> ?T22_document_code . } } }
List all the username and passwords of users with the most popular role.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_user_name (count( *) as ?aggregation_all) ?T1_password WHERE { ?T1 a :users . ?T1 :user_name ?T1_user_name . ?T1 :password ?T1_password . } GROUP BY ?T1_user_name ?T1_password ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_user_name (count( *) as ?aggregation_all) ?T1_password WHERE { ?T1 a <http://valuenet/ontop/users> . ?T1 <http://valuenet/ontop/user_name> ?T1_user_name . ?T1 <http://valuenet/ontop/password> ?T1_password . } GROUP BY ?T1_user_name ?T1_password ORDER BY DESC (?aggregation_all) LIMIT 1
Find the average access counts of documents with functional area 'Acknowledgement'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_99 ) WHERE { ?T1 a :documents . ?T13 a :document_functional_areas . ?T13 :ref-document_code ?T1 . ?T1 :access_count ?T1_access_count . ?T2 :functional_area_description ?T2_functional_area_description . ?T2 a :functional_areas . ?T13 :ref-functional_area_code ?T2 . ?T1 :access_count ?T1_access_count . ?T2 :functional_area_description ?T2_functional_area_description . FILTER(?T2_functional_area_description = 'Acknowledgement') . }",SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_99 ) WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T13 a <http://valuenet/ontop/document_functional_areas> . ?T13 <http://valuenet/ontop/ref-document_code> ?T1 . ?T1 <http://valuenet/ontop/access_count> ?T1_access_count . ?T2 <http://valuenet/ontop/functional_area_description> ?T2_functional_area_description . ?T2 a <http://valuenet/ontop/functional_areas> . ?T13 <http://valuenet/ontop/ref-functional_area_code> ?T2 . ?T1 <http://valuenet/ontop/access_count> ?T1_access_count . ?T2 <http://valuenet/ontop/functional_area_description> ?T2_functional_area_description . FILTER(?T2_functional_area_description = 'Acknowledgement') . }
Find names of the document without any images.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_document_name as ?col1) WHERE { ?T1 a :documents . ?T1 :document_name ?T1_document_name . }} MINUS {SELECT (?T2_document_name as ?col1) WHERE { ?T2 a :documents . ?T2 :document_name ?T2_document_name . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_document_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . }} MINUS {SELECT (?T2_document_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/documents> . ?T2 <http://valuenet/ontop/document_name> ?T2_document_name . } } }
Return the name of the document that has the most sections.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_name (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T2 a :document_sections . ?T2 :ref-document_code ?T1 . ?T1 :document_name ?T1_document_name . } GROUP BY ?T1_document_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_document_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T2 a <http://valuenet/ontop/document_sections> . ?T2 <http://valuenet/ontop/ref-document_code> ?T1 . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . } GROUP BY ?T1_document_name ORDER BY DESC (?aggregation_all) LIMIT 1
List all the document names which contains 'CV'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_name WHERE { ?T1 a :documents . ?T1 :document_name ?T1_document_name . ?T1 :document_name ?T1_document_name . FILTER(contains (?T1_document_name, 'CV')) . }","SELECT ?T1_document_name WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . ?T1 <http://valuenet/ontop/document_name> ?T1_document_name . FILTER(contains (?T1_document_name, 'CV')) . }"
Count the number of users that are logged in.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :users . ?T1 :user_login ?T1_user_login . FILTER(?T1_user_login = 1) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/users> . ?T1 <http://valuenet/ontop/user_login> ?T1_user_login . FILTER(?T1_user_login = 1) . }
Find the description of the most popular role among the users that have logged in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_role_description WHERE { ?T1 a :roles . ?T1 :role_description ?T1_role_description . ?T1 :role_code ?T1_role_code . FILTER(?T1_role_code = (?T22_role_code)) . {SELECT ?T22_role_code (count( *) as ?aggregation_all) WHERE { ?T22 a :users . ?T22 :role_code ?T22_role_code . ?T22 :user_login ?T22_user_login . FILTER(?T22_user_login = 1) . } GROUP BY ?T22_role_code ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_role_description WHERE { ?T1 a <http://valuenet/ontop/roles> . ?T1 <http://valuenet/ontop/role_description> ?T1_role_description . ?T1 <http://valuenet/ontop/role_code> ?T1_role_code . FILTER(?T1_role_code = (?T22_role_code)) . {SELECT ?T22_role_code (count( *) as ?aggregation_all) WHERE { ?T22 a <http://valuenet/ontop/users> . ?T22 <http://valuenet/ontop/role_code> ?T22_role_code . ?T22 <http://valuenet/ontop/user_login> ?T22_user_login . FILTER(?T22_user_login = 1) . } GROUP BY ?T22_role_code ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Find the average access count of documents with the least popular structure.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_130 ) (count( *) as ?aggregation_all) WHERE { ?T1 a :documents . ?T1 :access_count ?T1_access_count . } ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT (avg( ?T1_access_count) as ?aggregation_T1_access_count_130 ) (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/access_count> ?T1_access_count . } ORDER BY ASC (?aggregation_all) LIMIT 1
List all the image name and URLs in the order of their names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_image_name ?T1_image_url WHERE { ?T1 a :images . ?T1 :image_name ?T1_image_name . ?T1 :image_url ?T1_image_url . ?T1 :image_name ?T1_image_name . } ORDER BY ASC (?T1_image_name)",SELECT ?T1_image_name ?T1_image_url WHERE { ?T1 a <http://valuenet/ontop/images> . ?T1 <http://valuenet/ontop/image_name> ?T1_image_name . ?T1 <http://valuenet/ontop/image_url> ?T1_image_url . ?T1 <http://valuenet/ontop/image_name> ?T1_image_name . } ORDER BY ASC (?T1_image_name)
Find the number of users in each role.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_role_code WHERE { ?T1 a :users . ?T1 :role_code ?T1_role_code . } GROUP BY ?T1_role_code",SELECT (count( *) as ?aggregation_all) ?T1_role_code WHERE { ?T1 a <http://valuenet/ontop/users> . ?T1 <http://valuenet/ontop/role_code> ?T1_role_code . } GROUP BY ?T1_role_code
Give the codes of document types that have more than 2 corresponding documents.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_document_type_code WHERE { ?T1 a :documents . ?T1 :document_type_code ?T1_document_type_code . } GROUP BY ?T1_document_type_code HAVING(count( *) > 2)",SELECT ?T1_document_type_code WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T1 <http://valuenet/ontop/document_type_code> ?T1_document_type_code . } GROUP BY ?T1_document_type_code HAVING(count( *) > 2)
