nl_question,sparql_partial_uri,sparql_complete_uri
Find the name of dorms that do not have amenity TV Lounge.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . }} MINUS {SELECT (?T2_dorm_name as ?col1) WHERE { ?T2 a :dorm . ?T14 a :has_amenity . ?T14 :ref-dorm ?T2 . ?T2 :dorm_name ?T2_dorm_name . ?T3 :amenity_name ?T3_amenity_name . ?T3 a :dorm_amenity . ?T14 :ref-amen ?T3 . ?T2 :dorm_name ?T2_dorm_name . ?T3 :amenity_name ?T3_amenity_name . FILTER(?T3_amenity_name = 'TV Lounge') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . }} MINUS {SELECT (?T2_dorm_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/dorm> . ?T14 a <http://valuenet/ontop/has_amenity> . ?T14 <http://valuenet/ontop/ref-dorm> ?T2 . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T3 <http://valuenet/ontop/amenity_name> ?T3_amenity_name . ?T3 a <http://valuenet/ontop/dorm_amenity> . ?T14 <http://valuenet/ontop/ref-amen> ?T3 . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T3 <http://valuenet/ontop/amenity_name> ?T3_amenity_name . FILTER(?T3_amenity_name = 'TV Lounge') . } } }
Find the first and last name of students who are living in the dorms that have amenity TV Lounge.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T2 a :lives_in . ?T2 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :dormid ?T2_dormid . FILTER(?T2_dormid in (?T24_amenity_name)) . {SELECT ?T23_dormid WHERE { ?T23 a :has_amenity . ?T24 a :dorm_amenity . ?T23 :ref-amen ?T24 . ?T23 :dormid ?T23_dormid . ?T24 :amenity_name ?T24_amenity_name . FILTER(?T24_amenity_name = 'TV Lounge') . } } }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/lives_in> . ?T2 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/dormid> ?T2_dormid . FILTER(?T2_dormid in (?T24_amenity_name)) . {SELECT ?T23_dormid WHERE { ?T23 a <http://valuenet/ontop/has_amenity> . ?T24 a <http://valuenet/ontop/dorm_amenity> . ?T23 <http://valuenet/ontop/ref-amen> ?T24 . ?T23 <http://valuenet/ontop/dormid> ?T23_dormid . ?T24 <http://valuenet/ontop/amenity_name> ?T24_amenity_name . FILTER(?T24_amenity_name = 'TV Lounge') . } } }
