nl_question,sparql_partial_uri,sparql_complete_uri
Find the name of dorms only for female (F gender).,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . ?T1 :gender ?T1_gender . FILTER(?T1_gender = 'F') . }",SELECT ?T1_dorm_name WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T1 <http://valuenet/ontop/gender> ?T1_gender . FILTER(?T1_gender = 'F') . }
Find the name of dorms that can accommodate more than 300 students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . ?T1 :student_capacity ?T1_student_capacity . FILTER(?T1_student_capacity > 300) . }",SELECT ?T1_dorm_name WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . FILTER(?T1_student_capacity > 300) . }
Find the first name of students who is older than 20.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :age ?T1_age . FILTER(?T1_age > 20) . }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 20) . }
Find the first name of students living in city PHL whose age is between 20 and 25.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :city_code ?T1_city_code . ?T1 :age ?T1_age . FILTER(?T1_city_code = 'PHL' && ?T1_age >= 20 && ?T1_age <= 25) . }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_city_code = 'PHL' && ?T1_age >= 20 && ?T1_age <= 25) . }
Find the number of distinct amenities.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm_amenity . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/dorm_amenity> . }
Find the total capacity of all dorms.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_114 ) WHERE { ?T1 a :dorm . ?T1 :student_capacity ?T1_student_capacity . }",SELECT (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_114 ) WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . }
Find the average age of all students living in the each city.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_85 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :city_code ?T1_city_code . } GROUP BY ?T1_city_code",SELECT (avg( ?T1_age) as ?aggregation_T1_age_85 ) ?T1_city_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . } GROUP BY ?T1_city_code
Find the average and total capacity of dorms for the students with gender X.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_student_capacity) as ?aggregation_T1_student_capacity_88 ) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_187 ) WHERE { ?T1 a :dorm . ?T1 :student_capacity ?T1_student_capacity . ?T1 :student_capacity ?T1_student_capacity . ?T1 :gender ?T1_gender . FILTER(?T1_gender = 'X') . }",SELECT (avg( ?T1_student_capacity) as ?aggregation_T1_student_capacity_88 ) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_187 ) WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . ?T1 <http://valuenet/ontop/gender> ?T1_gender . FILTER(?T1_gender = 'X') . }
Find the number of dorms that have some amenity.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_dormid) as ?aggregation_T1_dormid_54 ) WHERE { ?T1 a :has_amenity . ?T1 :dormid ?T1_dormid . }",SELECT DISTINCT (count(DISTINCT ?T1_dormid) as ?aggregation_T1_dormid_54 ) WHERE { ?T1 a <http://valuenet/ontop/has_amenity> . ?T1 <http://valuenet/ontop/dormid> ?T1_dormid . }
Find the name of dorms that do not have any amenity,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . ?T1 :dormid ?T1_dormid . FILTER(?T1_dormid not in (?T22_dormid)) . {SELECT ?T22_dormid WHERE { ?T22 a :has_amenity . ?T22 :dormid ?T22_dormid . } } }",SELECT ?T1_dorm_name WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T1 <http://valuenet/ontop/dormid> ?T1_dormid . FILTER(?T1_dormid not in (?T22_dormid)) . {SELECT ?T22_dormid WHERE { ?T22 a <http://valuenet/ontop/has_amenity> . ?T22 <http://valuenet/ontop/dormid> ?T22_dormid . } } }
Find the number of distinct gender for dorms.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_gender) as ?aggregation_T1_gender_171 ) WHERE { ?T1 a :dorm . ?T1 :gender ?T1_gender . }",SELECT DISTINCT (count(DISTINCT ?T1_gender) as ?aggregation_T1_gender_171 ) WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/gender> ?T1_gender . }
Find the capacity and gender type of the dorm whose name has substring ‘Donor’.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_student_capacity ?T1_gender WHERE { ?T1 a :dorm . ?T1 :student_capacity ?T1_student_capacity . ?T1 :gender ?T1_gender . ?T1 :dorm_name ?T1_dorm_name . FILTER(contains (?T1_dorm_name, 'Donor')) . }","SELECT ?T1_student_capacity ?T1_gender WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . ?T1 <http://valuenet/ontop/gender> ?T1_gender . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . FILTER(contains (?T1_dorm_name, 'Donor')) . }"
Find the name and gender type of the dorms whose capacity is greater than 300 or less than 100.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dorm_name ?T1_gender WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . ?T1 :gender ?T1_gender . ?T1 :student_capacity ?T1_student_capacity . ?T1 :student_capacity ?T1_student_capacity . FILTER(?T1_student_capacity > 300 || ?T1_student_capacity < 100) . }",SELECT ?T1_dorm_name ?T1_gender WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T1 <http://valuenet/ontop/gender> ?T1_gender . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . FILTER(?T1_student_capacity > 300 || ?T1_student_capacity < 100) . }
Find the numbers of different majors and cities.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_major) as ?aggregation_T1_major_25 ) (count(DISTINCT ?T1_city_code) as ?aggregation_T1_city_code_193 ) WHERE { ?T1 a :student . ?T1 :major ?T1_major . ?T1 :city_code ?T1_city_code . }",SELECT DISTINCT (count(DISTINCT ?T1_major) as ?aggregation_T1_major_25 ) (count(DISTINCT ?T1_city_code) as ?aggregation_T1_city_code_193 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/major> ?T1_major . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . }
Find the name of dorms which have both TV Lounge and Study Room as amenities.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T13 a :has_amenity . ?T13 :ref-dorm ?T1 . ?T1 :dorm_name ?T1_dorm_name . ?T2 :amenity_name ?T2_amenity_name . ?T2 a :dorm_amenity . ?T13 :ref-amen ?T2 . ?T1 :dorm_name ?T1_dorm_name . ?T2 :amenity_name ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') . FILTER (?T1_dorm_name in (?T3_dorm_name)) . ?T3 a :dorm . ?T15 a :has_amenity . ?T15 :ref-dorm ?T3 . ?T3 :dorm_name ?T3_dorm_name . ?T4 :amenity_name ?T4_amenity_name . ?T4 a :dorm_amenity . ?T15 :ref-amen ?T4 . ?T3 :dorm_name ?T3_dorm_name . ?T4 :amenity_name ?T4_amenity_name . FILTER(?T4_amenity_name = 'Study Room') . }",SELECT DISTINCT ?T1_dorm_name WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T13 a <http://valuenet/ontop/has_amenity> . ?T13 <http://valuenet/ontop/ref-dorm> ?T1 . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T2 <http://valuenet/ontop/amenity_name> ?T2_amenity_name . ?T2 a <http://valuenet/ontop/dorm_amenity> . ?T13 <http://valuenet/ontop/ref-amen> ?T2 . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T2 <http://valuenet/ontop/amenity_name> ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') . FILTER (?T1_dorm_name in (?T3_dorm_name)) . ?T3 a <http://valuenet/ontop/dorm> . ?T15 a <http://valuenet/ontop/has_amenity> . ?T15 <http://valuenet/ontop/ref-dorm> ?T3 . ?T3 <http://valuenet/ontop/dorm_name> ?T3_dorm_name . ?T4 <http://valuenet/ontop/amenity_name> ?T4_amenity_name . ?T4 a <http://valuenet/ontop/dorm_amenity> . ?T15 <http://valuenet/ontop/ref-amen> ?T4 . ?T3 <http://valuenet/ontop/dorm_name> ?T3_dorm_name . ?T4 <http://valuenet/ontop/amenity_name> ?T4_amenity_name . FILTER(?T4_amenity_name = 'Study Room') . }
Find the name of dorms which have TV Lounge but no Study Room as amenity.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a :dorm . ?T13 a :has_amenity . ?T13 :ref-dorm ?T1 . ?T1 :dorm_name ?T1_dorm_name . ?T2 :amenity_name ?T2_amenity_name . ?T2 a :dorm_amenity . ?T13 :ref-amen ?T2 . ?T1 :dorm_name ?T1_dorm_name . ?T2 :amenity_name ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') . }} MINUS {SELECT (?T3_dorm_name as ?col1) WHERE { ?T3 a :dorm . ?T15 a :has_amenity . ?T15 :ref-dorm ?T3 . ?T3 :dorm_name ?T3_dorm_name . ?T4 :amenity_name ?T4_amenity_name . ?T4 a :dorm_amenity . ?T15 :ref-amen ?T4 . ?T3 :dorm_name ?T3_dorm_name . ?T4 :amenity_name ?T4_amenity_name . FILTER(?T4_amenity_name = 'Study Room') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_dorm_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T13 a <http://valuenet/ontop/has_amenity> . ?T13 <http://valuenet/ontop/ref-dorm> ?T1 . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T2 <http://valuenet/ontop/amenity_name> ?T2_amenity_name . ?T2 a <http://valuenet/ontop/dorm_amenity> . ?T13 <http://valuenet/ontop/ref-amen> ?T2 . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T2 <http://valuenet/ontop/amenity_name> ?T2_amenity_name . FILTER(?T2_amenity_name = 'TV Lounge') . }} MINUS {SELECT (?T3_dorm_name as ?col1) WHERE { ?T3 a <http://valuenet/ontop/dorm> . ?T15 a <http://valuenet/ontop/has_amenity> . ?T15 <http://valuenet/ontop/ref-dorm> ?T3 . ?T3 <http://valuenet/ontop/dorm_name> ?T3_dorm_name . ?T4 <http://valuenet/ontop/amenity_name> ?T4_amenity_name . ?T4 a <http://valuenet/ontop/dorm_amenity> . ?T15 <http://valuenet/ontop/ref-amen> ?T4 . ?T3 <http://valuenet/ontop/dorm_name> ?T3_dorm_name . ?T4 <http://valuenet/ontop/amenity_name> ?T4_amenity_name . FILTER(?T4_amenity_name = 'Study Room') . } } }
Find the last name of students who is either female (sex is F) and living in the city of code BAL or male (sex is M) and in age of below 20.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a :student . ?T1 :lname ?T1_lname . ?T1 :sex ?T1_sex . ?T1 :city_code ?T1_city_code . FILTER(?T1_sex = 'F' && ?T1_city_code = 'BAL') . }} UNION {SELECT (?T1_lname as ?col1) WHERE { ?T1 a :student . ?T1 :lname ?T1_lname . ?T1 :sex ?T1_sex . ?T1 :age ?T1_age . FILTER(?T1_sex = 'M' && ?T1_age < 20) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_lname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . FILTER(?T1_sex = 'F' && ?T1_city_code = 'BAL') . }} UNION {SELECT (?T1_lname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_sex = 'M' && ?T1_age < 20) . } } }
Find the name of the dorm with the largest capacity.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dorm_name WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . ?T1 :student_capacity ?T1_student_capacity . } ORDER BY DESC (?T1_student_capacity) LIMIT 1",SELECT ?T1_dorm_name WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . } ORDER BY DESC (?T1_student_capacity) LIMIT 1
List in alphabetic order all different amenities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T1 :amenity_name ?T1_amenity_name . ?T1 :amenity_name ?T1_amenity_name . } ORDER BY ASC (?T1_amenity_name)",SELECT ?T1_amenity_name WHERE { ?T1 a <http://valuenet/ontop/dorm_amenity> . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . } ORDER BY ASC (?T1_amenity_name)
Find the code of city where most of students are living in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a :student . ?T1 :city_code ?T1_city_code . } GROUP BY ?T1_city_code ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_city_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . } GROUP BY ?T1_city_code ORDER BY DESC (?aggregation_all) LIMIT 1
Find the first and last name of students whose age is younger than the average age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :age ?T1_age . FILTER(?T1_age < (?aggregation_T22_age_173)) . {SELECT (avg( ?T22_age) as ?aggregation_T22_age_173 ) WHERE { ?T22 a :student . ?T22 :age ?T22_age . } } }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age < (?aggregation_T22_age_173)) . {SELECT (avg( ?T22_age) as ?aggregation_T22_age_173 ) WHERE { ?T22 a <http://valuenet/ontop/student> . ?T22 <http://valuenet/ontop/age> ?T22_age . } } }
"List the first and last name of students who are not living in the city with code HKG, and sorted the results by their ages.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :age ?T1_age . ?T1 :city_code ?T1_city_code . FILTER(?T1_city_code != 'HKG') . } ORDER BY ASC (?T1_age)",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . FILTER(?T1_city_code != 'HKG') . } ORDER BY ASC (?T1_age)
"List name of all amenities which Anonymous Donor Hall has, and sort the results in alphabetic order.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :ref-amen ?T1 . ?T1 :amenity_name ?T1_amenity_name . ?T1 :amenity_name ?T1_amenity_name . ?T2 :dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :ref-dorm ?T2 . ?T1 :amenity_name ?T1_amenity_name . ?T1 :amenity_name ?T1_amenity_name . ?T2 :dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Anonymous Donor Hall') . } ORDER BY ASC (?T1_amenity_name)",SELECT ?T1_amenity_name WHERE { ?T1 a <http://valuenet/ontop/dorm_amenity> . ?T13 a <http://valuenet/ontop/has_amenity> . ?T13 <http://valuenet/ontop/ref-amen> ?T1 . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T2 a <http://valuenet/ontop/dorm> . ?T13 <http://valuenet/ontop/ref-dorm> ?T2 . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . FILTER(?T2_dorm_name = 'Anonymous Donor Hall') . } ORDER BY ASC (?T1_amenity_name)
Find the number of dorms and total capacity for each gender.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_96 ) ?T1_gender WHERE { ?T1 a :dorm . ?T1 :student_capacity ?T1_student_capacity . ?T1 :gender ?T1_gender . } GROUP BY ?T1_gender",SELECT (count( *) as ?aggregation_all) (sum( ?T1_student_capacity) as ?aggregation_T1_student_capacity_96 ) ?T1_gender WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . ?T1 <http://valuenet/ontop/gender> ?T1_gender . } GROUP BY ?T1_gender
Find the average and oldest age for students with different sex.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_105 ) (max( ?T1_age) as ?aggregation_T1_age_144 ) ?T1_sex WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :sex ?T1_sex . } GROUP BY ?T1_sex",SELECT (avg( ?T1_age) as ?aggregation_T1_age_105 ) (max( ?T1_age) as ?aggregation_T1_age_144 ) ?T1_sex WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/sex> ?T1_sex . } GROUP BY ?T1_sex
Find the number of students in each major.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_major WHERE { ?T1 a :student . ?T1 :major ?T1_major . } GROUP BY ?T1_major",SELECT (count( *) as ?aggregation_all) ?T1_major WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/major> ?T1_major . } GROUP BY ?T1_major
Find the number and average age of students living in each city.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_86 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :city_code ?T1_city_code . } GROUP BY ?T1_city_code",SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_86 ) ?T1_city_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . } GROUP BY ?T1_city_code
Find the average age and number of male students (with sex M) from each city.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_16 ) ?T1_city_code WHERE { ?T1 a :student . ?T1 :age ?T1_age . ?T1 :city_code ?T1_city_code . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'M') . } GROUP BY ?T1_city_code",SELECT (count( *) as ?aggregation_all) (avg( ?T1_age) as ?aggregation_T1_age_16 ) ?T1_city_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'M') . } GROUP BY ?T1_city_code
Find the number of students for the cities where have more than one student.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_city_code WHERE { ?T1 a :student . ?T1 :city_code ?T1_city_code . } GROUP BY ?T1_city_code HAVING(count( *) > 1)",SELECT (count( *) as ?aggregation_all) ?T1_city_code WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . } GROUP BY ?T1_city_code HAVING(count( *) > 1)
Find the first and last name of students who are not in the largest major.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :major ?T1_major . FILTER(?T1_major != (?T22_major)) . {SELECT ?T22_major (count( *) as ?aggregation_all) WHERE { ?T22 a :student . ?T22 :major ?T22_major . } GROUP BY ?T22_major ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/major> ?T1_major . FILTER(?T1_major != (?T22_major)) . {SELECT ?T22_major (count( *) as ?aggregation_all) WHERE { ?T22 a <http://valuenet/ontop/student> . ?T22 <http://valuenet/ontop/major> ?T22_major . } GROUP BY ?T22_major ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Find the number of students whose age is older than the average age for each gender.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a :student . ?T1 :sex ?T1_sex . ?T1 :age ?T1_age . FILTER(?T1_age > (?aggregation_T22_age_129)) . {SELECT (avg( ?T22_age) as ?aggregation_T22_age_129 ) WHERE { ?T22 a :student . ?T22 :age ?T22_age . } } } GROUP BY ?T1_sex",SELECT (count( *) as ?aggregation_all) ?T1_sex WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > (?aggregation_T22_age_129)) . {SELECT (avg( ?T22_age) as ?aggregation_T22_age_129 ) WHERE { ?T22 a <http://valuenet/ontop/student> . ?T22 <http://valuenet/ontop/age> ?T22_age . } } } GROUP BY ?T1_sex
Find the average age of students living in each dorm and the name of dorm.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_171 ) ?T2_dorm_name WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :ref-stu ?T1 . ?T1 :age ?T1_age . ?T2 :dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :ref-dorm ?T2 . ?T1 :age ?T1_age . ?T2 :dorm_name ?T2_dorm_name . } GROUP BY ?T2_dorm_name",SELECT (avg( ?T1_age) as ?aggregation_T1_age_171 ) ?T2_dorm_name WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/lives_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T2 a <http://valuenet/ontop/dorm> . ?T13 <http://valuenet/ontop/ref-dorm> ?T2 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . } GROUP BY ?T2_dorm_name
Find the number of amenities for each of the dorms that can accommodate more than 100 students.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_dormid WHERE { ?T1 a :has_amenity . ?T2 a :dorm . ?T1 :ref-dorm ?T2 . ?T2 :dormid ?T2_dormid . ?T2 :student_capacity ?T2_student_capacity . FILTER(?T2_student_capacity > 100) . } GROUP BY ?T2_dormid",SELECT (count( *) as ?aggregation_all) ?T2_dormid WHERE { ?T1 a <http://valuenet/ontop/has_amenity> . ?T2 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/ref-dorm> ?T2 . ?T2 <http://valuenet/ontop/dormid> ?T2_dormid . ?T2 <http://valuenet/ontop/student_capacity> ?T2_student_capacity . FILTER(?T2_student_capacity > 100) . } GROUP BY ?T2_dormid
Find the number of students who is older than 20 in each dorm.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_dorm_name WHERE { ?T1 a :lives_in . ?T2 a :dorm . ?T1 :ref-dorm ?T2 . ?T2 :dorm_name ?T2_dorm_name . ?T3 :age ?T3_age . ?T3 a :student . ?T1 :ref-stu ?T3 . ?T2 :dorm_name ?T2_dorm_name . ?T3 :age ?T3_age . FILTER(?T3_age > 20) . } GROUP BY ?T2_dorm_name",SELECT (count( *) as ?aggregation_all) ?T2_dorm_name WHERE { ?T1 a <http://valuenet/ontop/lives_in> . ?T2 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/ref-dorm> ?T2 . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T3 <http://valuenet/ontop/age> ?T3_age . ?T3 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/ref-stu> ?T3 . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T3 <http://valuenet/ontop/age> ?T3_age . FILTER(?T3_age > 20) . } GROUP BY ?T2_dorm_name
Find the first name of students who are living in the Smith Hall.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T2 :dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :ref-dorm ?T2 . ?T1 :fname ?T1_fname . ?T2 :dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') . }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/lives_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T2 a <http://valuenet/ontop/dorm> . ?T13 <http://valuenet/ontop/ref-dorm> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') . }
Find the average age of students who are living in the dorm with the largest capacity.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_148 ) WHERE { ?T1 a :student . ?T13 a :lives_in . ?T13 :ref-stu ?T1 . ?T1 :age ?T1_age . ?T2 :student_capacity ?T2_student_capacity . ?T2 a :dorm . ?T13 :ref-dorm ?T2 . ?T1 :age ?T1_age . ?T2 :student_capacity ?T2_student_capacity . FILTER(?T2_student_capacity = (?aggregation_T23_student_capacity_158)) . {SELECT (max( ?T23_student_capacity) as ?aggregation_T23_student_capacity_158 ) WHERE { ?T23 a :dorm . ?T23 :student_capacity ?T23_student_capacity . } } }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_148 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T13 a <http://valuenet/ontop/lives_in> . ?T13 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/student_capacity> ?T2_student_capacity . ?T2 a <http://valuenet/ontop/dorm> . ?T13 <http://valuenet/ontop/ref-dorm> ?T2 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/student_capacity> ?T2_student_capacity . FILTER(?T2_student_capacity = (?aggregation_T23_student_capacity_158)) . {SELECT (max( ?T23_student_capacity) as ?aggregation_T23_student_capacity_158 ) WHERE { ?T23 a <http://valuenet/ontop/dorm> . ?T23 <http://valuenet/ontop/student_capacity> ?T23_student_capacity . } } }
Find the total number of students living in the male dorm (with gender M).,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :lives_in . ?T2 a :dorm . ?T13 :ref-dorm ?T2 . ?T2 :gender ?T2_gender . FILTER(?T2_gender = 'M') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a <http://valuenet/ontop/lives_in> . ?T2 a <http://valuenet/ontop/dorm> . ?T13 <http://valuenet/ontop/ref-dorm> ?T2 . ?T2 <http://valuenet/ontop/gender> ?T2_gender . FILTER(?T2_gender = 'M') . }
Find the number of female students (with F sex) living in Smith Hall,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :lives_in . ?T2 a :dorm . ?T1 :ref-dorm ?T2 . ?T2 :dorm_name ?T2_dorm_name . ?T3 :sex ?T3_sex . ?T3 a :student . ?T1 :ref-stu ?T3 . ?T2 :dorm_name ?T2_dorm_name . ?T3 :sex ?T3_sex . FILTER(?T2_dorm_name = 'Smith Hall' && ?T3_sex = 'F') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/lives_in> . ?T2 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/ref-dorm> ?T2 . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T3 <http://valuenet/ontop/sex> ?T3_sex . ?T3 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/ref-stu> ?T3 . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T3 <http://valuenet/ontop/sex> ?T3_sex . FILTER(?T2_dorm_name = 'Smith Hall' && ?T3_sex = 'F') . }
Find the name of amenities Smith Hall dorm have.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_amenity_name WHERE { ?T1 a :dorm_amenity . ?T13 a :has_amenity . ?T13 :ref-amen ?T1 . ?T1 :amenity_name ?T1_amenity_name . ?T2 :dorm_name ?T2_dorm_name . ?T2 a :dorm . ?T13 :ref-dorm ?T2 . ?T1 :amenity_name ?T1_amenity_name . ?T2 :dorm_name ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') . }",SELECT ?T1_amenity_name WHERE { ?T1 a <http://valuenet/ontop/dorm_amenity> . ?T13 a <http://valuenet/ontop/has_amenity> . ?T13 <http://valuenet/ontop/ref-amen> ?T1 . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . ?T2 a <http://valuenet/ontop/dorm> . ?T13 <http://valuenet/ontop/ref-dorm> ?T2 . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . ?T2 <http://valuenet/ontop/dorm_name> ?T2_dorm_name . FILTER(?T2_dorm_name = 'Smith Hall') . }
Find the name of amenity that is most common in all dorms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_amenity_name (count( *) as ?aggregation_all) WHERE { ?T1 a :dorm_amenity . ?T2 a :has_amenity . ?T2 :ref-amen ?T1 . ?T1 :amenity_name ?T1_amenity_name . } GROUP BY ?T1_amenity_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_amenity_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/dorm_amenity> . ?T2 a <http://valuenet/ontop/has_amenity> . ?T2 <http://valuenet/ontop/ref-amen> ?T1 . ?T1 <http://valuenet/ontop/amenity_name> ?T1_amenity_name . } GROUP BY ?T1_amenity_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the first name of students who are living in the dorm that has most number of amenities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T2 a :lives_in . ?T2 :ref-stu ?T1 . ?T1 :fname ?T1_fname . ?T2 :dormid ?T2_dormid . FILTER(?T2_dormid in (?T23_dormid)) . {SELECT ?T23_dormid (count( *) as ?aggregation_all) WHERE { ?T23 a :lives_in . ?T24 a :dorm . ?T23 :ref-dorm ?T24 . ?T23 :dormid ?T23_dormid . } GROUP BY ?T23_dormid ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/lives_in> . ?T2 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/dormid> ?T2_dormid . FILTER(?T2_dormid in (?T23_dormid)) . {SELECT ?T23_dormid (count( *) as ?aggregation_all) WHERE { ?T23 a <http://valuenet/ontop/lives_in> . ?T24 a <http://valuenet/ontop/dorm> . ?T23 <http://valuenet/ontop/ref-dorm> ?T24 . ?T23 <http://valuenet/ontop/dormid> ?T23_dormid . } GROUP BY ?T23_dormid ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Find the name and capacity of the dorm with least number of amenities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_dorm_name (count( *) as ?aggregation_all) ?T1_student_capacity WHERE { ?T1 a :dorm . ?T1 :dorm_name ?T1_dorm_name . ?T1 :student_capacity ?T1_student_capacity . } GROUP BY ?T1_dorm_name ?T1_student_capacity ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT ?T1_dorm_name (count( *) as ?aggregation_all) ?T1_student_capacity WHERE { ?T1 a <http://valuenet/ontop/dorm> . ?T1 <http://valuenet/ontop/dorm_name> ?T1_dorm_name . ?T1 <http://valuenet/ontop/student_capacity> ?T1_student_capacity . } GROUP BY ?T1_dorm_name ?T1_student_capacity ORDER BY ASC (?aggregation_all) LIMIT 1
