nl_question,sparql_partial_uri,sparql_complete_uri
List all vehicle id,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_vehicle_id WHERE { ?T1 a :vehicles . ?T1 :vehicle_id ?T1_vehicle_id . }",SELECT ?T1_vehicle_id WHERE { ?T1 a <http://valuenet/ontop/vehicles> . ?T1 <http://valuenet/ontop/vehicle_id> ?T1_vehicle_id . }
Show the detail of vehicle with id 1.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_vehicle_details WHERE { ?T1 a :vehicles . ?T1 :vehicle_details ?T1_vehicle_details . ?T1 :vehicle_id ?T1_vehicle_id . FILTER(?T1_vehicle_id = 1) . }",SELECT ?T1_vehicle_details WHERE { ?T1 a <http://valuenet/ontop/vehicles> . ?T1 <http://valuenet/ontop/vehicle_details> ?T1_vehicle_details . ?T1 <http://valuenet/ontop/vehicle_id> ?T1_vehicle_id . FILTER(?T1_vehicle_id = 1) . }
List the first name middle name and last name of all staff.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_middle_name ?T1_last_name WHERE { ?T1 a :staff . ?T1 :first_name ?T1_first_name . ?T1 :middle_name ?T1_middle_name . ?T1 :last_name ?T1_last_name . }",SELECT ?T1_first_name ?T1_middle_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/middle_name> ?T1_middle_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . }
Find out the first name and last name of staff lived in city Damianfort.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :staff . ?T2 a :addresses . ?T1 :ref-staff_address ?T2 . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T2 :city ?T2_city . FILTER(?T2_city = 'Damianfort') . }",SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/staff> . ?T2 a <http://valuenet/ontop/addresses> . ?T1 <http://valuenet/ontop/ref-staff_address> ?T2 . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T2 <http://valuenet/ontop/city> ?T2_city . FILTER(?T2_city = 'Damianfort') . }
List the states which have between 2 to 4 staffs living there.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_state_province_county WHERE { ?T1 a :addresses . ?T2 a :staff . ?T2 :ref-staff_address ?T1 . ?T1 :state_province_county ?T1_state_province_county . } GROUP BY ?T1_state_province_county HAVING(count( *) >= 2 && count( *) <= 4)",SELECT ?T1_state_province_county WHERE { ?T1 a <http://valuenet/ontop/addresses> . ?T2 a <http://valuenet/ontop/staff> . ?T2 <http://valuenet/ontop/ref-staff_address> ?T1 . ?T1 <http://valuenet/ontop/state_province_county> ?T1_state_province_county . } GROUP BY ?T1_state_province_county HAVING(count( *) >= 2 && count( *) <= 4)
List the first name and last name of all customers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . }",SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . }
List email address and birthday of customer whose first name as Carole.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_email_address ?T1_date_of_birth WHERE { ?T1 a :customers . ?T1 :email_address ?T1_email_address . ?T1 :date_of_birth ?T1_date_of_birth . ?T1 :first_name ?T1_first_name . FILTER(?T1_first_name = 'Carole') . }",SELECT ?T1_email_address ?T1_date_of_birth WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/email_address> ?T1_email_address . ?T1 <http://valuenet/ontop/date_of_birth> ?T1_date_of_birth . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . FILTER(?T1_first_name = 'Carole') . }
List phone number and email address of customer with more than 2000 outstanding balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_phone_number ?T1_email_address WHERE { ?T1 a :customers . ?T1 :phone_number ?T1_phone_number . ?T1 :email_address ?T1_email_address . ?T1 :amount_outstanding ?T1_amount_outstanding . FILTER(?T1_amount_outstanding > 2000) . }",SELECT ?T1_phone_number ?T1_email_address WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/phone_number> ?T1_phone_number . ?T1 <http://valuenet/ontop/email_address> ?T1_email_address . ?T1 <http://valuenet/ontop/amount_outstanding> ?T1_amount_outstanding . FILTER(?T1_amount_outstanding > 2000) . }
List all customer status codes and the number of customers having each status code.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customer_status_code ?T1_customer_status_code . } GROUP BY ?T1_customer_status_code",SELECT ?T1_customer_status_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_status_code> ?T1_customer_status_code . } GROUP BY ?T1_customer_status_code
List the first name and last name of customers have the amount of outstanding between 1000 and 3000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :amount_outstanding ?T1_amount_outstanding . FILTER(?T1_amount_outstanding >= 1000 && ?T1_amount_outstanding <= 3000) . }",SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/amount_outstanding> ?T1_amount_outstanding . FILTER(?T1_amount_outstanding >= 1000 && ?T1_amount_outstanding <= 3000) . }
List the number of customers that did not have any payment history.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T1 :customer_id ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) . {SELECT ?T22_customer_id WHERE { ?T22 a :customer_payments . ?T22 :customer_id ?T22_customer_id . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . FILTER(?T1_customer_id not in (?T22_customer_id)) . {SELECT ?T22_customer_id WHERE { ?T22 a <http://valuenet/ontop/customer_payments> . ?T22 <http://valuenet/ontop/customer_id> ?T22_customer_id . } } }
List first name and last name of customers that have more than 2 payments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :customers . ?T2 a :customer_payments . ?T2 :ref-customer ?T1 . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . } GROUP BY ?T1_first_name ?T1_last_name HAVING(count( *) > 2)",SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/customer_payments> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . } GROUP BY ?T1_first_name ?T1_last_name HAVING(count( *) > 2)
List all payment methods and number of payments using each payment methods.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customer_payments . ?T1 :payment_method_code ?T1_payment_method_code . } GROUP BY ?T1_payment_method_code",SELECT ?T1_payment_method_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customer_payments> . ?T1 <http://valuenet/ontop/payment_method_code> ?T1_payment_method_code . } GROUP BY ?T1_payment_method_code
"List lesson id of all lessons taught by staff with first name as Janessa, last name as Sawayn and nickname containing letter 's'.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lesson_id WHERE { ?T1 a :lessons . ?T2 a :staff . ?T1 :ref-staff ?T2 . ?T1 :lesson_id ?T1_lesson_id . ?T2 :first_name ?T2_first_name . ?T2 :last_name ?T2_last_name . ?T2 :nickname ?T2_nickname . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn' && contains (?T2_nickname, 's')) . }","SELECT ?T1_lesson_id WHERE { ?T1 a <http://valuenet/ontop/lessons> . ?T2 a <http://valuenet/ontop/staff> . ?T1 <http://valuenet/ontop/ref-staff> ?T2 . ?T1 <http://valuenet/ontop/lesson_id> ?T1_lesson_id . ?T2 <http://valuenet/ontop/first_name> ?T2_first_name . ?T2 <http://valuenet/ontop/last_name> ?T2_last_name . ?T2 <http://valuenet/ontop/nickname> ?T2_nickname . FILTER(?T2_first_name = 'Janessa' && ?T2_last_name = 'Sawayn' && contains (?T2_nickname, 's')) . }"
