nl_question,sparql_partial_uri,sparql_complete_uri
What are the addresses of the course authors or tutors with personal name 'Cathrine',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T1 :address_line_1 ?T1_address_line_1 . ?T1 :personal_name ?T1_personal_name . FILTER(?T1_personal_name = 'Cathrine') . }",SELECT ?T1_address_line_1 WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/address_line_1> ?T1_address_line_1 . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . FILTER(?T1_personal_name = 'Cathrine') . }
List the addresses of all the course authors or tutors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T1 :address_line_1 ?T1_address_line_1 . }",SELECT ?T1_address_line_1 WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/address_line_1> ?T1_address_line_1 . }
List all the login names and family names of course author and tutors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_login_name ?T1_family_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :login_name ?T1_login_name . ?T1 :family_name ?T1_family_name . }",SELECT ?T1_login_name ?T1_family_name WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/login_name> ?T1_login_name . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . }
List all the dates of enrollment and completion of students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T1 :date_of_enrolment ?T1_date_of_enrolment . ?T1 :date_of_completion ?T1_date_of_completion . }",SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T1 <http://valuenet/ontop/date_of_enrolment> ?T1_date_of_enrolment . ?T1 <http://valuenet/ontop/date_of_completion> ?T1_date_of_completion . }
Find the number of distinct students enrolled in courses.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_student_id) as ?aggregation_T1_student_id_187 ) WHERE { ?T1 a :student_course_enrolment . ?T1 :student_id ?T1_student_id . }",SELECT DISTINCT (count(DISTINCT ?T1_student_id) as ?aggregation_T1_student_id_187 ) WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T1 <http://valuenet/ontop/student_id> ?T1_student_id . }
Find the number of distinct courses that have enrolled students.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( ?T1_course_id) as ?aggregation_T1_course_id_28 ) WHERE { ?T1 a :student_course_enrolment . ?T1 :course_id ?T1_course_id . }",SELECT (count( ?T1_course_id) as ?aggregation_T1_course_id_28 ) WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T1 <http://valuenet/ontop/course_id> ?T1_course_id . }
Find the dates of the tests taken with result 'Pass'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_test_taken WHERE { ?T1 a :student_tests_taken . ?T1 :date_test_taken ?T1_date_test_taken . ?T1 :test_result ?T1_test_result . FILTER(?T1_test_result = 'Pass') . }",SELECT ?T1_date_test_taken WHERE { ?T1 a <http://valuenet/ontop/student_tests_taken> . ?T1 <http://valuenet/ontop/date_test_taken> ?T1_date_test_taken . ?T1 <http://valuenet/ontop/test_result> ?T1_test_result . FILTER(?T1_test_result = 'Pass') . }
Count the number of tests with 'Fail' result.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :student_tests_taken . ?T1 :test_result ?T1_test_result . FILTER(?T1_test_result = 'Fail') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student_tests_taken> . ?T1 <http://valuenet/ontop/test_result> ?T1_test_result . FILTER(?T1_test_result = 'Fail') . }
Return the login names of the students whose family name is 'Ward'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_login_name WHERE { ?T1 a :students . ?T1 :login_name ?T1_login_name . ?T1 :family_name ?T1_family_name . FILTER(?T1_family_name = 'Ward') . }",SELECT ?T1_login_name WHERE { ?T1 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/login_name> ?T1_login_name . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . FILTER(?T1_family_name = 'Ward') . }
Find the latest logon date of the students whose family name is 'Jaskolski' or 'Langosh'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_latest_logon WHERE { ?T1 a :students . ?T1 :date_of_latest_logon ?T1_date_of_latest_logon . ?T1 :family_name ?T1_family_name . ?T1 :family_name ?T1_family_name . FILTER(?T1_family_name = 'Jaskolski' || ?T1_family_name = 'Langosh') . }",SELECT ?T1_date_of_latest_logon WHERE { ?T1 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/date_of_latest_logon> ?T1_date_of_latest_logon . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . FILTER(?T1_family_name = 'Jaskolski' || ?T1_family_name = 'Langosh') . }
Find the number of students who have the word 'son' in their personal names.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T1 :personal_name ?T1_personal_name . FILTER(contains (?T1_personal_name, 'son')) . }","SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . FILTER(contains (?T1_personal_name, 'son')) . }"
List all the subject names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_subject_name WHERE { ?T1 a :subjects . ?T1 :subject_name ?T1_subject_name . }",SELECT ?T1_subject_name WHERE { ?T1 a <http://valuenet/ontop/subjects> . ?T1 <http://valuenet/ontop/subject_name> ?T1_subject_name . }
List all the information about course authors and tutors in alphabetical order of the personal name.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :course_authors_and_tutors . ?T1 :personal_name ?T1_personal_name . } ORDER BY ASC (?T1_personal_name)",SELECT * WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . } ORDER BY ASC (?T1_personal_name)
List the personal names and family names of all the students in alphabetical order of family name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_personal_name ?T1_family_name WHERE { ?T1 a :students . ?T1 :personal_name ?T1_personal_name . ?T1 :family_name ?T1_family_name . ?T1 :family_name ?T1_family_name . } ORDER BY ASC (?T1_family_name)",SELECT ?T1_personal_name ?T1_family_name WHERE { ?T1 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . } ORDER BY ASC (?T1_family_name)
List each test result and its count in descending order of count.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_test_result (count( *) as ?aggregation_all) WHERE { ?T1 a :student_tests_taken . ?T1 :test_result ?T1_test_result . } GROUP BY ?T1_test_result ORDER BY DESC (count( *) )",SELECT ?T1_test_result (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/student_tests_taken> . ?T1 <http://valuenet/ontop/test_result> ?T1_test_result . } GROUP BY ?T1_test_result ORDER BY DESC (count( *) )
Find the login name of the course author that teaches the course with name 'advanced database'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_login_name WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :ref-author ?T1 . ?T1 :login_name ?T1_login_name . ?T2 :course_name ?T2_course_name . FILTER(?T2_course_name = 'advanced database') . }",SELECT ?T1_login_name WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T2 a <http://valuenet/ontop/courses> . ?T2 <http://valuenet/ontop/ref-author> ?T1 . ?T1 <http://valuenet/ontop/login_name> ?T1_login_name . ?T2 <http://valuenet/ontop/course_name> ?T2_course_name . FILTER(?T2_course_name = 'advanced database') . }
Find the addresses of the course authors who teach the course with name 'operating system' or 'data structure'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address_line_1 WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :ref-author ?T1 . ?T1 :address_line_1 ?T1_address_line_1 . ?T2 :course_name ?T2_course_name . ?T2 :course_name ?T2_course_name . FILTER(?T2_course_name = 'operating system' || ?T2_course_name = 'data structure') . }",SELECT ?T1_address_line_1 WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T2 a <http://valuenet/ontop/courses> . ?T2 <http://valuenet/ontop/ref-author> ?T1 . ?T1 <http://valuenet/ontop/address_line_1> ?T1_address_line_1 . ?T2 <http://valuenet/ontop/course_name> ?T2_course_name . ?T2 <http://valuenet/ontop/course_name> ?T2_course_name . FILTER(?T2_course_name = 'operating system' || ?T2_course_name = 'data structure') . }
"Find the personal name, family name, and author ID of the course author that teaches the most courses.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_personal_name (count( *) as ?aggregation_all) ?T1_family_name ?T2_author_id WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :ref-author ?T1 . ?T1 :personal_name ?T1_personal_name . ?T1 :family_name ?T1_family_name . ?T2 :author_id ?T2_author_id . } GROUP BY ?T1_personal_name ?T1_family_name ?T2_author_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_personal_name (count( *) as ?aggregation_all) ?T1_family_name ?T2_author_id WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T2 a <http://valuenet/ontop/courses> . ?T2 <http://valuenet/ontop/ref-author> ?T1 . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . ?T1 <http://valuenet/ontop/family_name> ?T1_family_name . ?T2 <http://valuenet/ontop/author_id> ?T2_author_id . } GROUP BY ?T1_personal_name ?T1_family_name ?T2_author_id ORDER BY DESC (?aggregation_all) LIMIT 1
Find the addresses and author IDs of the course authors that teach at least two courses.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_address_line_1 ?T2_author_id WHERE { ?T1 a :course_authors_and_tutors . ?T2 a :courses . ?T2 :ref-author ?T1 . ?T1 :address_line_1 ?T1_address_line_1 . ?T2 :author_id ?T2_author_id . } GROUP BY ?T1_address_line_1 ?T2_author_id HAVING(count( *) >= 2)",SELECT ?T1_address_line_1 ?T2_author_id WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T2 a <http://valuenet/ontop/courses> . ?T2 <http://valuenet/ontop/ref-author> ?T1 . ?T1 <http://valuenet/ontop/address_line_1> ?T1_address_line_1 . ?T2 <http://valuenet/ontop/author_id> ?T2_author_id . } GROUP BY ?T1_address_line_1 ?T2_author_id HAVING(count( *) >= 2)
Find the names of courses taught by the tutor who has personal name 'Julio'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :course_authors_and_tutors . ?T1 :ref-author ?T2 . ?T1 :course_name ?T1_course_name . ?T2 :personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Julio') . }",SELECT ?T1_course_name WHERE { ?T1 a <http://valuenet/ontop/courses> . ?T2 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/ref-author> ?T2 . ?T1 <http://valuenet/ontop/course_name> ?T1_course_name . ?T2 <http://valuenet/ontop/personal_name> ?T2_personal_name . FILTER(?T2_personal_name = 'Julio') . }
Find the names and descriptions of courses that belong to the subject named 'Computer Science'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_course_name ?T1_course_description WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :ref-subject ?T2 . ?T1 :course_name ?T1_course_name . ?T1 :course_description ?T1_course_description . ?T2 :subject_name ?T2_subject_name . FILTER(?T2_subject_name = 'Computer Science') . }",SELECT ?T1_course_name ?T1_course_description WHERE { ?T1 a <http://valuenet/ontop/courses> . ?T2 a <http://valuenet/ontop/subjects> . ?T1 <http://valuenet/ontop/ref-subject> ?T2 . ?T1 <http://valuenet/ontop/course_name> ?T1_course_name . ?T1 <http://valuenet/ontop/course_description> ?T1_course_description . ?T2 <http://valuenet/ontop/subject_name> ?T2_subject_name . FILTER(?T2_subject_name = 'Computer Science') . }
"Find the subject ID, subject name, and the corresponding number of available courses for each subject.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_subject_id ?T2_subject_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :subjects . ?T1 :ref-subject ?T2 . ?T1 :subject_id ?T1_subject_id . ?T2 :subject_name ?T2_subject_name . } GROUP BY ?T1_subject_id ?T2_subject_name",SELECT ?T1_subject_id ?T2_subject_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/courses> . ?T2 a <http://valuenet/ontop/subjects> . ?T1 <http://valuenet/ontop/ref-subject> ?T2 . ?T1 <http://valuenet/ontop/subject_id> ?T1_subject_id . ?T2 <http://valuenet/ontop/subject_name> ?T2_subject_name . } GROUP BY ?T1_subject_id ?T2_subject_name
Find the the date of enrollment of the 'Spanish' course.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :courses . ?T1 :ref-course ?T2 . ?T1 :date_of_enrolment ?T1_date_of_enrolment . ?T2 :course_name ?T2_course_name . FILTER(?T2_course_name = 'Spanish') . }",SELECT ?T1_date_of_enrolment WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/courses> . ?T1 <http://valuenet/ontop/ref-course> ?T2 . ?T1 <http://valuenet/ontop/date_of_enrolment> ?T1_date_of_enrolment . ?T2 <http://valuenet/ontop/course_name> ?T2_course_name . FILTER(?T2_course_name = 'Spanish') . }
Which course is enrolled in by the most students? Give me the course name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :ref-course ?T1 . ?T1 :course_name ?T1_course_name . } GROUP BY ?T1_course_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_course_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/courses> . ?T2 a <http://valuenet/ontop/student_course_enrolment> . ?T2 <http://valuenet/ontop/ref-course> ?T1 . ?T1 <http://valuenet/ontop/course_name> ?T1_course_name . } GROUP BY ?T1_course_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the names of the courses that have just one student enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :ref-course ?T1 . ?T1 :course_name ?T1_course_name . } GROUP BY ?T1_course_name HAVING(count( *) = 1)",SELECT ?T1_course_name WHERE { ?T1 a <http://valuenet/ontop/courses> . ?T2 a <http://valuenet/ontop/student_course_enrolment> . ?T2 <http://valuenet/ontop/ref-course> ?T1 . ?T1 <http://valuenet/ontop/course_name> ?T1_course_name . } GROUP BY ?T1_course_name HAVING(count( *) = 1)
Return the descriptions and names of the courses that have more than two students enrolled in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_course_description ?T1_course_name WHERE { ?T1 a :courses . ?T2 a :student_course_enrolment . ?T2 :ref-course ?T1 . ?T1 :course_description ?T1_course_description . ?T1 :course_name ?T1_course_name . } GROUP BY ?T1_course_description ?T1_course_name HAVING(count( *) > 2)",SELECT ?T1_course_description ?T1_course_name WHERE { ?T1 a <http://valuenet/ontop/courses> . ?T2 a <http://valuenet/ontop/student_course_enrolment> . ?T2 <http://valuenet/ontop/ref-course> ?T1 . ?T1 <http://valuenet/ontop/course_description> ?T1_course_description . ?T1 <http://valuenet/ontop/course_name> ?T1_course_name . } GROUP BY ?T1_course_description ?T1_course_name HAVING(count( *) > 2)
Find the enrollment date for all the tests that have 'Pass' result.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_enrolment WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :ref-registration ?T1 . ?T1 :date_of_enrolment ?T1_date_of_enrolment . ?T2 :test_result ?T2_test_result . FILTER(?T2_test_result = 'Pass') . }",SELECT ?T1_date_of_enrolment WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/student_tests_taken> . ?T2 <http://valuenet/ontop/ref-registration> ?T1 . ?T1 <http://valuenet/ontop/date_of_enrolment> ?T1_date_of_enrolment . ?T2 <http://valuenet/ontop/test_result> ?T2_test_result . FILTER(?T2_test_result = 'Pass') . }
Return the completion date for all the tests that have 'Fail' result.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :student_tests_taken . ?T2 :ref-registration ?T1 . ?T1 :date_of_completion ?T1_date_of_completion . ?T2 :test_result ?T2_test_result . FILTER(?T2_test_result = 'Fail') . }",SELECT ?T1_date_of_completion WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/student_tests_taken> . ?T2 <http://valuenet/ontop/ref-registration> ?T1 . ?T1 <http://valuenet/ontop/date_of_completion> ?T1_date_of_completion . ?T2 <http://valuenet/ontop/test_result> ?T2_test_result . FILTER(?T2_test_result = 'Fail') . }
List the dates of enrollment and completion of the student with personal name 'Karson'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :ref-student ?T2 . ?T1 :date_of_enrolment ?T1_date_of_enrolment . ?T1 :date_of_completion ?T1_date_of_completion . ?T2 :personal_name ?T2_personal_name . FILTER(?T2_personal_name = 'Karson') . }",SELECT ?T1_date_of_enrolment ?T1_date_of_completion WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/ref-student> ?T2 . ?T1 <http://valuenet/ontop/date_of_enrolment> ?T1_date_of_enrolment . ?T1 <http://valuenet/ontop/date_of_completion> ?T1_date_of_completion . ?T2 <http://valuenet/ontop/personal_name> ?T2_personal_name . FILTER(?T2_personal_name = 'Karson') . }
Find the student ID and login name of the student with the most course enrollments,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_login_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :ref-student ?T2 . ?T1 :student_id ?T1_student_id . ?T2 :login_name ?T2_login_name . } GROUP BY ?T1_student_id ?T2_login_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_student_id (count( *) as ?aggregation_all) ?T2_login_name WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/ref-student> ?T2 . ?T1 <http://valuenet/ontop/student_id> ?T1_student_id . ?T2 <http://valuenet/ontop/login_name> ?T2_login_name . } GROUP BY ?T1_student_id ?T2_login_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the student ID and personal name of the student with at least two enrollments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_student_id ?T2_personal_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :ref-student ?T2 . ?T1 :student_id ?T1_student_id . ?T2 :personal_name ?T2_personal_name . } GROUP BY ?T1_student_id ?T2_personal_name HAVING(count( *) >= 2)",SELECT ?T1_student_id ?T2_personal_name WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/ref-student> ?T2 . ?T1 <http://valuenet/ontop/student_id> ?T1_student_id . ?T2 <http://valuenet/ontop/personal_name> ?T2_personal_name . } GROUP BY ?T1_student_id ?T2_personal_name HAVING(count( *) >= 2)
Find the student ID and middle name for all the students with at most two enrollments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_student_id ?T2_middle_name WHERE { ?T1 a :student_course_enrolment . ?T2 a :students . ?T1 :ref-student ?T2 . ?T1 :student_id ?T1_student_id . ?T2 :middle_name ?T2_middle_name . } GROUP BY ?T1_student_id ?T2_middle_name HAVING(count( *) <= 2)",SELECT ?T1_student_id ?T2_middle_name WHERE { ?T1 a <http://valuenet/ontop/student_course_enrolment> . ?T2 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/ref-student> ?T2 . ?T1 <http://valuenet/ontop/student_id> ?T1_student_id . ?T2 <http://valuenet/ontop/middle_name> ?T2_middle_name . } GROUP BY ?T1_student_id ?T2_middle_name HAVING(count( *) <= 2)
Find the personal names of students not enrolled in any course.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_personal_name as ?col1) WHERE { ?T1 a :students . ?T1 :personal_name ?T1_personal_name . }} MINUS {SELECT (?T2_personal_name as ?col1) WHERE { ?T2 a :students . ?T2 :personal_name ?T2_personal_name . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_personal_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . }} MINUS {SELECT (?T2_personal_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/students> . ?T2 <http://valuenet/ontop/personal_name> ?T2_personal_name . } } }
Count the number of students who did not enroll in any course.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :students . ?T1 :student_id ?T1_student_id . FILTER(?T1_student_id not in (?T22_student_id)) . {SELECT ?T22_student_id WHERE { ?T22 a :student_course_enrolment . ?T22 :student_id ?T22_student_id . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/students> . ?T1 <http://valuenet/ontop/student_id> ?T1_student_id . FILTER(?T1_student_id not in (?T22_student_id)) . {SELECT ?T22_student_id WHERE { ?T22 a <http://valuenet/ontop/student_course_enrolment> . ?T22 <http://valuenet/ontop/student_id> ?T22_student_id . } } }
Find the common login name of course authors and students.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_login_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :login_name ?T1_login_name . FILTER (?T1_login_name in (?T2_login_name)) . ?T2 a :students . ?T2 :login_name ?T2_login_name . }",SELECT DISTINCT ?T1_login_name WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/login_name> ?T1_login_name . FILTER (?T1_login_name in (?T2_login_name)) . ?T2 a <http://valuenet/ontop/students> . ?T2 <http://valuenet/ontop/login_name> ?T2_login_name . }
Find the common personal name of course authors and students.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_personal_name WHERE { ?T1 a :course_authors_and_tutors . ?T1 :personal_name ?T1_personal_name . FILTER (?T1_personal_name in (?T2_personal_name)) . ?T2 a :students . ?T2 :personal_name ?T2_personal_name . }",SELECT DISTINCT ?T1_personal_name WHERE { ?T1 a <http://valuenet/ontop/course_authors_and_tutors> . ?T1 <http://valuenet/ontop/personal_name> ?T1_personal_name . FILTER (?T1_personal_name in (?T2_personal_name)) . ?T2 a <http://valuenet/ontop/students> . ?T2 <http://valuenet/ontop/personal_name> ?T2_personal_name . }
