nl_question,sparql_partial_uri,sparql_complete_uri
Count the total number of counties.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :county . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/county> . }
Show the county name and population of all counties.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name ?T1_population WHERE { ?T1 a :county . ?T1 :county_name ?T1_county_name . ?T1 :population ?T1_population . }",SELECT ?T1_county_name ?T1_population WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . ?T1 <http://valuenet/ontop/population> ?T1_population . }
Show the average population of all counties.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_population) as ?aggregation_T1_population_22 ) WHERE { ?T1 a :county . ?T1 :population ?T1_population . }",SELECT (avg( ?T1_population) as ?aggregation_T1_population_22 ) WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/population> ?T1_population . }
Return the maximum and minimum population among all counties.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_population) as ?aggregation_T1_population_80 ) (min( ?T1_population) as ?aggregation_T1_population_182 ) WHERE { ?T1 a :county . ?T1 :population ?T1_population . ?T1 :population ?T1_population . }",SELECT (max( ?T1_population) as ?aggregation_T1_population_80 ) (min( ?T1_population) as ?aggregation_T1_population_182 ) WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/population> ?T1_population . ?T1 <http://valuenet/ontop/population> ?T1_population . }
Show all the distinct districts for elections.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_district WHERE { ?T1 a :election . ?T1 :district ?T1_district . }",SELECT DISTINCT ?T1_district WHERE { ?T1 a <http://valuenet/ontop/election> . ?T1 <http://valuenet/ontop/district> ?T1_district . }
Show the zip code of the county with name 'Howard'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_zip_code WHERE { ?T1 a :county . ?T1 :zip_code ?T1_zip_code . ?T1 :county_name ?T1_county_name . FILTER(?T1_county_name = 'Howard') . }",SELECT ?T1_zip_code WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/zip_code> ?T1_zip_code . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . FILTER(?T1_county_name = 'Howard') . }
Show the delegate from district 1 in election.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_delegate WHERE { ?T1 a :election . ?T1 :delegate ?T1_delegate . ?T1 :district ?T1_district . FILTER(?T1_district = 1) . }",SELECT ?T1_delegate WHERE { ?T1 a <http://valuenet/ontop/election> . ?T1 <http://valuenet/ontop/delegate> ?T1_delegate . ?T1 <http://valuenet/ontop/district> ?T1_district . FILTER(?T1_district = 1) . }
Show the delegate and committee information of elections.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_delegate ?T1_committee WHERE { ?T1 a :election . ?T1 :delegate ?T1_delegate . ?T1 :committee ?T1_committee . }",SELECT ?T1_delegate ?T1_committee WHERE { ?T1 a <http://valuenet/ontop/election> . ?T1 <http://valuenet/ontop/delegate> ?T1_delegate . ?T1 <http://valuenet/ontop/committee> ?T1_committee . }
Count the number of distinct governors.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_governor) as ?aggregation_T1_governor_29 ) WHERE { ?T1 a :party . ?T1 :governor ?T1_governor . }",SELECT DISTINCT (count(DISTINCT ?T1_governor) as ?aggregation_T1_governor_29 ) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/governor> ?T1_governor . }
Show the lieutenant governor and comptroller from the democratic party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lieutenant_governor ?T1_comptroller WHERE { ?T1 a :party . ?T1 :lieutenant_governor ?T1_lieutenant_governor . ?T1 :comptroller ?T1_comptroller . ?T1 :party-party ?T1_party . FILTER(?T1_party = 'Democratic') . }",SELECT ?T1_lieutenant_governor ?T1_comptroller WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/lieutenant_governor> ?T1_lieutenant_governor . ?T1 <http://valuenet/ontop/comptroller> ?T1_comptroller . ?T1 <http://valuenet/ontop/party-party> ?T1_party . FILTER(?T1_party = 'Democratic') . }
Find the distinct years when the governor was named 'Eliot Spitzer'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_year WHERE { ?T1 a :party . ?T1 :year ?T1_year . ?T1 :governor ?T1_governor . FILTER(?T1_governor = 'Eliot Spitzer') . }",SELECT DISTINCT ?T1_year WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/governor> ?T1_governor . FILTER(?T1_governor = 'Eliot Spitzer') . }
Show all the information about election.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :election . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/election> . }
Show the delegates and the names of county they belong to.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_delegate ?T2_county_name WHERE { ?T1 a :election . ?T2 a :county . ?T1 :ref-district ?T2 . ?T1 :delegate ?T1_delegate . ?T2 :county_name ?T2_county_name . }",SELECT ?T1_delegate ?T2_county_name WHERE { ?T1 a <http://valuenet/ontop/election> . ?T2 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/ref-district> ?T2 . ?T1 <http://valuenet/ontop/delegate> ?T1_delegate . ?T2 <http://valuenet/ontop/county_name> ?T2_county_name . }
Find the delegates who are from counties with population below 100000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_delegate WHERE { ?T1 a :election . ?T2 a :county . ?T1 :ref-district ?T2 . ?T1 :delegate ?T1_delegate . ?T2 :population ?T2_population . FILTER(?T2_population < 100000) . }",SELECT ?T1_delegate WHERE { ?T1 a <http://valuenet/ontop/election> . ?T2 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/ref-district> ?T2 . ?T1 <http://valuenet/ontop/delegate> ?T1_delegate . ?T2 <http://valuenet/ontop/population> ?T2_population . FILTER(?T2_population < 100000) . }
Count the number of distinct delegates who are from counties with population above 50000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_delegate) as ?aggregation_T1_delegate_93 ) WHERE { ?T1 a :election . ?T2 a :county . ?T1 :ref-district ?T2 . ?T1 :delegate ?T1_delegate . ?T2 :population ?T2_population . FILTER(?T2_population > 50000) . }",SELECT DISTINCT (count(DISTINCT ?T1_delegate) as ?aggregation_T1_delegate_93 ) WHERE { ?T1 a <http://valuenet/ontop/election> . ?T2 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/ref-district> ?T2 . ?T1 <http://valuenet/ontop/delegate> ?T1_delegate . ?T2 <http://valuenet/ontop/population> ?T2_population . FILTER(?T2_population > 50000) . }
Which county do the delegates on 'Appropriations' committee belong to? Give me the county names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name WHERE { ?T1 a :county . ?T2 a :election . ?T2 :ref-district ?T1 . ?T1 :county_name ?T1_county_name . ?T2 :committee ?T2_committee . FILTER(?T2_committee = 'Appropriations') . }",SELECT ?T1_county_name WHERE { ?T1 a <http://valuenet/ontop/county> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-district> ?T1 . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . ?T2 <http://valuenet/ontop/committee> ?T2_committee . FILTER(?T2_committee = 'Appropriations') . }
Show the delegates and the names of the party they belong to.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_delegate ?T2_party WHERE { ?T1 a :election . ?T2 a :party . ?T1 :ref-party ?T2 . ?T1 :delegate ?T1_delegate . ?T2 :party-party ?T2_party . }",SELECT ?T1_delegate ?T2_party WHERE { ?T1 a <http://valuenet/ontop/election> . ?T2 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/ref-party> ?T2 . ?T1 <http://valuenet/ontop/delegate> ?T1_delegate . ?T2 <http://valuenet/ontop/party-party> ?T2_party . }
Return all the committees that have delegates from Democratic party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_committee WHERE { ?T1 a :election . ?T2 a :party . ?T1 :ref-party ?T2 . ?T1 :committee ?T1_committee . ?T2 :party-party ?T2_party . FILTER(?T2_party = 'Democratic') . }",SELECT ?T1_committee WHERE { ?T1 a <http://valuenet/ontop/election> . ?T2 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/ref-party> ?T2 . ?T1 <http://valuenet/ontop/committee> ?T1_committee . ?T2 <http://valuenet/ontop/party-party> ?T2_party . FILTER(?T2_party = 'Democratic') . }
Show the name of each county along with the corresponding number of delegates from that county.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name (count( *) as ?aggregation_all) WHERE { ?T1 a :county . ?T2 a :election . ?T2 :ref-district ?T1 . ?T1 :county_name ?T1_county_name . } GROUP BY ?T1_county_name",SELECT ?T1_county_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/county> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-district> ?T1 . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . } GROUP BY ?T1_county_name
Show the name of each party and the corresponding number of delegates from that party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :election . ?T2 :ref-party ?T1 . ?T1 :party-party ?T1_party . } GROUP BY ?T1_party",SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/party-party> ?T1_party . } GROUP BY ?T1_party
Return the names of all counties sorted by population in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county_name ?T1_county_name . ?T1 :population ?T1_population . } ORDER BY ASC (?T1_population)",SELECT ?T1_county_name WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY ASC (?T1_population)
Return the names of all counties sorted by county name in descending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county_name ?T1_county_name . ?T1 :county_name ?T1_county_name . } ORDER BY DESC (?T1_county_name)",SELECT ?T1_county_name WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . } ORDER BY DESC (?T1_county_name)
Show the name of the county with the biggest population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county_name ?T1_county_name . ?T1 :population ?T1_population . } ORDER BY DESC (?T1_population) LIMIT 1",SELECT ?T1_county_name WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY DESC (?T1_population) LIMIT 1
Show the 3 counties with the smallest population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name WHERE { ?T1 a :county . ?T1 :county_name ?T1_county_name . ?T1 :population ?T1_population . } ORDER BY ASC (?T1_population) LIMIT 1",SELECT ?T1_county_name WHERE { ?T1 a <http://valuenet/ontop/county> . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY ASC (?T1_population) LIMIT 1
Show the names of counties that have at least two delegates.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county_name WHERE { ?T1 a :county . ?T2 a :election . ?T2 :ref-district ?T1 . ?T1 :county_name ?T1_county_name . } GROUP BY ?T1_county_name HAVING(count( *) >= 2)",SELECT ?T1_county_name WHERE { ?T1 a <http://valuenet/ontop/county> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-district> ?T1 . ?T1 <http://valuenet/ontop/county_name> ?T1_county_name . } GROUP BY ?T1_county_name HAVING(count( *) >= 2)
Show the name of the party that has at least two records.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party WHERE { ?T1 a :party . ?T1 :party-party ?T1_party . } GROUP BY ?T1_party HAVING(count( *) >= 2)",SELECT ?T1_party WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/party-party> ?T1_party . } GROUP BY ?T1_party HAVING(count( *) >= 2)
Show the people that have been governor the most times.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_governor (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T1 :governor ?T1_governor . } GROUP BY ?T1_governor ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_governor (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/governor> ?T1_governor . } GROUP BY ?T1_governor ORDER BY DESC (?aggregation_all) LIMIT 1
What are the names of parties that have both delegates on 'Appropriations' committee and,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_party WHERE { ?T1 a :party . ?T2 a :election . ?T2 :ref-party ?T1 . ?T1 :party-party ?T1_party . ?T2 :committee ?T2_committee . FILTER(?T2_committee = 'Appropriations') . FILTER (?T1_party in (?T3_party)) . ?T3 a :party . ?T4 a :election . ?T4 :ref-party ?T3 . ?T3 :party-party ?T3_party . ?T4 :committee ?T4_committee . FILTER(?T4_committee = 'Economic Matters') . }",SELECT DISTINCT ?T1_party WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/party-party> ?T1_party . ?T2 <http://valuenet/ontop/committee> ?T2_committee . FILTER(?T2_committee = 'Appropriations') . FILTER (?T1_party in (?T3_party)) . ?T3 a <http://valuenet/ontop/party> . ?T4 a <http://valuenet/ontop/election> . ?T4 <http://valuenet/ontop/ref-party> ?T3 . ?T3 <http://valuenet/ontop/party-party> ?T3_party . ?T4 <http://valuenet/ontop/committee> ?T4_committee . FILTER(?T4_committee = 'Economic Matters') . }
Find the committees that have delegates both from from the democratic party and the liberal party.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_committee WHERE { ?T1 a :election . ?T2 a :party . ?T1 :ref-party ?T2 . ?T1 :committee ?T1_committee . ?T2 :party-party ?T2_party . FILTER(?T2_party = 'Democratic') . FILTER (?T1_committee in (?T3_committee)) . ?T3 a :election . ?T4 a :party . ?T3 :ref-party ?T4 . ?T3 :committee ?T3_committee . ?T4 :party-party ?T4_party . FILTER(?T4_party = 'Liberal') . }",SELECT DISTINCT ?T1_committee WHERE { ?T1 a <http://valuenet/ontop/election> . ?T2 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/ref-party> ?T2 . ?T1 <http://valuenet/ontop/committee> ?T1_committee . ?T2 <http://valuenet/ontop/party-party> ?T2_party . FILTER(?T2_party = 'Democratic') . FILTER (?T1_committee in (?T3_committee)) . ?T3 a <http://valuenet/ontop/election> . ?T4 a <http://valuenet/ontop/party> . ?T3 <http://valuenet/ontop/ref-party> ?T4 . ?T3 <http://valuenet/ontop/committee> ?T3_committee . ?T4 <http://valuenet/ontop/party-party> ?T4_party . FILTER(?T4_party = 'Liberal') . }
