nl_question,sparql_partial_uri,sparql_complete_uri
List the votes of elections in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_votes WHERE { ?T1 a :election . ?T1 :votes ?T1_votes . ?T1 :votes ?T1_votes . } ORDER BY DESC (?T1_votes)",SELECT ?T1_votes WHERE { ?T1 a <http://valuenet/ontop/election> . ?T1 <http://valuenet/ontop/votes> ?T1_votes . ?T1 <http://valuenet/ontop/votes> ?T1_votes . } ORDER BY DESC (?T1_votes)
List the dates and vote percents of elections.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date ?T1_vote_percent WHERE { ?T1 a :election . ?T1 :date ?T1_date . ?T1 :vote_percent ?T1_vote_percent . }",SELECT ?T1_date ?T1_vote_percent WHERE { ?T1 a <http://valuenet/ontop/election> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/vote_percent> ?T1_vote_percent . }
What are the names of representatives and the dates of elections they participated in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_date WHERE { ?T1 a :representative . ?T2 a :election . ?T2 :ref-representative ?T1 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . }",SELECT ?T1_name ?T2_date WHERE { ?T1 a <http://valuenet/ontop/representative> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-representative> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . }
What is the party of the representative that has the smallest number of votes.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party WHERE { ?T1 a :representative . ?T2 a :election . ?T2 :ref-representative ?T1 . ?T1 :party ?T1_party . ?T2 :votes ?T2_votes . } ORDER BY ASC (?T2_votes) LIMIT 1",SELECT ?T1_party WHERE { ?T1 a <http://valuenet/ontop/representative> . ?T2 a <http://valuenet/ontop/election> . ?T2 <http://valuenet/ontop/ref-representative> ?T1 . ?T1 <http://valuenet/ontop/party> ?T1_party . ?T2 <http://valuenet/ontop/votes> ?T2_votes . } ORDER BY ASC (?T2_votes) LIMIT 1
What are the different parties of representative? Show the party name and the number of representatives in each party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :representative . ?T1 :party ?T1_party . } GROUP BY ?T1_party",SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/representative> . ?T1 <http://valuenet/ontop/party> ?T1_party . } GROUP BY ?T1_party
List the names of representatives that have not participated in elections listed here.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :representative . ?T1 :name ?T1_name . ?T1 :representative_id ?T1_representative_id . FILTER(?T1_representative_id not in (?T22_representative_id)) . {SELECT ?T22_representative_id WHERE { ?T22 a :election . ?T22 :representative_id ?T22_representative_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/representative> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/representative_id> ?T1_representative_id . FILTER(?T1_representative_id not in (?T22_representative_id)) . {SELECT ?T22_representative_id WHERE { ?T22 a <http://valuenet/ontop/election> . ?T22 <http://valuenet/ontop/representative_id> ?T22_representative_id . } } }
Show the parties that have both representatives in New York state and representatives in Pennsylvania state.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_party WHERE { ?T1 a :representative . ?T1 :party ?T1_party . ?T1 :state ?T1_state . FILTER(?T1_state = 'New York') . FILTER (?T1_party in (?T2_party)) . ?T2 a :representative . ?T2 :party ?T2_party . ?T2 :state ?T2_state . FILTER(?T2_state = 'Pennsylvania') . }",SELECT DISTINCT ?T1_party WHERE { ?T1 a <http://valuenet/ontop/representative> . ?T1 <http://valuenet/ontop/party> ?T1_party . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_state = 'New York') . FILTER (?T1_party in (?T2_party)) . ?T2 a <http://valuenet/ontop/representative> . ?T2 <http://valuenet/ontop/party> ?T2_party . ?T2 <http://valuenet/ontop/state> ?T2_state . FILTER(?T2_state = 'Pennsylvania') . }
