nl_question,sparql_partial_uri,sparql_complete_uri
List the name of artworks in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artwork . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
List the name of artworks whose type is not 'Program Talent Show'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artwork . ?T1 :name ?T1_name . ?T1 :type ?T1_type . FILTER(?T1_type != 'Program Talent Show') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/type> ?T1_type . FILTER(?T1_type != 'Program Talent Show') . }
Show the names of the three most recent festivals.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_festival_name WHERE { ?T1 a :festival_detail . ?T1 :festival_name ?T1_festival_name . ?T1 :year ?T1_year . } ORDER BY DESC (?T1_year) LIMIT 1",SELECT ?T1_festival_name WHERE { ?T1 a <http://valuenet/ontop/festival_detail> . ?T1 <http://valuenet/ontop/festival_name> ?T1_festival_name . ?T1 <http://valuenet/ontop/year> ?T1_year . } ORDER BY DESC (?T1_year) LIMIT 1
"For each nomination, show the name of the artwork and name of the festival where it is nominated.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_festival_name WHERE { ?T1 a :artwork . ?T13 a :nomination . ?T13 :ref-artwork ?T1 . ?T1 :name ?T1_name . ?T2 :festival_name ?T2_festival_name . ?T2 a :festival_detail . ?T13 :ref-festival ?T2 . ?T1 :name ?T1_name . ?T2 :festival_name ?T2_festival_name . }",SELECT ?T1_name ?T2_festival_name WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T13 a <http://valuenet/ontop/nomination> . ?T13 <http://valuenet/ontop/ref-artwork> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/festival_name> ?T2_festival_name . ?T2 a <http://valuenet/ontop/festival_detail> . ?T13 <http://valuenet/ontop/ref-festival> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/festival_name> ?T2_festival_name . }
Show distinct types of artworks that are nominated in festivals in 2007.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_type WHERE { ?T1 a :artwork . ?T13 a :nomination . ?T13 :ref-artwork ?T1 . ?T1 :type ?T1_type . ?T2 :year ?T2_year . ?T2 a :festival_detail . ?T13 :ref-festival ?T2 . ?T1 :type ?T1_type . ?T2 :year ?T2_year . FILTER(?T2_year = 2007) . }",SELECT DISTINCT ?T1_type WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T13 a <http://valuenet/ontop/nomination> . ?T13 <http://valuenet/ontop/ref-artwork> ?T1 . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T2 <http://valuenet/ontop/year> ?T2_year . ?T2 a <http://valuenet/ontop/festival_detail> . ?T13 <http://valuenet/ontop/ref-festival> ?T2 . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year = 2007) . }
Show the names of artworks in ascending order of the year they are nominated in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artwork . ?T13 a :nomination . ?T13 :ref-artwork ?T1 . ?T1 :name ?T1_name . ?T2 :year ?T2_year . ?T2 a :festival_detail . ?T13 :ref-festival ?T2 . ?T1 :name ?T1_name . ?T2 :year ?T2_year . } ORDER BY ASC (?T2_year)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T13 a <http://valuenet/ontop/nomination> . ?T13 <http://valuenet/ontop/ref-artwork> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/year> ?T2_year . ?T2 a <http://valuenet/ontop/festival_detail> . ?T13 <http://valuenet/ontop/ref-festival> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/year> ?T2_year . } ORDER BY ASC (?T2_year)
Show the names of festivals that have nominated artworks of type 'Program Talent Show'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_festival_name WHERE { ?T1 a :festival_detail . ?T13 a :nomination . ?T13 :ref-festival ?T1 . ?T1 :festival_name ?T1_festival_name . ?T2 :type ?T2_type . ?T2 a :artwork . ?T13 :ref-artwork ?T2 . ?T1 :festival_name ?T1_festival_name . ?T2 :type ?T2_type . FILTER(?T2_type = 'Program Talent Show') . }",SELECT ?T1_festival_name WHERE { ?T1 a <http://valuenet/ontop/festival_detail> . ?T13 a <http://valuenet/ontop/nomination> . ?T13 <http://valuenet/ontop/ref-festival> ?T1 . ?T1 <http://valuenet/ontop/festival_name> ?T1_festival_name . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T2 a <http://valuenet/ontop/artwork> . ?T13 <http://valuenet/ontop/ref-artwork> ?T2 . ?T1 <http://valuenet/ontop/festival_name> ?T1_festival_name . ?T2 <http://valuenet/ontop/type> ?T2_type . FILTER(?T2_type = 'Program Talent Show') . }
Show the ids and names of festivals that have at least two nominations for artworks.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_festival_id ?T2_festival_name WHERE { ?T1 a :nomination . ?T2 a :festival_detail . ?T1 :ref-festival ?T2 . ?T1 :festival_id ?T1_festival_id . ?T2 :festival_name ?T2_festival_name . } GROUP BY ?T1_festival_id ?T2_festival_name HAVING(count( *) >= 2)",SELECT ?T1_festival_id ?T2_festival_name WHERE { ?T1 a <http://valuenet/ontop/nomination> . ?T2 a <http://valuenet/ontop/festival_detail> . ?T1 <http://valuenet/ontop/ref-festival> ?T2 . ?T1 <http://valuenet/ontop/festival_id> ?T1_festival_id . ?T2 <http://valuenet/ontop/festival_name> ?T2_festival_name . } GROUP BY ?T1_festival_id ?T2_festival_name HAVING(count( *) >= 2)
"Show the id, name of each festival and the number of artworks it has nominated.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_festival_id ?T2_festival_name (count( *) as ?aggregation_all) WHERE { ?T1 a :nomination . ?T2 a :festival_detail . ?T1 :ref-festival ?T2 . ?T1 :festival_id ?T1_festival_id . ?T2 :festival_name ?T2_festival_name . } GROUP BY ?T1_festival_id ?T2_festival_name",SELECT ?T1_festival_id ?T2_festival_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/nomination> . ?T2 a <http://valuenet/ontop/festival_detail> . ?T1 <http://valuenet/ontop/ref-festival> ?T2 . ?T1 <http://valuenet/ontop/festival_id> ?T1_festival_id . ?T2 <http://valuenet/ontop/festival_name> ?T2_festival_name . } GROUP BY ?T1_festival_id ?T2_festival_name
Please show different types of artworks with the corresponding number of artworks of each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :artwork . ?T1 :type ?T1_type . } GROUP BY ?T1_type",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type
List the most common type of artworks.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :artwork . ?T1 :type ?T1_type . } GROUP BY ?T1_type ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type ORDER BY DESC (?aggregation_all) LIMIT 1
List the year in which there are more than one festivals.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_year WHERE { ?T1 a :festival_detail . ?T1 :year ?T1_year . } GROUP BY ?T1_year HAVING(count( *) > 1)",SELECT ?T1_year WHERE { ?T1 a <http://valuenet/ontop/festival_detail> . ?T1 <http://valuenet/ontop/year> ?T1_year . } GROUP BY ?T1_year HAVING(count( *) > 1)
List the name of artworks that are not nominated.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artwork . ?T1 :name ?T1_name . ?T1 :artwork_id ?T1_artwork_id . FILTER(?T1_artwork_id not in (?T22_artwork_id)) . {SELECT ?T22_artwork_id WHERE { ?T22 a :nomination . ?T22 :artwork_id ?T22_artwork_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artwork> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/artwork_id> ?T1_artwork_id . FILTER(?T1_artwork_id not in (?T22_artwork_id)) . {SELECT ?T22_artwork_id WHERE { ?T22 a <http://valuenet/ontop/nomination> . ?T22 <http://valuenet/ontop/artwork_id> ?T22_artwork_id . } } }
Show the number of audience in year 2008 or 2010.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_num_of_audience WHERE { ?T1 a :festival_detail . ?T1 :num_of_audience ?T1_num_of_audience . ?T1 :year ?T1_year . ?T1 :year ?T1_year . FILTER(?T1_year = 2008 || ?T1_year = 2010) . }",SELECT ?T1_num_of_audience WHERE { ?T1 a <http://valuenet/ontop/festival_detail> . ?T1 <http://valuenet/ontop/num_of_audience> ?T1_num_of_audience . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 2008 || ?T1_year = 2010) . }
