nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of entrepreneurs.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :entrepreneur . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . }
List the companies of entrepreneurs in descending order of money requested.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company WHERE { ?T1 a :entrepreneur . ?T1 :company ?T1_company . ?T1 :money_requested ?T1_money_requested . } ORDER BY DESC (?T1_money_requested)",SELECT ?T1_company WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/money_requested> ?T1_money_requested . } ORDER BY DESC (?T1_money_requested)
List the companies and the investors of entrepreneurs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company ?T1_investor WHERE { ?T1 a :entrepreneur . ?T1 :company ?T1_company . ?T1 :investor ?T1_investor . }",SELECT ?T1_company ?T1_investor WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/investor> ?T1_investor . }
Return the average money requested across all entrepreneurs.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_money_requested) as ?aggregation_T1_money_requested_164 ) WHERE { ?T1 a :entrepreneur . ?T1 :money_requested ?T1_money_requested . }",SELECT (avg( ?T1_money_requested) as ?aggregation_T1_money_requested_164 ) WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/money_requested> ?T1_money_requested . }
"Return the names of people, ordered by weight ascending.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :weight ?T1_weight . } ORDER BY ASC (?T1_weight)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/weight> ?T1_weight . } ORDER BY ASC (?T1_weight)
Return the names of entrepreneurs do no not have the investor Rachel Elnaugh.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :entrepreneur . ?T2 :ref-people ?T1 . ?T1 :name ?T1_name . ?T2 :investor ?T2_investor . FILTER(?T2_investor != 'Rachel Elnaugh') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/entrepreneur> . ?T2 <http://valuenet/ontop/ref-people> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/investor> ?T2_investor . FILTER(?T2_investor != 'Rachel Elnaugh') . }
Return the weight of the shortest person.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_weight WHERE { ?T1 a :people . ?T1 :weight ?T1_weight . ?T1 :height ?T1_height . } ORDER BY ASC (?T1_height) LIMIT 1",SELECT ?T1_weight WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/weight> ?T1_weight . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY ASC (?T1_height) LIMIT 1
Return the name of the heaviest entrepreneur.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :weight ?T1_weight . } ORDER BY DESC (?T1_weight) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/weight> ?T1_weight . } ORDER BY DESC (?T1_weight) LIMIT 1
Give the total money requested by entrepreneurs who are taller than 1.85.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_money_requested) as ?aggregation_T1_money_requested_78 ) WHERE { ?T1 a :entrepreneur . ?T2 a :people . ?T1 :ref-people ?T2 . ?T1 :money_requested ?T1_money_requested . ?T2 :height ?T2_height . FILTER(?T2_height > 1.85) . }",SELECT (sum( ?T1_money_requested) as ?aggregation_T1_money_requested_78 ) WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T2 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/ref-people> ?T2 . ?T1 <http://valuenet/ontop/money_requested> ?T1_money_requested . ?T2 <http://valuenet/ontop/height> ?T2_height . FILTER(?T2_height > 1.85) . }
Return the dates of birth for entrepreneurs who have either the investor Simon Woodroffe or Peter Jones.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_birth WHERE { ?T1 a :people . ?T2 a :entrepreneur . ?T2 :ref-people ?T1 . ?T1 :date_of_birth ?T1_date_of_birth . ?T2 :investor ?T2_investor . ?T2 :investor ?T2_investor . FILTER(?T2_investor = 'Simon Woodroffe' || ?T2_investor = 'Peter Jones') . }",SELECT ?T1_date_of_birth WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/entrepreneur> . ?T2 <http://valuenet/ontop/ref-people> ?T1 . ?T1 <http://valuenet/ontop/date_of_birth> ?T1_date_of_birth . ?T2 <http://valuenet/ontop/investor> ?T2_investor . ?T2 <http://valuenet/ontop/investor> ?T2_investor . FILTER(?T2_investor = 'Simon Woodroffe' || ?T2_investor = 'Peter Jones') . }
"Return the weights of entrepreneurs, ordered descending by amount of money requested.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_weight WHERE { ?T1 a :people . ?T2 a :entrepreneur . ?T2 :ref-people ?T1 . ?T1 :weight ?T1_weight . ?T2 :money_requested ?T2_money_requested . } ORDER BY DESC (?T2_money_requested)",SELECT ?T1_weight WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/entrepreneur> . ?T2 <http://valuenet/ontop/ref-people> ?T1 . ?T1 <http://valuenet/ontop/weight> ?T1_weight . ?T2 <http://valuenet/ontop/money_requested> ?T2_money_requested . } ORDER BY DESC (?T2_money_requested)
Return the investor who have invested in the greatest number of entrepreneurs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor (count( *) as ?aggregation_all) WHERE { ?T1 a :entrepreneur . ?T1 :investor ?T1_investor . } GROUP BY ?T1_investor ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_investor (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/investor> ?T1_investor . } GROUP BY ?T1_investor ORDER BY DESC (?aggregation_all) LIMIT 1
Return the investors who have invested in two or more entrepreneurs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor WHERE { ?T1 a :entrepreneur . ?T1 :investor ?T1_investor . } GROUP BY ?T1_investor HAVING(count( *) >= 2)",SELECT ?T1_investor WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/investor> ?T1_investor . } GROUP BY ?T1_investor HAVING(count( *) >= 2)
List the names of people that are not entrepreneurs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) . {SELECT ?T22_people_id WHERE { ?T22 a :entrepreneur . ?T22 :people_id ?T22_people_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/people_id> ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) . {SELECT ?T22_people_id WHERE { ?T22 a <http://valuenet/ontop/entrepreneur> . ?T22 <http://valuenet/ontop/people_id> ?T22_people_id . } } }
Show the investors shared by entrepreneurs that requested more than 140000 and entrepreneurs that requested less than 120000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_investor WHERE { ?T1 a :entrepreneur . ?T1 :investor ?T1_investor . ?T1 :money_requested ?T1_money_requested . FILTER(?T1_money_requested > 140000) . FILTER (?T1_investor in (?T2_investor)) . ?T2 a :entrepreneur . ?T2 :investor ?T2_investor . ?T2 :money_requested ?T2_money_requested . FILTER(?T2_money_requested < 120000) . }",SELECT DISTINCT ?T1_investor WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/investor> ?T1_investor . ?T1 <http://valuenet/ontop/money_requested> ?T1_money_requested . FILTER(?T1_money_requested > 140000) . FILTER (?T1_investor in (?T2_investor)) . ?T2 a <http://valuenet/ontop/entrepreneur> . ?T2 <http://valuenet/ontop/investor> ?T2_investor . ?T2 <http://valuenet/ontop/money_requested> ?T2_money_requested . FILTER(?T2_money_requested < 120000) . }
Count the number of different companies.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_company) as ?aggregation_T1_company_75 ) WHERE { ?T1 a :entrepreneur . ?T1 :company ?T1_company . }",SELECT DISTINCT (count(DISTINCT ?T1_company) as ?aggregation_T1_company_75 ) WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T1 <http://valuenet/ontop/company> ?T1_company . }
Show the company of the tallest entrepreneur.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company WHERE { ?T1 a :entrepreneur . ?T2 a :people . ?T1 :ref-people ?T2 . ?T1 :company ?T1_company . ?T2 :height ?T2_height . } ORDER BY DESC (?T2_height) LIMIT 1",SELECT ?T1_company WHERE { ?T1 a <http://valuenet/ontop/entrepreneur> . ?T2 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/ref-people> ?T2 . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T2 <http://valuenet/ontop/height> ?T2_height . } ORDER BY DESC (?T2_height) LIMIT 1
