nl_question,sparql_partial_uri,sparql_complete_uri
Find the id of the item whose title is 'orange'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_i_id WHERE { ?T1 a :item . ?T1 :i_id ?T1_i_id . ?T1 :title ?T1_title . FILTER(?T1_title = 'orange') . }",SELECT ?T1_i_id WHERE { ?T1 a <http://valuenet/ontop/item> . ?T1 <http://valuenet/ontop/i_id> ?T1_i_id . ?T1 <http://valuenet/ontop/title> ?T1_title . FILTER(?T1_title = 'orange') . }
List all information in the item table.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :item . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/item> . }
Find the number of reviews.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :review . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/review> . }
Find the average and maximum rating of all reviews.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_20 ) (max( ?T1_rating) as ?aggregation_T1_rating_63 ) WHERE { ?T1 a :review . ?T1 :rating ?T1_rating . ?T1 :rating ?T1_rating . }",SELECT (avg( ?T1_rating) as ?aggregation_T1_rating_20 ) (max( ?T1_rating) as ?aggregation_T1_rating_63 ) WHERE { ?T1 a <http://valuenet/ontop/review> . ?T1 <http://valuenet/ontop/rating> ?T1_rating . ?T1 <http://valuenet/ontop/rating> ?T1_rating . }
Find the highest rank of all reviews.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_rank) as ?aggregation_T1_rank_0 ) WHERE { ?T1 a :review . ?T1 :rank ?T1_rank . }",SELECT (min( ?T1_rank) as ?aggregation_T1_rank_0 ) WHERE { ?T1 a <http://valuenet/ontop/review> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . }
Find the number of items that did not receive any review.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :item . ?T1 :i_id ?T1_i_id . FILTER(?T1_i_id not in (?T22_i_id)) . {SELECT ?T22_i_id WHERE { ?T22 a :review . ?T22 :i_id ?T22_i_id . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/item> . ?T1 <http://valuenet/ontop/i_id> ?T1_i_id . FILTER(?T1_i_id not in (?T22_i_id)) . {SELECT ?T22_i_id WHERE { ?T22 a <http://valuenet/ontop/review> . ?T22 <http://valuenet/ontop/i_id> ?T22_i_id . } } }
Find the names of users who did not leave any review.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :useracct . ?T1 :name ?T1_name . ?T1 :u_id ?T1_u_id . FILTER(?T1_u_id not in (?T22_u_id)) . {SELECT ?T22_u_id WHERE { ?T22 a :review . ?T22 :u_id ?T22_u_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/u_id> ?T1_u_id . FILTER(?T1_u_id not in (?T22_u_id)) . {SELECT ?T22_u_id WHERE { ?T22 a <http://valuenet/ontop/review> . ?T22 <http://valuenet/ontop/u_id> ?T22_u_id . } } }
Find the names of goods that receive a rating of 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :ref-i ?T1 . ?T1 :title ?T1_title . ?T2 :rating ?T2_rating . FILTER(?T2_rating = 10) . }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/item> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-i> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/rating> ?T2_rating . FILTER(?T2_rating = 10) . }
Find the titles of items whose rating is higher than the average review rating of all items.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :ref-i ?T1 . ?T1 :title ?T1_title . ?T2 :rating ?T2_rating . FILTER(?T2_rating > (?aggregation_T23_rating_77)) . {SELECT (avg( ?T23_rating) as ?aggregation_T23_rating_77 ) WHERE { ?T23 a :review . ?T23 :rating ?T23_rating . } } }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/item> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-i> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/rating> ?T2_rating . FILTER(?T2_rating > (?aggregation_T23_rating_77)) . {SELECT (avg( ?T23_rating) as ?aggregation_T23_rating_77 ) WHERE { ?T23 a <http://valuenet/ontop/review> . ?T23 <http://valuenet/ontop/rating> ?T23_rating . } } }
Find the titles of items that received both a rating higher than 8 and a rating below 5.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :ref-i ?T1 . ?T1 :title ?T1_title . ?T2 :rating ?T2_rating . FILTER(?T2_rating > 8) . FILTER (?T1_title in (?T3_title)) . ?T3 a :item . ?T4 a :review . ?T4 :ref-i ?T3 . ?T3 :title ?T3_title . ?T4 :rating ?T4_rating . FILTER(?T4_rating < 5) . }",SELECT DISTINCT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/item> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-i> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/rating> ?T2_rating . FILTER(?T2_rating > 8) . FILTER (?T1_title in (?T3_title)) . ?T3 a <http://valuenet/ontop/item> . ?T4 a <http://valuenet/ontop/review> . ?T4 <http://valuenet/ontop/ref-i> ?T3 . ?T3 <http://valuenet/ontop/title> ?T3_title . ?T4 <http://valuenet/ontop/rating> ?T4_rating . FILTER(?T4_rating < 5) . }
Find the name of the item with the lowest average rating.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :item . ?T2 a :review . ?T2 :ref-i ?T1 . ?T1 :title ?T1_title . ?T2 :rating ?T2_rating . } GROUP BY ?T1_title ORDER BY ASC (avg( ?T2_rating)) LIMIT 1",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/item> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-i> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/rating> ?T2_rating . } GROUP BY ?T1_title ORDER BY ASC (avg( ?T2_rating)) LIMIT 1
List the titles of all items in alphabetic order .,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :item . ?T1 :title ?T1_title . ?T1 :title ?T1_title . } ORDER BY ASC (?T1_title)",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/item> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/title> ?T1_title . } ORDER BY ASC (?T1_title)
Find the name of the user who gives the most reviews.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the name and id of the item with the highest average rating.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title ?T1_i_id WHERE { ?T1 a :item . ?T2 a :review . ?T2 :ref-i ?T1 . ?T1 :title ?T1_title . ?T1 :i_id ?T1_i_id . ?T2 :rating ?T2_rating . } GROUP BY ?T1_title ?T1_i_id ORDER BY DESC (avg( ?T2_rating)) LIMIT 1",SELECT ?T1_title ?T1_i_id WHERE { ?T1 a <http://valuenet/ontop/item> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-i> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/i_id> ?T1_i_id . ?T2 <http://valuenet/ontop/rating> ?T2_rating . } GROUP BY ?T1_title ?T1_i_id ORDER BY DESC (avg( ?T2_rating)) LIMIT 1
"For each user, return the name and the average rating of reviews given by them.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (avg( ?T2_rating) as ?aggregation_T2_rating_159 ) WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . ?T2 :rating ?T2_rating . } GROUP BY ?T1_name",SELECT ?T1_name (avg( ?T2_rating) as ?aggregation_T2_rating_159 ) WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/rating> ?T2_rating . } GROUP BY ?T1_name
"For each user, find their name and the number of reviews written by them.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Find the name of the user who gave the highest rating.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :useracct . ?T2 a :review . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . ?T2 :rating ?T2_rating . } ORDER BY DESC (?T2_rating) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T2 a <http://valuenet/ontop/review> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/rating> ?T2_rating . } ORDER BY DESC (?T2_rating) LIMIT 1
Find the name of the source user with the highest average trust score.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :useracct . ?T2 a :trust . ?T2 :ref-source_u ?T1 . ?T1 :name ?T1_name . ?T2 :trust ?T2_trust . } GROUP BY ?T1_name ORDER BY DESC (avg( ?T2_trust)) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T2 a <http://valuenet/ontop/trust> . ?T2 <http://valuenet/ontop/ref-source_u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/trust> ?T2_trust . } GROUP BY ?T1_name ORDER BY DESC (avg( ?T2_trust)) LIMIT 1
Find each target user's name and average trust score.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (avg( ?T2_trust) as ?aggregation_T2_trust_38 ) WHERE { ?T1 a :useracct . ?T2 a :trust . ?T2 :ref-source_u ?T1 . ?T1 :name ?T1_name . ?T2 :trust ?T2_trust . } GROUP BY ?T1_name",SELECT ?T1_name (avg( ?T2_trust) as ?aggregation_T2_trust_38 ) WHERE { ?T1 a <http://valuenet/ontop/useracct> . ?T2 a <http://valuenet/ontop/trust> . ?T2 <http://valuenet/ontop/ref-source_u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/trust> ?T2_trust . } GROUP BY ?T1_name
