nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of farms.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :farm . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/farm> . }
List the total number of horses on farms in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_total_horses WHERE { ?T1 a :farm . ?T1 :total_horses ?T1_total_horses . ?T1 :total_horses ?T1_total_horses . } ORDER BY ASC (?T1_total_horses)",SELECT ?T1_total_horses WHERE { ?T1 a <http://valuenet/ontop/farm> . ?T1 <http://valuenet/ontop/total_horses> ?T1_total_horses . ?T1 <http://valuenet/ontop/total_horses> ?T1_total_horses . } ORDER BY ASC (?T1_total_horses)
"Return the themes of farm competitions, sorted by year ascending.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_theme WHERE { ?T1 a :farm_competition . ?T1 :theme ?T1_theme . ?T1 :year ?T1_year . } ORDER BY ASC (?T1_year)",SELECT ?T1_theme WHERE { ?T1 a <http://valuenet/ontop/farm_competition> . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T1 <http://valuenet/ontop/year> ?T1_year . } ORDER BY ASC (?T1_year)
Give the average number of working horses on farms with more than 5000 total horses.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_working_horses) as ?aggregation_T1_working_horses_45 ) WHERE { ?T1 a :farm . ?T1 :working_horses ?T1_working_horses . ?T1 :total_horses ?T1_total_horses . FILTER(?T1_total_horses > 5000) . }",SELECT (avg( ?T1_working_horses) as ?aggregation_T1_working_horses_45 ) WHERE { ?T1 a <http://valuenet/ontop/farm> . ?T1 <http://valuenet/ontop/working_horses> ?T1_working_horses . ?T1 <http://valuenet/ontop/total_horses> ?T1_total_horses . FILTER(?T1_total_horses > 5000) . }
What are the maximum and minimum number of cows across all farms.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_cows) as ?aggregation_T1_cows_56 ) (min( ?T1_cows) as ?aggregation_T1_cows_140 ) WHERE { ?T1 a :farm . ?T1 :cows ?T1_cows . ?T1 :cows ?T1_cows . }",SELECT (max( ?T1_cows) as ?aggregation_T1_cows_56 ) (min( ?T1_cows) as ?aggregation_T1_cows_140 ) WHERE { ?T1 a <http://valuenet/ontop/farm> . ?T1 <http://valuenet/ontop/cows> ?T1_cows . ?T1 <http://valuenet/ontop/cows> ?T1_cows . }
Return the maximum and minimum number of cows across all farms.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_cows) as ?aggregation_T1_cows_1 ) (min( ?T1_cows) as ?aggregation_T1_cows_143 ) WHERE { ?T1 a :farm . ?T1 :cows ?T1_cows . ?T1 :cows ?T1_cows . }",SELECT (max( ?T1_cows) as ?aggregation_T1_cows_1 ) (min( ?T1_cows) as ?aggregation_T1_cows_143 ) WHERE { ?T1 a <http://valuenet/ontop/farm> . ?T1 <http://valuenet/ontop/cows> ?T1_cows . ?T1 <http://valuenet/ontop/cows> ?T1_cows . }
Count the number of different statuses.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_status) as ?aggregation_T1_status_122 ) WHERE { ?T1 a :city . ?T1 :status ?T1_status . }",SELECT DISTINCT (count(DISTINCT ?T1_status) as ?aggregation_T1_status_122 ) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/status> ?T1_status . }
List official names of cities in descending order of population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_name WHERE { ?T1 a :city . ?T1 :official_name ?T1_official_name . ?T1 :population ?T1_population . } ORDER BY DESC (?T1_population)",SELECT ?T1_official_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/official_name> ?T1_official_name . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY DESC (?T1_population)
List the official name and status of the city with the largest population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_name ?T1_status WHERE { ?T1 a :city . ?T1 :official_name ?T1_official_name . ?T1 :status ?T1_status . ?T1 :population ?T1_population . } ORDER BY DESC (?T1_population) LIMIT 1",SELECT ?T1_official_name ?T1_status WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/official_name> ?T1_official_name . ?T1 <http://valuenet/ontop/status> ?T1_status . ?T1 <http://valuenet/ontop/population> ?T1_population . } ORDER BY DESC (?T1_population) LIMIT 1
Show the years and the official names of the host cities of competitions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_year ?T2_official_name WHERE { ?T1 a :farm_competition . ?T2 a :city . ?T1 :ref-host_city ?T2 . ?T1 :year ?T1_year . ?T2 :official_name ?T2_official_name . }",SELECT ?T1_year ?T2_official_name WHERE { ?T1 a <http://valuenet/ontop/farm_competition> . ?T2 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/ref-host_city> ?T2 . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T2 <http://valuenet/ontop/official_name> ?T2_official_name . }
Show the official names of the cities that have hosted more than one competition.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_name WHERE { ?T1 a :city . ?T2 a :farm_competition . ?T2 :ref-host_city ?T1 . ?T1 :official_name ?T1_official_name . } GROUP BY ?T1_official_name HAVING(count( *) > 1)",SELECT ?T1_official_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T2 a <http://valuenet/ontop/farm_competition> . ?T2 <http://valuenet/ontop/ref-host_city> ?T1 . ?T1 <http://valuenet/ontop/official_name> ?T1_official_name . } GROUP BY ?T1_official_name HAVING(count( *) > 1)
Show the status of the city that has hosted the greatest number of competitions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T2 a :farm_competition . ?T2 :ref-host_city ?T1 . ?T1 :status ?T1_status . } GROUP BY ?T1_status ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T2 a <http://valuenet/ontop/farm_competition> . ?T2 <http://valuenet/ontop/ref-host_city> ?T1 . ?T1 <http://valuenet/ontop/status> ?T1_status . } GROUP BY ?T1_status ORDER BY DESC (?aggregation_all) LIMIT 1
Please show the themes of competitions with host cities having populations larger than 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_theme WHERE { ?T1 a :farm_competition . ?T2 a :city . ?T1 :ref-host_city ?T2 . ?T1 :theme ?T1_theme . ?T2 :population ?T2_population . FILTER(?T2_population > 1000) . }",SELECT ?T1_theme WHERE { ?T1 a <http://valuenet/ontop/farm_competition> . ?T2 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/ref-host_city> ?T2 . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T2 <http://valuenet/ontop/population> ?T2_population . FILTER(?T2_population > 1000) . }
Please show the different statuses of cities and the average population of cities with each status.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_status (avg( ?T1_population) as ?aggregation_T1_population_101 ) WHERE { ?T1 a :city . ?T1 :status ?T1_status . ?T1 :population ?T1_population . } GROUP BY ?T1_status",SELECT ?T1_status (avg( ?T1_population) as ?aggregation_T1_population_101 ) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/status> ?T1_status . ?T1 <http://valuenet/ontop/population> ?T1_population . } GROUP BY ?T1_status
"Please show the different statuses, ordered by the number of cities that have each.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_status WHERE { ?T1 a :city . ?T1 :status ?T1_status . } GROUP BY ?T1_status ORDER BY ASC (count( *))",SELECT ?T1_status WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/status> ?T1_status . } GROUP BY ?T1_status ORDER BY ASC (count( *))
List the most common type of Status across cities.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a :city . ?T1 :status ?T1_status . } GROUP BY ?T1_status ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_status (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/status> ?T1_status . } GROUP BY ?T1_status ORDER BY DESC (?aggregation_all) LIMIT 1
List the official names of cities that have not held any competition.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_name WHERE { ?T1 a :city . ?T1 :official_name ?T1_official_name . ?T1 :city_id ?T1_city_id . FILTER(?T1_city_id not in (?T22_host_city_id)) . {SELECT ?T22_host_city_id WHERE { ?T22 a :farm_competition . ?T22 :host_city_id ?T22_host_city_id . } } }",SELECT ?T1_official_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/official_name> ?T1_official_name . ?T1 <http://valuenet/ontop/city_id> ?T1_city_id . FILTER(?T1_city_id not in (?T22_host_city_id)) . {SELECT ?T22_host_city_id WHERE { ?T22 a <http://valuenet/ontop/farm_competition> . ?T22 <http://valuenet/ontop/host_city_id> ?T22_host_city_id . } } }
Show the status shared by cities with population bigger than 1500 and smaller than 500.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_status WHERE { ?T1 a :city . ?T1 :status ?T1_status . ?T1 :population ?T1_population . FILTER(?T1_population > 1500) . FILTER (?T1_status in (?T2_status)) . ?T2 a :city . ?T2 :status ?T2_status . ?T2 :population ?T2_population . FILTER(?T2_population < 500) . }",SELECT DISTINCT ?T1_status WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/status> ?T1_status . ?T1 <http://valuenet/ontop/population> ?T1_population . FILTER(?T1_population > 1500) . FILTER (?T1_status in (?T2_status)) . ?T2 a <http://valuenet/ontop/city> . ?T2 <http://valuenet/ontop/status> ?T2_status . ?T2 <http://valuenet/ontop/population> ?T2_population . FILTER(?T2_population < 500) . }
Find the official names of cities with population bigger than 1500 or smaller than 500.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_name WHERE { ?T1 a :city . ?T1 :official_name ?T1_official_name . ?T1 :population ?T1_population . ?T1 :population ?T1_population . FILTER(?T1_population > 1500 || ?T1_population < 500) . }",SELECT ?T1_official_name WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/official_name> ?T1_official_name . ?T1 <http://valuenet/ontop/population> ?T1_population . ?T1 <http://valuenet/ontop/population> ?T1_population . FILTER(?T1_population > 1500 || ?T1_population < 500) . }
Show the census ranking of cities whose status are not 'Village'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_census_ranking WHERE { ?T1 a :city . ?T1 :census_ranking ?T1_census_ranking . ?T1 :status ?T1_status . FILTER(?T1_status != 'Village') . }",SELECT ?T1_census_ranking WHERE { ?T1 a <http://valuenet/ontop/city> . ?T1 <http://valuenet/ontop/census_ranking> ?T1_census_ranking . ?T1 <http://valuenet/ontop/status> ?T1_status . FILTER(?T1_status != 'Village') . }
