nl_question,sparql_partial_uri,sparql_complete_uri
"List the vehicle flight number, date and pilot of all the flights, ordered by altitude.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_vehicle_flight_number ?T1_date ?T1_pilot WHERE { ?T1 a :flight . ?T1 :vehicle_flight_number ?T1_vehicle_flight_number . ?T1 :date ?T1_date . ?T1 :pilot ?T1_pilot . ?T1 :altitude ?T1_altitude . } ORDER BY ASC (?T1_altitude)",SELECT ?T1_vehicle_flight_number ?T1_date ?T1_pilot WHERE { ?T1 a <http://valuenet/ontop/flight> . ?T1 <http://valuenet/ontop/vehicle_flight_number> ?T1_vehicle_flight_number . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/pilot> ?T1_pilot . ?T1 <http://valuenet/ontop/altitude> ?T1_altitude . } ORDER BY ASC (?T1_altitude)
"List the id, country, city and name of the airports ordered alphabetically by the name.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_id ?T1_country ?T1_city ?T1_name WHERE { ?T1 a :airport . ?T1 :id ?T1_id . ?T1 :country ?T1_country . ?T1 :city ?T1_city . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_id ?T1_country ?T1_city ?T1_name WHERE { ?T1 a <http://valuenet/ontop/airport> . ?T1 <http://valuenet/ontop/id> ?T1_id . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
List the name of the pilots who have flied for both a company that mainly provide 'Cargo' services and a company that runs 'Catering services' activities.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_pilot WHERE { ?T1 a :flight . ?T2 a :operate_company . ?T1 :ref-company ?T2 . ?T1 :pilot ?T1_pilot . ?T2 :principal_activities ?T2_principal_activities . FILTER(?T2_principal_activities = 'Cargo') . FILTER (?T1_pilot in (?T3_pilot)) . ?T3 a :flight . ?T4 a :operate_company . ?T3 :ref-company ?T4 . ?T3 :pilot ?T3_pilot . ?T4 :principal_activities ?T4_principal_activities . FILTER(?T4_principal_activities = 'Catering services') . }",SELECT DISTINCT ?T1_pilot WHERE { ?T1 a <http://valuenet/ontop/flight> . ?T2 a <http://valuenet/ontop/operate_company> . ?T1 <http://valuenet/ontop/ref-company> ?T2 . ?T1 <http://valuenet/ontop/pilot> ?T1_pilot . ?T2 <http://valuenet/ontop/principal_activities> ?T2_principal_activities . FILTER(?T2_principal_activities = 'Cargo') . FILTER (?T1_pilot in (?T3_pilot)) . ?T3 a <http://valuenet/ontop/flight> . ?T4 a <http://valuenet/ontop/operate_company> . ?T3 <http://valuenet/ontop/ref-company> ?T4 . ?T3 <http://valuenet/ontop/pilot> ?T3_pilot . ?T4 <http://valuenet/ontop/principal_activities> ?T4_principal_activities . FILTER(?T4_principal_activities = 'Catering services') . }
