nl_question,sparql_partial_uri,sparql_complete_uri
Show all video game types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :gtype ?T1_gtype . }",SELECT DISTINCT ?T1_gtype WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T1 <http://valuenet/ontop/gtype> ?T1_gtype . }
Show all video games and their types in the order of their names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gname ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :gname ?T1_gname . ?T1 :gtype ?T1_gtype . ?T1 :gname ?T1_gname . } ORDER BY ASC (?T1_gname)",SELECT ?T1_gname ?T1_gtype WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T1 <http://valuenet/ontop/gname> ?T1_gname . ?T1 <http://valuenet/ontop/gtype> ?T1_gtype . ?T1 <http://valuenet/ontop/gname> ?T1_gname . } ORDER BY ASC (?T1_gname)
Show all video games with type Collectible card game.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T1 :gname ?T1_gname . ?T1 :gtype ?T1_gtype . FILTER(?T1_gtype = 'Collectible card game') . }",SELECT ?T1_gname WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T1 <http://valuenet/ontop/gname> ?T1_gname . ?T1 <http://valuenet/ontop/gtype> ?T1_gtype . FILTER(?T1_gtype = 'Collectible card game') . }
What is the type of video game Call of Destiny.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gtype WHERE { ?T1 a :video_games . ?T1 :gtype ?T1_gtype . ?T1 :gname ?T1_gname . FILTER(?T1_gname = 'Call of Destiny') . }",SELECT ?T1_gtype WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T1 <http://valuenet/ontop/gtype> ?T1_gtype . ?T1 <http://valuenet/ontop/gname> ?T1_gname . FILTER(?T1_gname = 'Call of Destiny') . }
Count the number of video games with Massively multiplayer online game type .,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :gtype ?T1_gtype . FILTER(?T1_gtype = 'Massively multiplayer online game') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T1 <http://valuenet/ontop/gtype> ?T1_gtype . FILTER(?T1_gtype = 'Massively multiplayer online game') . }
Show all video game types and the number of video games in each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a :video_games . ?T1 :gtype ?T1_gtype . } GROUP BY ?T1_gtype",SELECT ?T1_gtype (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T1 <http://valuenet/ontop/gtype> ?T1_gtype . } GROUP BY ?T1_gtype
Show ids for all students who live in CHI.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :city_code ?T1_city_code . FILTER(?T1_city_code = 'CHI') . }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/city_code> ?T1_city_code . FILTER(?T1_city_code = 'CHI') . }
Show ids for all students who have advisor 1121.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :advisor ?T1_advisor . FILTER(?T1_advisor = 1121) . }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/advisor> ?T1_advisor . FILTER(?T1_advisor = 1121) . }
Show first name for all students with major 600.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :major ?T1_major . FILTER(?T1_major = 600) . }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/major> ?T1_major . FILTER(?T1_major = 600) . }
"Show the average, minimum, and maximum age for different majors.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_major (avg( ?T1_age) as ?aggregation_T1_age_16 ) (min( ?T1_age) as ?aggregation_T1_age_173 ) (max( ?T1_age) as ?aggregation_T1_age_74 ) WHERE { ?T1 a :student . ?T1 :major ?T1_major . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :age ?T1_age . } GROUP BY ?T1_major",SELECT ?T1_major (avg( ?T1_age) as ?aggregation_T1_age_16 ) (min( ?T1_age) as ?aggregation_T1_age_173 ) (max( ?T1_age) as ?aggregation_T1_age_74 ) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/major> ?T1_major . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . } GROUP BY ?T1_major
Show all advisors who have at least two students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_advisor WHERE { ?T1 a :student . ?T1 :advisor ?T1_advisor . } GROUP BY ?T1_advisor HAVING(count( *) >= 2)",SELECT ?T1_advisor WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/advisor> ?T1_advisor . } GROUP BY ?T1_advisor HAVING(count( *) >= 2)
List ids for all student who are on scholarship.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :stuid ?T1_stuid . ?T1 :onscholarship ?T1_onscholarship . FILTER(?T1_onscholarship = 'Y') . }",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/onscholarship> ?T1_onscholarship . FILTER(?T1_onscholarship = 'Y') . }
Show last names for all student who are on scholarship.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :ref-stu ?T1 . ?T1 :lname ?T1_lname . ?T2 :onscholarship ?T2_onscholarship . FILTER(?T2_onscholarship = 'Y') . }",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/sportsinfo> . ?T2 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/onscholarship> ?T2_onscholarship . FILTER(?T2_onscholarship = 'Y') . }
Show all sport name and the number of students.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_sportname (count( *) as ?aggregation_all) WHERE { ?T1 a :sportsinfo . ?T1 :sportname ?T1_sportname . } GROUP BY ?T1_sportname",SELECT ?T1_sportname (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T1 <http://valuenet/ontop/sportname> ?T1_sportname . } GROUP BY ?T1_sportname
Show all student IDs with the number of sports and total number of games played,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid (count( *) as ?aggregation_all) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_110 ) WHERE { ?T1 a :sportsinfo . ?T1 :stuid ?T1_stuid . ?T1 :gamesplayed ?T1_gamesplayed . } GROUP BY ?T1_stuid",SELECT ?T1_stuid (count( *) as ?aggregation_all) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_110 ) WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/gamesplayed> ?T1_gamesplayed . } GROUP BY ?T1_stuid
Show all student IDs with more than total 10 hours per week on all sports played.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :stuid ?T1_stuid . ?T1 :hoursperweek ?T1_hoursperweek . } GROUP BY ?T1_stuid HAVING(sum( ?T1_hoursperweek) > 10)",SELECT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/hoursperweek> ?T1_hoursperweek . } GROUP BY ?T1_stuid HAVING(sum( ?T1_hoursperweek) > 10)
Show student ids who don't have any sports.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :sportsinfo . ?T2 :stuid ?T2_stuid . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a <http://valuenet/ontop/sportsinfo> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . } } }
Show student ids who are on scholarship and have major 600.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :major ?T1_major . FILTER(?T1_major = 600) . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a :sportsinfo . ?T2 :stuid ?T2_stuid . ?T2 :onscholarship ?T2_onscholarship . FILTER(?T2_onscholarship = 'Y') . }",SELECT DISTINCT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/major> ?T1_major . FILTER(?T1_major = 600) . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a <http://valuenet/ontop/sportsinfo> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . ?T2 <http://valuenet/ontop/onscholarship> ?T2_onscholarship . FILTER(?T2_onscholarship = 'Y') . }
Show student ids who are female and play football.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'F') . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a :sportsinfo . ?T2 :stuid ?T2_stuid . ?T2 :sportname ?T2_sportname . FILTER(?T2_sportname = 'Football') . }",SELECT DISTINCT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'F') . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a <http://valuenet/ontop/sportsinfo> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . ?T2 <http://valuenet/ontop/sportname> ?T2_sportname . FILTER(?T2_sportname = 'Football') . }
Show all male student ids who don't play football.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . ?T1 :sex ?T1_sex . FILTER(?T1_sex = 'M') . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :sportsinfo . ?T2 :stuid ?T2_stuid . ?T2 :sportname ?T2_sportname . FILTER(?T2_sportname = 'Football') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/sex> ?T1_sex . FILTER(?T1_sex = 'M') . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a <http://valuenet/ontop/sportsinfo> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . ?T2 <http://valuenet/ontop/sportname> ?T2_sportname . FILTER(?T2_sportname = 'Football') . } } }
Show total hours per week and number of games played for student David Shieber.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_hoursperweek) as ?aggregation_T1_hoursperweek_68 ) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_194 ) WHERE { ?T1 a :sportsinfo . ?T2 a :student . ?T1 :ref-stu ?T2 . ?T1 :hoursperweek ?T1_hoursperweek . ?T1 :gamesplayed ?T1_gamesplayed . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'David' && ?T2_lname = 'Shieber') . }",SELECT (sum( ?T1_hoursperweek) as ?aggregation_T1_hoursperweek_68 ) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_194 ) WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T2 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/hoursperweek> ?T1_hoursperweek . ?T1 <http://valuenet/ontop/gamesplayed> ?T1_gamesplayed . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'David' && ?T2_lname = 'Shieber') . }
Show total hours per week and number of games played for students under 20.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_hoursperweek) as ?aggregation_T1_hoursperweek_129 ) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_34 ) WHERE { ?T1 a :sportsinfo . ?T2 a :student . ?T1 :ref-stu ?T2 . ?T1 :hoursperweek ?T1_hoursperweek . ?T1 :gamesplayed ?T1_gamesplayed . ?T2 :age ?T2_age . FILTER(?T2_age < 20) . }",SELECT (sum( ?T1_hoursperweek) as ?aggregation_T1_hoursperweek_129 ) (sum( ?T1_gamesplayed) as ?aggregation_T1_gamesplayed_34 ) WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T2 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/hoursperweek> ?T1_hoursperweek . ?T1 <http://valuenet/ontop/gamesplayed> ?T1_gamesplayed . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age < 20) . }
Show ids of students who don't play video game.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a :student . ?T1 :stuid ?T1_stuid . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a :plays_games . ?T2 :stuid ?T2_stuid . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_stuid as ?col1) WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . }} MINUS {SELECT (?T2_stuid as ?col1) WHERE { ?T2 a <http://valuenet/ontop/plays_games> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . } } }
Show ids of students who play video game and play sports.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_stuid WHERE { ?T1 a :sportsinfo . ?T1 :stuid ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a :plays_games . ?T2 :stuid ?T2_stuid . }",SELECT DISTINCT ?T1_stuid WHERE { ?T1 a <http://valuenet/ontop/sportsinfo> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER (?T1_stuid in (?T2_stuid)) . ?T2 a <http://valuenet/ontop/plays_games> . ?T2 <http://valuenet/ontop/stuid> ?T2_stuid . }
Show all game ids and the number of hours played.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gameid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_72 ) WHERE { ?T1 a :plays_games . ?T1 :gameid ?T1_gameid . ?T1 :hours_played ?T1_hours_played . } GROUP BY ?T1_gameid",SELECT ?T1_gameid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_72 ) WHERE { ?T1 a <http://valuenet/ontop/plays_games> . ?T1 <http://valuenet/ontop/gameid> ?T1_gameid . ?T1 <http://valuenet/ontop/hours_played> ?T1_hours_played . } GROUP BY ?T1_gameid
Show all student ids and the number of hours played.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_stuid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_29 ) WHERE { ?T1 a :plays_games . ?T1 :stuid ?T1_stuid . ?T1 :hours_played ?T1_hours_played . } GROUP BY ?T1_stuid",SELECT ?T1_stuid (sum( ?T1_hours_played) as ?aggregation_T1_hours_played_29 ) WHERE { ?T1 a <http://valuenet/ontop/plays_games> . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . ?T1 <http://valuenet/ontop/hours_played> ?T1_hours_played . } GROUP BY ?T1_stuid
Show the game name that has most number of hours played.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T2 a :plays_games . ?T2 :ref-game ?T1 . ?T1 :gname ?T1_gname . ?T2 :hours_played ?T2_hours_played . } GROUP BY ?T1_gname ORDER BY DESC (sum( ?T2_hours_played)) LIMIT 1",SELECT ?T1_gname WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T2 a <http://valuenet/ontop/plays_games> . ?T2 <http://valuenet/ontop/ref-game> ?T1 . ?T1 <http://valuenet/ontop/gname> ?T1_gname . ?T2 <http://valuenet/ontop/hours_played> ?T2_hours_played . } GROUP BY ?T1_gname ORDER BY DESC (sum( ?T2_hours_played)) LIMIT 1
Show all game names played by Linda Smith,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gname WHERE { ?T1 a :video_games . ?T13 a :plays_games . ?T13 :ref-game ?T1 . ?T1 :gname ?T1_gname . ?T2 :lname ?T2_lname . ?T2 :fname ?T2_fname . ?T2 a :student . ?T13 :ref-stu ?T2 . ?T1 :gname ?T1_gname . ?T2 :lname ?T2_lname . ?T2 :fname ?T2_fname . FILTER(?T2_lname = 'Smith' && ?T2_fname = 'Linda') . }",SELECT ?T1_gname WHERE { ?T1 a <http://valuenet/ontop/video_games> . ?T13 a <http://valuenet/ontop/plays_games> . ?T13 <http://valuenet/ontop/ref-game> ?T1 . ?T1 <http://valuenet/ontop/gname> ?T1_gname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 a <http://valuenet/ontop/student> . ?T13 <http://valuenet/ontop/ref-stu> ?T2 . ?T1 <http://valuenet/ontop/gname> ?T1_gname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 <http://valuenet/ontop/fname> ?T2_fname . FILTER(?T2_lname = 'Smith' && ?T2_fname = 'Linda') . }
Find the last and first name of students who are playing Football or Lacrosse.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname ?T1_fname WHERE { ?T1 a :student . ?T2 a :sportsinfo . ?T2 :ref-stu ?T1 . ?T1 :lname ?T1_lname . ?T1 :fname ?T1_fname . ?T2 :sportname ?T2_sportname . ?T2 :sportname ?T2_sportname . FILTER(?T2_sportname = 'Football' || ?T2_sportname = 'Lacrosse') . }",SELECT ?T1_lname ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/student> . ?T2 a <http://valuenet/ontop/sportsinfo> . ?T2 <http://valuenet/ontop/ref-stu> ?T1 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/sportname> ?T2_sportname . ?T2 <http://valuenet/ontop/sportname> ?T2_sportname . FILTER(?T2_sportname = 'Football' || ?T2_sportname = 'Lacrosse') . }
Find the first name and age of the students who are playing both Football and Lacrosse.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_age WHERE { ?T1 a :student . ?T1 :fname ?T1_fname . ?T1 :age ?T1_age . ?T1 :stuid ?T1_stuid . FILTER(?T1_stuid in (?T22_sportname)) . {SELECT ?T22_stuid WHERE { ?T22 a :sportsinfo . ?T22 :stuid ?T22_stuid . ?T22 :sportname ?T22_sportname . FILTER(?T22_sportname = 'Football') . } } }",SELECT ?T1_fname ?T1_age WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER(?T1_stuid in (?T22_sportname)) . {SELECT ?T22_stuid WHERE { ?T22 a <http://valuenet/ontop/sportsinfo> . ?T22 <http://valuenet/ontop/stuid> ?T22_stuid . ?T22 <http://valuenet/ontop/sportname> ?T22_sportname . FILTER(?T22_sportname = 'Football') . } } }
Find the last name and gender of the students who are playing both Call of Destiny and Works of Widenius games.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname ?T1_sex WHERE { ?T1 a :student . ?T1 :lname ?T1_lname . ?T1 :sex ?T1_sex . ?T1 :stuid ?T1_stuid . FILTER(?T1_stuid in (?T23_gname)) . {SELECT ?T22_stuid WHERE { ?T22 a :plays_games . ?T23 a :video_games . ?T22 :ref-game ?T23 . ?T22 :stuid ?T22_stuid . ?T23 :gname ?T23_gname . FILTER(?T23_gname = 'Call of Destiny') . } } }",SELECT ?T1_lname ?T1_sex WHERE { ?T1 a <http://valuenet/ontop/student> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/sex> ?T1_sex . ?T1 <http://valuenet/ontop/stuid> ?T1_stuid . FILTER(?T1_stuid in (?T23_gname)) . {SELECT ?T22_stuid WHERE { ?T22 a <http://valuenet/ontop/plays_games> . ?T23 a <http://valuenet/ontop/video_games> . ?T22 <http://valuenet/ontop/ref-game> ?T23 . ?T22 <http://valuenet/ontop/stuid> ?T22_stuid . ?T23 <http://valuenet/ontop/gname> ?T23_gname . FILTER(?T23_gname = 'Call of Destiny') . } } }
