nl_question,sparql_partial_uri,sparql_complete_uri
List the dates of games by the home team name in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date WHERE { ?T1 a :game . ?T1 :date ?T1_date . ?T1 :home_team ?T1_home_team . } ORDER BY DESC (?T1_home_team)",SELECT ?T1_date WHERE { ?T1 a <http://valuenet/ontop/game> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/home_team> ?T1_home_team . } ORDER BY DESC (?T1_home_team)
"List the season, home team, away team of all the games.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_season ?T1_home_team ?T1_away_team WHERE { ?T1 a :game . ?T1 :season ?T1_season . ?T1 :home_team ?T1_home_team . ?T1 :away_team ?T1_away_team . }",SELECT ?T1_season ?T1_home_team ?T1_away_team WHERE { ?T1 a <http://valuenet/ontop/game> . ?T1 <http://valuenet/ontop/season> ?T1_season . ?T1 <http://valuenet/ontop/home_team> ?T1_home_team . ?T1 <http://valuenet/ontop/away_team> ?T1_away_team . }
Find the id and name of the stadium where the largest number of injury accidents occurred.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_id (count( *) as ?aggregation_all) ?T1_name WHERE { ?T1 a :stadium . ?T1 :id ?T1_id . ?T1 :name ?T1_name . } GROUP BY ?T1_id ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_id (count( *) as ?aggregation_all) ?T1_name WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T1 <http://valuenet/ontop/id> ?T1_id . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_id ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
List the name of the stadium where both the player 'Walter Samuel' and the player 'Thiago Motta' got injured.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :stadium . ?T13 a :game . ?T13 :ref-stadium ?T1 . ?T1 :name ?T1_name . ?T2 :player ?T2_player . ?T2 a :injury_accident . ?T2 :ref-game ?T13 . ?T1 :name ?T1_name . ?T2 :player ?T2_player . FILTER(?T2_player = 'Walter Samuel') . FILTER (?T1_name in (?T3_name)) . ?T3 a :stadium . ?T15 a :game . ?T15 :ref-stadium ?T3 . ?T3 :name ?T3_name . ?T4 :player ?T4_player . ?T4 a :injury_accident . ?T4 :ref-game ?T15 . ?T3 :name ?T3_name . ?T4 :player ?T4_player . FILTER(?T4_player = 'Thiago Motta') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T13 a <http://valuenet/ontop/game> . ?T13 <http://valuenet/ontop/ref-stadium> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/player> ?T2_player . ?T2 a <http://valuenet/ontop/injury_accident> . ?T2 <http://valuenet/ontop/ref-game> ?T13 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/player> ?T2_player . FILTER(?T2_player = 'Walter Samuel') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/stadium> . ?T15 a <http://valuenet/ontop/game> . ?T15 <http://valuenet/ontop/ref-stadium> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/player> ?T4_player . ?T4 a <http://valuenet/ontop/injury_accident> . ?T4 <http://valuenet/ontop/ref-game> ?T15 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/player> ?T4_player . FILTER(?T4_player = 'Thiago Motta') . }
"Show the name, average attendance, total attendance for stadiums where no accidents happened.","PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_name as ?col1) (?T1_average_attendance as ?col2) (?T1_total_attendance as ?col3) WHERE { ?T1 a :stadium . ?T1 :name ?T1_name . ?T1 :average_attendance ?T1_average_attendance . ?T1 :total_attendance ?T1_total_attendance . }} MINUS {SELECT (?T2_name as ?col1) (?T2_average_attendance as ?col2) (?T2_total_attendance as ?col3) WHERE { ?T2 a :stadium . ?T2 :name ?T2_name . ?T2 :average_attendance ?T2_average_attendance . ?T2 :total_attendance ?T2_total_attendance . } } }",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_name as ?col1) (?T1_average_attendance as ?col2) (?T1_total_attendance as ?col3) WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/average_attendance> ?T1_average_attendance . ?T1 <http://valuenet/ontop/total_attendance> ?T1_total_attendance . }} MINUS {SELECT (?T2_name as ?col1) (?T2_average_attendance as ?col2) (?T2_total_attendance as ?col3) WHERE { ?T2 a <http://valuenet/ontop/stadium> . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/average_attendance> ?T2_average_attendance . ?T2 <http://valuenet/ontop/total_attendance> ?T2_total_attendance . } } }
"For each injury accident, find the date of the game and the name of the injured player in the game, and sort the results in descending order of game season.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date ?T2_player WHERE { ?T1 a :game . ?T2 a :injury_accident . ?T2 :ref-game ?T1 . ?T1 :date ?T1_date . ?T2 :player ?T2_player . ?T1 :season ?T1_season . } ORDER BY DESC (?T1_season)",SELECT ?T1_date ?T2_player WHERE { ?T1 a <http://valuenet/ontop/game> . ?T2 a <http://valuenet/ontop/injury_accident> . ?T2 <http://valuenet/ontop/ref-game> ?T1 . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T2 <http://valuenet/ontop/player> ?T2_player . ?T1 <http://valuenet/ontop/season> ?T1_season . } ORDER BY DESC (?T1_season)
