nl_question,sparql_partial_uri,sparql_complete_uri
List the company name and rank for all companies in the decreasing order of their sales.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company ?T1_rank WHERE { ?T1 a :company . ?T1 :company ?T1_company . ?T1 :rank ?T1_rank . ?T1 :sales_billion ?T1_sales_billion . } ORDER BY DESC (?T1_sales_billion)",SELECT ?T1_company ?T1_rank WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/sales_billion> ?T1_sales_billion . } ORDER BY DESC (?T1_sales_billion)
Show the company name and the main industry for all companies whose headquarters are not from USA.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company ?T1_main_industry WHERE { ?T1 a :company . ?T1 :company ?T1_company . ?T1 :main_industry ?T1_main_industry . ?T1 :headquarters ?T1_headquarters . FILTER(?T1_headquarters != 'USA') . }",SELECT ?T1_company ?T1_main_industry WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . FILTER(?T1_headquarters != 'USA') . }
Show all company names and headquarters in the descending order of market value.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company ?T1_headquarters WHERE { ?T1 a :company . ?T1 :company ?T1_company . ?T1 :headquarters ?T1_headquarters . ?T1 :market_value ?T1_market_value . } ORDER BY DESC (?T1_market_value)",SELECT ?T1_company ?T1_headquarters WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . } ORDER BY DESC (?T1_market_value)
"Show minimum, maximum, and average market value for all companies.","PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_market_value) as ?aggregation_T1_market_value_121 ) (max( ?T1_market_value) as ?aggregation_T1_market_value_198 ) (avg( ?T1_market_value) as ?aggregation_T1_market_value_155 ) WHERE { ?T1 a :company . ?T1 :market_value ?T1_market_value . ?T1 :market_value ?T1_market_value . ?T1 :market_value ?T1_market_value . }",SELECT (min( ?T1_market_value) as ?aggregation_T1_market_value_121 ) (max( ?T1_market_value) as ?aggregation_T1_market_value_198 ) (avg( ?T1_market_value) as ?aggregation_T1_market_value_155 ) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . }
Show all main industry for all companies.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_main_industry WHERE { ?T1 a :company . ?T1 :main_industry ?T1_main_industry . }",SELECT DISTINCT ?T1_main_industry WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . }
List all headquarters and the number of companies in each headquarter.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_headquarters (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . } GROUP BY ?T1_headquarters",SELECT ?T1_headquarters (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . } GROUP BY ?T1_headquarters
Show all main industry and total market value in each industry.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_main_industry (sum( ?T1_market_value) as ?aggregation_T1_market_value_142 ) WHERE { ?T1 a :company . ?T1 :main_industry ?T1_main_industry . ?T1 :market_value ?T1_market_value . } GROUP BY ?T1_main_industry",SELECT ?T1_main_industry (sum( ?T1_market_value) as ?aggregation_T1_market_value_142 ) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . } GROUP BY ?T1_main_industry
List the main industry with highest total market value and its number of companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_main_industry (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T1 :main_industry ?T1_main_industry . ?T1 :market_value ?T1_market_value . } GROUP BY ?T1_main_industry ORDER BY DESC (sum( ?T1_market_value)) LIMIT 1",SELECT ?T1_main_industry (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . } GROUP BY ?T1_main_industry ORDER BY DESC (sum( ?T1_market_value)) LIMIT 1
Show headquarters with at least two companies in the banking industry.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . ?T1 :main_industry ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . } GROUP BY ?T1_headquarters HAVING(count( *) >= 2)",SELECT ?T1_headquarters WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . } GROUP BY ?T1_headquarters HAVING(count( *) >= 2)
"Show gas station id, location, and manager_name for all gas stations ordered by open year.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_station_id ?T1_location ?T1_manager_name WHERE { ?T1 a :gas_station . ?T1 :station_id ?T1_station_id . ?T1 :location ?T1_location . ?T1 :manager_name ?T1_manager_name . ?T1 :open_year ?T1_open_year . } ORDER BY ASC (?T1_open_year)",SELECT ?T1_station_id ?T1_location ?T1_manager_name WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T1 <http://valuenet/ontop/station_id> ?T1_station_id . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/manager_name> ?T1_manager_name . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . } ORDER BY ASC (?T1_open_year)
Show all locations and the number of gas stations in each location ordered by the count.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :gas_station . ?T1 :location ?T1_location . } GROUP BY ?T1_location ORDER BY ASC (count( *))",SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location ORDER BY ASC (count( *))
Show all headquarters with both a company in banking industry and a company in Oil and gas.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_headquarters WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . ?T1 :main_industry ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . FILTER (?T1_headquarters in (?T2_headquarters)) . ?T2 a :company . ?T2 :headquarters ?T2_headquarters . ?T2 :main_industry ?T2_main_industry . FILTER(?T2_main_industry = 'Oil && gas') . }",SELECT DISTINCT ?T1_headquarters WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . FILTER (?T1_headquarters in (?T2_headquarters)) . ?T2 a <http://valuenet/ontop/company> . ?T2 <http://valuenet/ontop/headquarters> ?T2_headquarters . ?T2 <http://valuenet/ontop/main_industry> ?T2_main_industry . FILTER(?T2_main_industry = 'Oil && gas') . }
Show all headquarters without a company in banking industry.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_headquarters as ?col1) WHERE { ?T1 a :company . ?T1 :headquarters ?T1_headquarters . }} MINUS {SELECT (?T2_headquarters as ?col1) WHERE { ?T2 a :company . ?T2 :headquarters ?T2_headquarters . ?T2 :main_industry ?T2_main_industry . FILTER(?T2_main_industry = 'Banking') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_headquarters as ?col1) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/headquarters> ?T1_headquarters . }} MINUS {SELECT (?T2_headquarters as ?col1) WHERE { ?T2 a <http://valuenet/ontop/company> . ?T2 <http://valuenet/ontop/headquarters> ?T2_headquarters . ?T2 <http://valuenet/ontop/main_industry> ?T2_main_industry . FILTER(?T2_main_industry = 'Banking') . } } }
Show the company name with the number of gas station.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company (count( *) as ?aggregation_all) WHERE { ?T1 a :company . ?T2 a :station_company . ?T2 :ref-company ?T1 . ?T1 :company ?T1_company . } GROUP BY ?T1_company",SELECT ?T1_company (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/company> . ?T2 a <http://valuenet/ontop/station_company> . ?T2 <http://valuenet/ontop/ref-company> ?T1 . ?T1 <http://valuenet/ontop/company> ?T1_company . } GROUP BY ?T1_company
Show company name and main industry without a gas station.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company ?T1_main_industry WHERE { ?T1 a :company . ?T1 :company ?T1_company . ?T1 :main_industry ?T1_main_industry . ?T1 :company_id ?T1_company_id . FILTER(?T1_company_id not in (?T22_company_id)) . {SELECT ?T22_company_id WHERE { ?T22 a :station_company . ?T22 :company_id ?T22_company_id . } } }",SELECT ?T1_company ?T1_main_industry WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . ?T1 <http://valuenet/ontop/company_id> ?T1_company_id . FILTER(?T1_company_id not in (?T22_company_id)) . {SELECT ?T22_company_id WHERE { ?T22 a <http://valuenet/ontop/station_company> . ?T22 <http://valuenet/ontop/company_id> ?T22_company_id . } } }
Show the manager name for gas stations belonging to the ExxonMobil company.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_manager_name WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :ref-station ?T1 . ?T1 :manager_name ?T1_manager_name . ?T2 :company ?T2_company . ?T2 a :company . ?T13 :ref-company ?T2 . ?T1 :manager_name ?T1_manager_name . ?T2 :company ?T2_company . FILTER(?T2_company = 'ExxonMobil') . }",SELECT ?T1_manager_name WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T13 a <http://valuenet/ontop/station_company> . ?T13 <http://valuenet/ontop/ref-station> ?T1 . ?T1 <http://valuenet/ontop/manager_name> ?T1_manager_name . ?T2 <http://valuenet/ontop/company> ?T2_company . ?T2 a <http://valuenet/ontop/company> . ?T13 <http://valuenet/ontop/ref-company> ?T2 . ?T1 <http://valuenet/ontop/manager_name> ?T1_manager_name . ?T2 <http://valuenet/ontop/company> ?T2_company . FILTER(?T2_company = 'ExxonMobil') . }
Show all locations where a gas station for company with market value greater than 100 is located.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :ref-station ?T1 . ?T1 :location ?T1_location . ?T2 :market_value ?T2_market_value . ?T2 a :company . ?T13 :ref-company ?T2 . ?T1 :location ?T1_location . ?T2 :market_value ?T2_market_value . FILTER(?T2_market_value > 100) . }",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T13 a <http://valuenet/ontop/station_company> . ?T13 <http://valuenet/ontop/ref-station> ?T1 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/market_value> ?T2_market_value . ?T2 a <http://valuenet/ontop/company> . ?T13 <http://valuenet/ontop/ref-company> ?T2 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/market_value> ?T2_market_value . FILTER(?T2_market_value > 100) . }
Show the manager name with most number of gas stations opened after 2000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_manager_name (count( *) as ?aggregation_all) WHERE { ?T1 a :gas_station . ?T1 :manager_name ?T1_manager_name . ?T1 :open_year ?T1_open_year . FILTER(?T1_open_year > 2000) . } GROUP BY ?T1_manager_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_manager_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T1 <http://valuenet/ontop/manager_name> ?T1_manager_name . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . FILTER(?T1_open_year > 2000) . } GROUP BY ?T1_manager_name ORDER BY DESC (?aggregation_all) LIMIT 1
order all gas station locations by the opening year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :gas_station . ?T1 :location ?T1_location . ?T1 :open_year ?T1_open_year . } ORDER BY ASC (?T1_open_year)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . } ORDER BY ASC (?T1_open_year)
"find the rank, company names, market values of the companies in the banking industry order by their sales and profits in billion.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_rank ?T1_company ?T1_market_value WHERE { ?T1 a :company . ?T1 :rank ?T1_rank . ?T1 :company ?T1_company . ?T1 :market_value ?T1_market_value . ?T1 :sales_billion ?T1_sales_billion . ?T1 :main_industry ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . } ORDER BY ASC (?T1_sales_billion)",SELECT ?T1_rank ?T1_company ?T1_market_value WHERE { ?T1 a <http://valuenet/ontop/company> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/company> ?T1_company . ?T1 <http://valuenet/ontop/market_value> ?T1_market_value . ?T1 <http://valuenet/ontop/sales_billion> ?T1_sales_billion . ?T1 <http://valuenet/ontop/main_industry> ?T1_main_industry . FILTER(?T1_main_industry = 'Banking') . } ORDER BY ASC (?T1_sales_billion)
find the location and Representative name of the gas stations owned by the companies with top 3 Asset amounts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location ?T1_representative_name WHERE { ?T1 a :gas_station . ?T13 a :station_company . ?T13 :ref-station ?T1 . ?T1 :location ?T1_location . ?T1 :representative_name ?T1_representative_name . ?T2 :assets_billion ?T2_assets_billion . ?T2 a :company . ?T13 :ref-company ?T2 . ?T1 :location ?T1_location . ?T1 :representative_name ?T1_representative_name . ?T2 :assets_billion ?T2_assets_billion . } ORDER BY DESC (?T2_assets_billion) LIMIT 1",SELECT ?T1_location ?T1_representative_name WHERE { ?T1 a <http://valuenet/ontop/gas_station> . ?T13 a <http://valuenet/ontop/station_company> . ?T13 <http://valuenet/ontop/ref-station> ?T1 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/representative_name> ?T1_representative_name . ?T2 <http://valuenet/ontop/assets_billion> ?T2_assets_billion . ?T2 a <http://valuenet/ontop/company> . ?T13 <http://valuenet/ontop/ref-company> ?T2 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/representative_name> ?T1_representative_name . ?T2 <http://valuenet/ontop/assets_billion> ?T2_assets_billion . } ORDER BY DESC (?T2_assets_billion) LIMIT 1
