nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of gymnasts.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :gymnast . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/gymnast> . }
List the total points of gymnasts in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T1 :total_points ?T1_total_points . ?T1 :total_points ?T1_total_points . } ORDER BY DESC (?T1_total_points)",SELECT ?T1_total_points WHERE { ?T1 a <http://valuenet/ontop/gymnast> . ?T1 <http://valuenet/ontop/total_points> ?T1_total_points . ?T1 <http://valuenet/ontop/total_points> ?T1_total_points . } ORDER BY DESC (?T1_total_points)
List the total points of gymnasts in descending order of floor exercise points.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T1 :total_points ?T1_total_points . ?T1 :floor_exercise_points ?T1_floor_exercise_points . } ORDER BY DESC (?T1_floor_exercise_points)",SELECT ?T1_total_points WHERE { ?T1 a <http://valuenet/ontop/gymnast> . ?T1 <http://valuenet/ontop/total_points> ?T1_total_points . ?T1 <http://valuenet/ontop/floor_exercise_points> ?T1_floor_exercise_points . } ORDER BY DESC (?T1_floor_exercise_points)
Return the average horizontal bar points across all gymnasts.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_horizontal_bar_points) as ?aggregation_T1_horizontal_bar_points_135 ) WHERE { ?T1 a :gymnast . ?T1 :horizontal_bar_points ?T1_horizontal_bar_points . }",SELECT (avg( ?T1_horizontal_bar_points) as ?aggregation_T1_horizontal_bar_points_135 ) WHERE { ?T1 a <http://valuenet/ontop/gymnast> . ?T1 <http://valuenet/ontop/horizontal_bar_points> ?T1_horizontal_bar_points . }
"Return the names of people, ordered alphabetically.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Return the names of the gymnasts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
Return the names of gymnasts who did not grow up in Santo Domingo.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :hometown ?T1_hometown . FILTER(?T1_hometown != 'Santo Domingo') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . FILTER(?T1_hometown != 'Santo Domingo') . }
Return the age of the person with the greatest height.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_age WHERE { ?T1 a :people . ?T1 :age ?T1_age . ?T1 :height ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1",SELECT ?T1_age WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1
List the names of the top 5 oldest people.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1
Return the total points of the gymnast with the lowest age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_total_points WHERE { ?T1 a :gymnast . ?T2 a :people . ?T1 :ref-gymnast ?T2 . ?T1 :total_points ?T1_total_points . ?T2 :age ?T2_age . } ORDER BY ASC (?T2_age) LIMIT 1",SELECT ?T1_total_points WHERE { ?T1 a <http://valuenet/ontop/gymnast> . ?T2 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/ref-gymnast> ?T2 . ?T1 <http://valuenet/ontop/total_points> ?T1_total_points . ?T2 <http://valuenet/ontop/age> ?T2_age . } ORDER BY ASC (?T2_age) LIMIT 1
Return the average age across all gymnasts.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_172 ) WHERE { ?T1 a :people . ?T1 :age ?T1_age . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_172 ) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/age> ?T1_age . }
Give the different hometowns of gymnasts that have a total point score of above 57.5.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_hometown WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :ref-gymnast ?T1 . ?T1 :hometown ?T1_hometown . ?T2 :total_points ?T2_total_points . FILTER(?T2_total_points > 57.5) . }",SELECT DISTINCT ?T1_hometown WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/gymnast> . ?T2 <http://valuenet/ontop/ref-gymnast> ?T1 . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . ?T2 <http://valuenet/ontop/total_points> ?T2_total_points . FILTER(?T2_total_points > 57.5) . }
Return the hometown that is most common among gymnasts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hometown (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :ref-gymnast ?T1 . ?T1 :hometown ?T1_hometown . } GROUP BY ?T1_hometown ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_hometown (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/gymnast> . ?T2 <http://valuenet/ontop/ref-gymnast> ?T1 . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . } GROUP BY ?T1_hometown ORDER BY DESC (?aggregation_all) LIMIT 1
Give the hometowns from which two or more gymnasts are from.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hometown WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :ref-gymnast ?T1 . ?T1 :hometown ?T1_hometown . } GROUP BY ?T1_hometown HAVING(count( *) >= 2)",SELECT ?T1_hometown WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/gymnast> . ?T2 <http://valuenet/ontop/ref-gymnast> ?T1 . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . } GROUP BY ?T1_hometown HAVING(count( *) >= 2)
List the names of gymnasts in ascending order by their heights.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :height ?T1_height . } ORDER BY ASC (?T1_height)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY ASC (?T1_height)
List the distinct hometowns that are not associated with any gymnast.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_hometown as ?col1) WHERE { ?T1 a :people . ?T1 :hometown ?T1_hometown . }} MINUS {SELECT DISTINCT (?T2_hometown as ?col1) WHERE { ?T2 a :people . ?T2 :hometown ?T2_hometown . } } }",SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_hometown as ?col1) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . }} MINUS {SELECT DISTINCT (?T2_hometown as ?col1) WHERE { ?T2 a <http://valuenet/ontop/people> . ?T2 <http://valuenet/ontop/hometown> ?T2_hometown . } } }
Show the hometowns shared by people older than 23 and younger than 20.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_hometown WHERE { ?T1 a :people . ?T1 :hometown ?T1_hometown . ?T1 :age ?T1_age . FILTER(?T1_age > 23) . FILTER (?T1_hometown in (?T2_hometown)) . ?T2 a :people . ?T2 :hometown ?T2_hometown . ?T2 :age ?T2_age . FILTER(?T2_age < 20) . }",SELECT DISTINCT ?T1_hometown WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 23) . FILTER (?T1_hometown in (?T2_hometown)) . ?T2 a <http://valuenet/ontop/people> . ?T2 <http://valuenet/ontop/hometown> ?T2_hometown . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age < 20) . }
Count the number of different hometowns of these people.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_hometown) as ?aggregation_T1_hometown_155 ) WHERE { ?T1 a :people . ?T1 :hometown ?T1_hometown . }",SELECT DISTINCT (count(DISTINCT ?T1_hometown) as ?aggregation_T1_hometown_155 ) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . }
Show the ages of gymnasts in descending order of total points.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_age WHERE { ?T1 a :people . ?T2 a :gymnast . ?T2 :ref-gymnast ?T1 . ?T1 :age ?T1_age . ?T2 :total_points ?T2_total_points . } ORDER BY DESC (?T2_total_points)",SELECT ?T1_age WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/gymnast> . ?T2 <http://valuenet/ontop/ref-gymnast> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/total_points> ?T2_total_points . } ORDER BY DESC (?T2_total_points)
