nl_question,sparql_partial_uri,sparql_complete_uri
Find the department with the most employees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :name ?T1_name . ?T1 :departmentid ?T1_departmentid . } GROUP BY ?T1_name ORDER BY DESC (count( ?T1_departmentid)) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/departmentid> ?T1_departmentid . } GROUP BY ?T1_name ORDER BY DESC (count( ?T1_departmentid)) LIMIT 1
Tell me the employee id of the head of the department with the least employees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_head (count( *) as ?aggregation_all) WHERE { ?T1 a :department . ?T1 :head ?T1_head . ?T1 :departmentid ?T1_departmentid . } GROUP BY ?T1_head ORDER BY ASC (count( ?T1_departmentid)) LIMIT 1",SELECT ?T1_head (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/department> . ?T1 <http://valuenet/ontop/head> ?T1_head . ?T1 <http://valuenet/ontop/departmentid> ?T1_departmentid . } GROUP BY ?T1_head ORDER BY ASC (count( ?T1_departmentid)) LIMIT 1
Find the name and position of the head of the department with the least employees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :ref-head ?T1 . ?T1 :name ?T1_name . ?T1 :position ?T1_position . ?T2 :departmentid ?T2_departmentid . } GROUP BY ?T1_name ?T1_position ORDER BY ASC (count( ?T2_departmentid)) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T2 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-head> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T2 <http://valuenet/ontop/departmentid> ?T2_departmentid . } GROUP BY ?T1_name ?T1_position ORDER BY ASC (count( ?T2_departmentid)) LIMIT 1
List the names of patients who have made appointments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :patient . ?T1 :name ?T1_name . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
Which patients made more than one appointment? Tell me the name and phone number of these patients.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_phone WHERE { ?T1 a :patient . ?T2 a :appointment . ?T2 :ref-patient ?T1 . ?T1 :name ?T1_name . ?T1 :phone ?T1_phone . } GROUP BY ?T1_name ?T1_phone HAVING(count( *) > 1)",SELECT ?T1_name ?T1_phone WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T2 a <http://valuenet/ontop/appointment> . ?T2 <http://valuenet/ontop/ref-patient> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/phone> ?T1_phone . } GROUP BY ?T1_name ?T1_phone HAVING(count( *) > 1)
List the name of physicians who took some appointment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :physician . ?T1 :name ?T1_name . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
List the name of physicians who never took any appointment.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :physician . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :physician . ?T2 :name ?T2_name . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/physician> . ?T2 <http://valuenet/ontop/name> ?T2_name . } } }
Find the name of the patient who made the appointment with the most recent start date.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :patient . ?T2 a :appointment . ?T2 :ref-patient ?T1 . ?T1 :name ?T1_name . ?T2 :start ?T2_start . } ORDER BY DESC (?T2_start) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T2 a <http://valuenet/ontop/appointment> . ?T2 <http://valuenet/ontop/ref-patient> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/start> ?T2_start . } ORDER BY DESC (?T2_start) LIMIT 1
Count the number of patients who stayed in room 112.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( ?T1_patient) as ?aggregation_T1_patient_114 ) WHERE { ?T1 a :stay . ?T1 :patient ?T1_patient . ?T1 :room ?T1_room . FILTER(?T1_room = 112) . }",SELECT (count( ?T1_patient) as ?aggregation_T1_patient_114 ) WHERE { ?T1 a <http://valuenet/ontop/stay> . ?T1 <http://valuenet/ontop/patient> ?T1_patient . ?T1 <http://valuenet/ontop/room> ?T1_room . FILTER(?T1_room = 112) . }
Find the number of patients' prescriptions physician John Dorian made.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( ?T1_ssn) as ?aggregation_T1_ssn_199 ) WHERE { ?T1 a :patient . ?T2 a :physician . ?T1 :ref-pcp ?T2 . ?T1 :ssn ?T1_ssn . ?T2 :name ?T2_name . FILTER(?T2_name = 'John Dorian') . }",SELECT (count( ?T1_ssn) as ?aggregation_T1_ssn_199 ) WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T2 a <http://valuenet/ontop/physician> . ?T1 <http://valuenet/ontop/ref-pcp> ?T2 . ?T1 <http://valuenet/ontop/ssn> ?T1_ssn . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'John Dorian') . }
Find the patient who most recently stayed in room 111.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_patient WHERE { ?T1 a :stay . ?T1 :patient ?T1_patient . ?T1 :staystart ?T1_staystart . ?T1 :room ?T1_room . FILTER(?T1_room = 111) . } ORDER BY DESC (?T1_staystart) LIMIT 1",SELECT ?T1_patient WHERE { ?T1 a <http://valuenet/ontop/stay> . ?T1 <http://valuenet/ontop/patient> ?T1_patient . ?T1 <http://valuenet/ontop/staystart> ?T1_staystart . ?T1 <http://valuenet/ontop/room> ?T1_room . FILTER(?T1_room = 111) . } ORDER BY DESC (?T1_staystart) LIMIT 1
Find the name of the nurse who has the largest number of appointments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :nurse . ?T2 a :appointment . ?T2 :ref-prepnurse ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/nurse> . ?T2 a <http://valuenet/ontop/appointment> . ?T2 <http://valuenet/ontop/ref-prepnurse> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
How many patients do each physician take care of? List their names and number of patients they take care of.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :physician . ?T2 a :patient . ?T2 :ref-pcp ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T2 a <http://valuenet/ontop/patient> . ?T2 <http://valuenet/ontop/ref-pcp> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Find the name of physicians who are in charge of more than one patient.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :patient . ?T2 :ref-pcp ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T2 a <http://valuenet/ontop/patient> . ?T2 <http://valuenet/ontop/ref-pcp> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)
Tell me the distinct block codes where some rooms are available.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_blockcode WHERE { ?T1 a :room . ?T1 :blockcode ?T1_blockcode .?T1 :unavailable ?T1_unavailable . FILTER(?T1_unavailable=false) }",SELECT DISTINCT ?T1_blockcode WHERE { ?T1 a <http://valuenet/ontop/room> . ?T1 <http://valuenet/ontop/blockcode> ?T1_blockcode .?T1 <http://valuenet/ontop/unavailable> ?T1_unavailable . FILTER(?T1_unavailable=false) }
Find the number of distinct room types available.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_roomtype) as ?aggregation_T1_roomtype_69 ) WHERE { ?T1 a :room . ?T1 :roomtype ?T1_roomtype . }",SELECT DISTINCT (count(DISTINCT ?T1_roomtype) as ?aggregation_T1_roomtype_69 ) WHERE { ?T1 a <http://valuenet/ontop/room> . ?T1 <http://valuenet/ontop/roomtype> ?T1_roomtype . }
List the names of all the physicians who prescribe Thesisin as medication.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :physician . ?T13 a :prescribes . ?T13 :ref-physician ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :medication . ?T13 :ref-medication ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Thesisin') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T13 a <http://valuenet/ontop/prescribes> . ?T13 <http://valuenet/ontop/ref-physician> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/medication> . ?T13 <http://valuenet/ontop/ref-medication> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Thesisin') . }
Which physicians prescribe a medication of brand X? Tell me the name and position of those physicians.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name ?T1_position WHERE { ?T1 a :physician . ?T13 a :prescribes . ?T13 :ref-physician ?T1 . ?T1 :name ?T1_name . ?T1 :position ?T1_position . ?T2 :brand ?T2_brand . ?T2 a :medication . ?T13 :ref-medication ?T2 . ?T1 :name ?T1_name . ?T1 :position ?T1_position . ?T2 :brand ?T2_brand . FILTER(?T2_brand = 'X') . }",SELECT DISTINCT ?T1_name ?T1_position WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T13 a <http://valuenet/ontop/prescribes> . ?T13 <http://valuenet/ontop/ref-physician> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T2 <http://valuenet/ontop/brand> ?T2_brand . ?T2 a <http://valuenet/ontop/medication> . ?T13 <http://valuenet/ontop/ref-medication> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T2 <http://valuenet/ontop/brand> ?T2_brand . FILTER(?T2_brand = 'X') . }
Find the number of medications prescribed for each brand.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :prescribes . ?T2 a :medication . ?T1 :ref-medication ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/prescribes> . ?T2 a <http://valuenet/ontop/medication> . ?T1 <http://valuenet/ontop/ref-medication> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Find the name of physicians whose position title contains the word 'senior'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :physician . ?T1 :name ?T1_name . ?T1 :position ?T1_position . FILTER(contains (?T1_position, 'senior')) . }","SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/position> ?T1_position . FILTER(contains (?T1_position, 'senior')) . }"
Find the names of all patients who have an undergoing treatment and are staying in room 111.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :patient . ?T2 a :stay . ?T2 :ref-patient ?T1 . ?T1 :name ?T1_name . ?T2 :room ?T2_room . FILTER(?T2_room = 111) . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T2 a <http://valuenet/ontop/stay> . ?T2 <http://valuenet/ontop/ref-patient> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/room> ?T2_room . FILTER(?T2_room = 111) . }
Find the names of nurses who are nursing an undergoing treatment.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :nurse . ?T1 :name ?T1_name . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/nurse> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
"List the names of all distinct medications, ordered in an alphabetical order.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :medication . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/medication> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
List the physicians' employee ids together with their primary affiliation departments' ids.,"PREFIX : <http://valuenet/ontop/>
SELECT ?t1_physician ?t1_department WHERE {?t1 a :affiliated_with . ?t1 :primaryaffiliation ?t1_primaryaffiliation. FILTER (?t1_primaryaffiliation = True)}",SELECT ?t1_physician ?t1_department WHERE {?t1 a <http://valuenet/ontop/affiliated_with> . ?t1 <http://valuenet/ontop/primaryaffiliation> ?t1_primaryaffiliation. FILTER (?t1_primaryaffiliation = True)}
List the names of departments where some physicians are primarily affiliated with.,"PREFIX : <http://valuenet/ontop/>
SELECT ?t2_name WHERE {?t1 a :affiliated_with . ?t1 :primaryaffiliation ?t1_primaryaffiliation. ?t2 a :department . ?t1 :ref-department ?t2 . ?t2 :name ?t2_name . FILTER (?t1_primaryaffiliation = True)}",SELECT ?t2_name WHERE {?t1 a <http://valuenet/ontop/affiliated_with> . ?t1 <http://valuenet/ontop/primaryaffiliation> ?t1_primaryaffiliation. ?t2 a <http://valuenet/ontop/department> . ?t1 <http://valuenet/ontop/ref-department> ?t2 . ?t2 <http://valuenet/ontop/name> ?t2_name . FILTER (?t1_primaryaffiliation = True)}
What nurses are on call with block floor 1 and block code 1? Tell me their names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nurse WHERE { ?T1 a :on_call . ?T1 :nurse ?T1_nurse . ?T1 :blockfloor ?T1_blockfloor . ?T1 :blockcode ?T1_blockcode . FILTER(?T1_blockfloor = 1 && ?T1_blockcode = 1) . }",SELECT ?T1_nurse WHERE { ?T1 a <http://valuenet/ontop/on_call> . ?T1 <http://valuenet/ontop/nurse> ?T1_nurse . ?T1 <http://valuenet/ontop/blockfloor> ?T1_blockfloor . ?T1 <http://valuenet/ontop/blockcode> ?T1_blockcode . FILTER(?T1_blockfloor = 1 && ?T1_blockcode = 1) . }
"Tell me the highest, lowest, and average cost of procedures.","PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_cost) as ?aggregation_T1_cost_111 ) (min( ?T1_cost) as ?aggregation_T1_cost_84 ) (avg( ?T1_cost) as ?aggregation_T1_cost_35 ) WHERE { ?T1 a :procedures . ?T1 :cost ?T1_cost . ?T1 :cost ?T1_cost . ?T1 :cost ?T1_cost . }",SELECT (max( ?T1_cost) as ?aggregation_T1_cost_111 ) (min( ?T1_cost) as ?aggregation_T1_cost_84 ) (avg( ?T1_cost) as ?aggregation_T1_cost_35 ) WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T1 <http://valuenet/ontop/cost> ?T1_cost . ?T1 <http://valuenet/ontop/cost> ?T1_cost . ?T1 <http://valuenet/ontop/cost> ?T1_cost . }
List the name and cost of all procedures sorted by the cost from the highest to the lowest.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_cost WHERE { ?T1 a :procedures . ?T1 :name ?T1_name . ?T1 :cost ?T1_cost . ?T1 :cost ?T1_cost . } ORDER BY DESC (?T1_cost)",SELECT ?T1_name ?T1_cost WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/cost> ?T1_cost . ?T1 <http://valuenet/ontop/cost> ?T1_cost . } ORDER BY DESC (?T1_cost)
Find the three most expensive procedures.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :procedures . ?T1 :name ?T1_name . ?T1 :cost ?T1_cost . } ORDER BY ASC (?T1_cost) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/cost> ?T1_cost . } ORDER BY ASC (?T1_cost) LIMIT 1
Find the physicians who are trained in a procedure that costs more than 5000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :physician . ?T13 a :trained_in . ?T13 :ref-physician ?T1 . ?T1 :name ?T1_name . ?T2 :cost ?T2_cost . ?T2 a :procedures . ?T13 :ref-treatment ?T2 . ?T1 :name ?T1_name . ?T2 :cost ?T2_cost . FILTER(?T2_cost > 5000) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T13 a <http://valuenet/ontop/trained_in> . ?T13 <http://valuenet/ontop/ref-physician> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/cost> ?T2_cost . ?T2 a <http://valuenet/ontop/procedures> . ?T13 <http://valuenet/ontop/ref-treatment> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/cost> ?T2_cost . FILTER(?T2_cost > 5000) . }
Compute the mean price of procedures physician John Wen was trained in.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_cost) as ?aggregation_T1_cost_43 ) WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :ref-treatment ?T1 . ?T1 :cost ?T1_cost . ?T2 :name ?T2_name . ?T2 a :physician . ?T13 :ref-physician ?T2 . ?T1 :cost ?T1_cost . ?T2 :name ?T2_name . FILTER(?T2_name = 'John Wen') . }",SELECT (avg( ?T1_cost) as ?aggregation_T1_cost_43 ) WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T13 a <http://valuenet/ontop/trained_in> . ?T13 <http://valuenet/ontop/ref-treatment> ?T1 . ?T1 <http://valuenet/ontop/cost> ?T1_cost . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/physician> . ?T13 <http://valuenet/ontop/ref-physician> ?T2 . ?T1 <http://valuenet/ontop/cost> ?T1_cost . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'John Wen') . }
Find the names of procedures which physician John Wen was trained in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :ref-treatment ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :physician . ?T13 :ref-physician ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'John Wen') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T13 a <http://valuenet/ontop/trained_in> . ?T13 <http://valuenet/ontop/ref-treatment> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/physician> . ?T13 <http://valuenet/ontop/ref-physician> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'John Wen') . }
Find all procedures which cost more than 1000 or which physician John Wen was trained in.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :procedures . ?T1 :name ?T1_name . ?T1 :cost ?T1_cost . FILTER(?T1_cost > 1000) . }} UNION {SELECT (?T1_name as ?col1) WHERE { ?T1 a :procedures . ?T13 a :trained_in . ?T13 :ref-treatment ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :physician . ?T13 :ref-physician ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'John Wen') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/cost> ?T1_cost . FILTER(?T1_cost > 1000) . }} UNION {SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T13 a <http://valuenet/ontop/trained_in> . ?T13 <http://valuenet/ontop/ref-treatment> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/physician> . ?T13 <http://valuenet/ontop/ref-physician> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'John Wen') . } } }
Find the names of all procedures such that the cost is less than 5000 and physician John Wen was trained in.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :procedures . ?T1 :name ?T1_name . ?T1 :cost ?T1_cost . FILTER(?T1_cost < 5000) . FILTER (?T1_name in (?T2_name)) . ?T2 a :procedures . ?T14 a :trained_in . ?T14 :ref-treatment ?T2 . ?T2 :name ?T2_name . ?T3 :name ?T3_name . ?T3 a :physician . ?T14 :ref-physician ?T3 . ?T2 :name ?T2_name . ?T3 :name ?T3_name . FILTER(?T3_name = 'John Wen') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/procedures> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/cost> ?T1_cost . FILTER(?T1_cost < 5000) . FILTER (?T1_name in (?T2_name)) . ?T2 a <http://valuenet/ontop/procedures> . ?T14 a <http://valuenet/ontop/trained_in> . ?T14 <http://valuenet/ontop/ref-treatment> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T3 a <http://valuenet/ontop/physician> . ?T14 <http://valuenet/ontop/ref-physician> ?T3 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/name> ?T3_name . FILTER(?T3_name = 'John Wen') . }
Find the name of physicians who are affiliated with both Surgery and Psychiatry departments.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :ref-head ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Surgery') . FILTER (?T1_name in (?T3_name)) . ?T3 a :physician . ?T4 a :department . ?T4 :ref-head ?T3 . ?T3 :name ?T3_name . ?T4 :name ?T4_name . FILTER(?T4_name = 'Psychiatry') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T2 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-head> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Surgery') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/physician> . ?T4 a <http://valuenet/ontop/department> . ?T4 <http://valuenet/ontop/ref-head> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/name> ?T4_name . FILTER(?T4_name = 'Psychiatry') . }
Find the name of physicians who are affiliated with Surgery or Psychiatry department.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :physician . ?T2 a :department . ?T2 :ref-head ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Surgery' || ?T2_name = 'Psychiatry') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/physician> . ?T2 a <http://valuenet/ontop/department> . ?T2 <http://valuenet/ontop/ref-head> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Surgery' || ?T2_name = 'Psychiatry') . }
Find the names of patients who are not using the medication of Procrastin-X.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :patient . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :patient . ?T14 a :prescribes . ?T14 :ref-patient ?T2 . ?T2 :name ?T2_name . ?T3 :name ?T3_name . ?T3 a :medication . ?T14 :ref-medication ?T3 . ?T2 :name ?T2_name . ?T3 :name ?T3_name . FILTER(?T3_name = 'Procrastin-X') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/patient> . ?T14 a <http://valuenet/ontop/prescribes> . ?T14 <http://valuenet/ontop/ref-patient> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T3 a <http://valuenet/ontop/medication> . ?T14 <http://valuenet/ontop/ref-medication> ?T3 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/name> ?T3_name . FILTER(?T3_name = 'Procrastin-X') . } } }
Find the number of patients who are not using the medication of Procrastin-X.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :patient . ?T1 :ssn ?T1_ssn . FILTER(?T1_ssn not in (?T23_name)) . {SELECT ?T22_patient WHERE { ?T22 a :prescribes . ?T23 a :medication . ?T22 :ref-medication ?T23 . ?T22 :patient ?T22_patient . ?T23 :name ?T23_name . FILTER(?T23_name = 'Procrastin-X') . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/patient> . ?T1 <http://valuenet/ontop/ssn> ?T1_ssn . FILTER(?T1_ssn not in (?T23_name)) . {SELECT ?T22_patient WHERE { ?T22 a <http://valuenet/ontop/prescribes> . ?T23 a <http://valuenet/ontop/medication> . ?T22 <http://valuenet/ontop/ref-medication> ?T23 . ?T22 <http://valuenet/ontop/patient> ?T22_patient . ?T23 <http://valuenet/ontop/name> ?T23_name . FILTER(?T23_name = 'Procrastin-X') . } } }
Count how many appointments have been made in total.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :appointment . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/appointment> . }
