nl_question,sparql_partial_uri,sparql_complete_uri
Display the first name and department name for each employee.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T2_department_name WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :ref-department ?T2 . ?T1 :first_name ?T1_first_name . ?T2 :department_name ?T2_department_name . }",SELECT ?T1_first_name ?T2_department_name WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T2 a <http://valuenet/ontop/departments> . ?T1 <http://valuenet/ontop/ref-department> ?T2 . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T2 <http://valuenet/ontop/department_name> ?T2_department_name . }
"List the full name (first and last name), and salary for those employees who earn below 6000.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :salary ?T1_salary . ?T1 :salary ?T1_salary . FILTER(?T1_salary < 6000) . }",SELECT ?T1_first_name ?T1_last_name ?T1_salary WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/salary> ?T1_salary . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary < 6000) . }
"Display the first name, and department number for all employees whose last name is 'McEwen'.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_department_id WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :department_id ?T1_department_id . ?T1 :last_name ?T1_last_name . FILTER(?T1_last_name = 'McEwen') . }",SELECT ?T1_first_name ?T1_department_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . FILTER(?T1_last_name = 'McEwen') . }
Display all the information about the department Marketing.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :departments . ?T1 :department_name ?T1_department_name . FILTER(?T1_department_name = 'Marketing') . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/departments> . ?T1 <http://valuenet/ontop/department_name> ?T1_department_name . FILTER(?T1_department_name = 'Marketing') . }
"display the full name (first and last), hire date, salary, and department number for those employees whose first name does not containing the letter M.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_hire_date ?T1_salary ?T1_department_id WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :hire_date ?T1_hire_date . ?T1 :salary ?T1_salary . ?T1 :department_id ?T1_department_id . ?T1 :first_name ?T1_first_name . FILTER (contains(lcase(?T1_first_name), 'm') = FALSE) }","SELECT ?T1_first_name ?T1_last_name ?T1_hire_date ?T1_salary ?T1_department_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/hire_date> ?T1_hire_date . ?T1 <http://valuenet/ontop/salary> ?T1_salary . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . FILTER (contains(lcase(?T1_first_name), 'm') = FALSE) }"
Return the phone numbers of employees with salaries between 8000 and 12000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_phone_number WHERE { ?T1 a :employees . ?T1 :phone_number ?T1_phone_number . ?T1 :salary ?T1_salary . FILTER(?T1_salary >= 8000 && ?T1_salary <= 12000) . }",SELECT ?T1_phone_number WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/phone_number> ?T1_phone_number . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary >= 8000 && ?T1_salary <= 12000) . }
"Find job id and date of hire for those employees who was hired between November 5th, 2007 and July 5th, 2009.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_job_id ?T1_hire_date WHERE { ?T1 a :employees . ?T1 :job_id ?T1_job_id . ?T1 :hire_date ?T1_hire_date . ?T1 :hire_date ?T1_hire_date . FILTER(?T1_hire_date >= 2007-11-05 && ?T1_hire_date <= 2009-07-05) . }",SELECT ?T1_job_id ?T1_hire_date WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/job_id> ?T1_job_id . ?T1 <http://valuenet/ontop/hire_date> ?T1_hire_date . ?T1 <http://valuenet/ontop/hire_date> ?T1_hire_date . FILTER(?T1_hire_date >= 2007-11-05 && ?T1_hire_date <= 2009-07-05) . }
display all the details from Employees table for those employees who was hired before 2002-06-21.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :employees . ?T1 :hire_date ?T1_hire_date . FILTER(?T1_hire_date < 2002-06-21) . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/hire_date> ?T1_hire_date . FILTER(?T1_hire_date < 2002-06-21) . }
display all the information for all employees who have the letters D or S in their first name and also arrange the result in descending order by salary.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :employees . ?T1 :salary ?T1_salary . ?T1 :first_name ?T1_first_name . ?T1 :first_name ?T1_first_name . FILTER(contains (?T1_first_name, 'D') || contains (?T1_first_name, 'S')) . } ORDER BY DESC (?T1_salary)","SELECT * WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/salary> ?T1_salary . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . FILTER(contains (?T1_first_name, 'D') || contains (?T1_first_name, 'S')) . } ORDER BY DESC (?T1_salary)"
"display those employees who joined after 7th September, 1987.","PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :employees . ?T1 :hire_date ?T1_hire_date . FILTER(?T1_hire_date > 1987-09-07) . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/hire_date> ?T1_hire_date . FILTER(?T1_hire_date > 1987-09-07) . }
display the job title of jobs which minimum salary is greater than 9000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_job_title WHERE { ?T1 a :jobs . ?T1 :job_title ?T1_job_title . ?T1 :min_salary ?T1_min_salary . FILTER(?T1_min_salary > 9000) . }",SELECT ?T1_job_title WHERE { ?T1 a <http://valuenet/ontop/jobs> . ?T1 <http://valuenet/ontop/job_title> ?T1_job_title . ?T1 <http://valuenet/ontop/min_salary> ?T1_min_salary . FILTER(?T1_min_salary > 9000) . }
display the country ID and number of cities for each country.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country_id (count( *) as ?aggregation_all) WHERE { ?T1 a :locations . ?T1 :country_id ?T1_country_id . } GROUP BY ?T1_country_id",SELECT ?T1_country_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/locations> . ?T1 <http://valuenet/ontop/country_id> ?T1_country_id . } GROUP BY ?T1_country_id
display the department name and number of employees in each of the department.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_department_name (count( *) as ?aggregation_all) WHERE { ?T1 a :departments . ?T2 a :employees . ?T2 :ref-department ?T1 . ?T1 :department_name ?T1_department_name . } GROUP BY ?T1_department_name",SELECT ?T1_department_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/departments> . ?T2 a <http://valuenet/ontop/employees> . ?T2 <http://valuenet/ontop/ref-department> ?T1 . ?T1 <http://valuenet/ontop/department_name> ?T1_department_name . } GROUP BY ?T1_department_name
display job title and average salary of employees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_job_title (avg( ?T2_salary) as ?aggregation_T2_salary_28 ) WHERE { ?T1 a :jobs . ?T2 a :employees . ?T2 :ref-job ?T1 . ?T1 :job_title ?T1_job_title . ?T2 :salary ?T2_salary . } GROUP BY ?T1_job_title",SELECT ?T1_job_title (avg( ?T2_salary) as ?aggregation_T2_salary_28 ) WHERE { ?T1 a <http://valuenet/ontop/jobs> . ?T2 a <http://valuenet/ontop/employees> . ?T2 <http://valuenet/ontop/ref-job> ?T1 . ?T1 <http://valuenet/ontop/job_title> ?T1_job_title . ?T2 <http://valuenet/ontop/salary> ?T2_salary . } GROUP BY ?T1_job_title
Provide the full names of employees earning more than the employee with id 163.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :salary ?T1_salary . FILTER(?T1_salary > (?T22_employee_id)) . {SELECT ?T22_salary WHERE { ?T22 a :employees . ?T22 :salary ?T22_salary . ?T22 :employee_id ?T22_employee_id . FILTER(?T22_employee_id = 163) . } } }",SELECT ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary > (?T22_employee_id)) . {SELECT ?T22_salary WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/salary> ?T22_salary . ?T22 <http://valuenet/ontop/employee_id> ?T22_employee_id . FILTER(?T22_employee_id = 163) . } } }
return the smallest salary for every departments.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_salary) as ?aggregation_T1_salary_22 ) ?T1_department_id WHERE { ?T1 a :employees . ?T1 :salary ?T1_salary . ?T1 :department_id ?T1_department_id . } GROUP BY ?T1_department_id",SELECT (min( ?T1_salary) as ?aggregation_T1_salary_22 ) ?T1_department_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/salary> ?T1_salary . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . } GROUP BY ?T1_department_id
Find the first name and last name and department id for those employees who earn such amount of salary which is the smallest salary of any of the departments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_department_id WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :department_id ?T1_department_id . ?T1 :salary ?T1_salary . FILTER(?T1_salary in (?aggregation_T22_salary_83)) . {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_83 ) WHERE { ?T22 a :employees . ?T22 :salary ?T22_salary . } } }",SELECT ?T1_first_name ?T1_last_name ?T1_department_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary in (?aggregation_T22_salary_83)) . {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_83 ) WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/salary> ?T22_salary . } } }
What are the full names and department ids for the lowest paid employees across all departments.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_department_id WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :department_id ?T1_department_id . ?T1 :salary ?T1_salary . FILTER(?T1_salary in (?aggregation_T22_salary_140)) . {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_140 ) WHERE { ?T22 a :employees . ?T22 :salary ?T22_salary . } } }",SELECT ?T1_first_name ?T1_last_name ?T1_department_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary in (?aggregation_T22_salary_140)) . {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_140 ) WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/salary> ?T22_salary . } } }
Find the employee id for all employees who earn more than the average salary.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_employee_id WHERE { ?T1 a :employees . ?T1 :employee_id ?T1_employee_id . ?T1 :salary ?T1_salary . FILTER(?T1_salary > (?aggregation_T22_salary_176)) . {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_176 ) WHERE { ?T22 a :employees . ?T22 :salary ?T22_salary . } } }",SELECT ?T1_employee_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/employee_id> ?T1_employee_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary > (?aggregation_T22_salary_176)) . {SELECT (avg( ?T22_salary) as ?aggregation_T22_salary_176 ) WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/salary> ?T22_salary . } } }
display the employee id and salary of all employees who report to Payam (first name).,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_employee_id ?T1_salary WHERE { ?T1 a :employees . ?T1 :employee_id ?T1_employee_id . ?T1 :salary ?T1_salary . ?T1 :manager_id ?T1_manager_id . FILTER(?T1_manager_id = (?T22_first_name)) . {SELECT ?T22_employee_id WHERE { ?T22 a :employees . ?T22 :employee_id ?T22_employee_id . ?T22 :first_name ?T22_first_name . FILTER(?T22_first_name = 'Payam') . } } }",SELECT ?T1_employee_id ?T1_salary WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/employee_id> ?T1_employee_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . ?T1 <http://valuenet/ontop/manager_id> ?T1_manager_id . FILTER(?T1_manager_id = (?T22_first_name)) . {SELECT ?T22_employee_id WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/employee_id> ?T22_employee_id . ?T22 <http://valuenet/ontop/first_name> ?T22_first_name . FILTER(?T22_first_name = 'Payam') . } } }
find the name of all departments that do actually have one or more employees assigned to them.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_department_name WHERE { ?T1 a :departments . ?T1 :department_name ?T1_department_name . }",SELECT DISTINCT ?T1_department_name WHERE { ?T1 a <http://valuenet/ontop/departments> . ?T1 <http://valuenet/ontop/department_name> ?T1_department_name . }
Find the job ID for those jobs which average salary is above 8000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_job_id WHERE { ?T1 a :employees . ?T1 :job_id ?T1_job_id . ?T1 :salary ?T1_salary . } GROUP BY ?T1_job_id HAVING(avg( ?T1_salary) > 8000)",SELECT ?T1_job_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/job_id> ?T1_job_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . } GROUP BY ?T1_job_id HAVING(avg( ?T1_salary) > 8000)
display the employee ID and job name for all those jobs in department 80.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_employee_id ?T2_job_title WHERE { ?T1 a :employees . ?T2 a :jobs . ?T1 :ref-job ?T2 . ?T1 :employee_id ?T1_employee_id . ?T2 :job_title ?T2_job_title . ?T1 :department_id ?T1_department_id . FILTER(?T1_department_id = 80) . }",SELECT ?T1_employee_id ?T2_job_title WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T2 a <http://valuenet/ontop/jobs> . ?T1 <http://valuenet/ontop/ref-job> ?T2 . ?T1 <http://valuenet/ontop/employee_id> ?T1_employee_id . ?T2 <http://valuenet/ontop/job_title> ?T2_job_title . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . FILTER(?T1_department_id = 80) . }
Give the first name and job id for all employees in the Finance department.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_job_id WHERE { ?T1 a :employees . ?T2 a :departments . ?T1 :ref-department ?T2 . ?T1 :first_name ?T1_first_name . ?T1 :job_id ?T1_job_id . ?T2 :department_name ?T2_department_name . FILTER(?T2_department_name = 'Finance') . }",SELECT ?T1_first_name ?T1_job_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T2 a <http://valuenet/ontop/departments> . ?T1 <http://valuenet/ontop/ref-department> ?T2 . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/job_id> ?T1_job_id . ?T2 <http://valuenet/ontop/department_name> ?T2_department_name . FILTER(?T2_department_name = 'Finance') . }
Find the ids of the employees who does not work in those departments where some employees works whose manager id within the range 100 and 200.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :employees . ?T1 :department_id ?T1_department_id . FILTER NOT EXISTS { ?T22 a :departments . ?T22 :department_id ?T1_department_id . ?T22 :manager_id ?T22_manager_id . FILTER (?T22_manager_id >= 100 && ?T22_manager_id <= 200) . } }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . FILTER NOT EXISTS { ?T22 a <http://valuenet/ontop/departments> . ?T22 <http://valuenet/ontop/department_id> ?T1_department_id . ?T22 <http://valuenet/ontop/manager_id> ?T22_manager_id . FILTER (?T22_manager_id >= 100 && ?T22_manager_id <= 200) . } }
display the employee name ( first name and last name ) and hire date for all employees in the same department as Clara.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_hire_date WHERE { ?T1 a :employees . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :hire_date ?T1_hire_date . ?T1 :department_id ?T1_department_id . FILTER(?T1_department_id = (?T22_first_name)) . {SELECT ?T22_department_id WHERE { ?T22 a :employees . ?T22 :department_id ?T22_department_id . ?T22 :first_name ?T22_first_name . FILTER(?T22_first_name = 'Clara') . } } }",SELECT ?T1_first_name ?T1_last_name ?T1_hire_date WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/hire_date> ?T1_hire_date . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . FILTER(?T1_department_id = (?T22_first_name)) . {SELECT ?T22_department_id WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/department_id> ?T22_department_id . ?T22 <http://valuenet/ontop/first_name> ?T22_first_name . FILTER(?T22_first_name = 'Clara') . } } }
display the employee number and name( first name and last name ) for all employees who work in a department with any employee whose name contains a ’T’.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_employee_id ?T1_first_name ?T1_last_name WHERE { ?T1 a :employees . ?T1 :employee_id ?T1_employee_id . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :department_id ?T1_department_id . FILTER(?T1_department_id in (?T22_first_name)) . {SELECT ?T22_department_id WHERE { ?T22 a :employees . ?T22 :department_id ?T22_department_id . ?T22 :first_name ?T22_first_name . FILTER(contains (?T22_first_name, 'T')) . } } }","SELECT ?T1_employee_id ?T1_first_name ?T1_last_name WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/employee_id> ?T1_employee_id . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . FILTER(?T1_department_id in (?T22_first_name)) . {SELECT ?T22_department_id WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/department_id> ?T22_department_id . ?T22 <http://valuenet/ontop/first_name> ?T22_first_name . FILTER(contains (?T22_first_name, 'T')) . } } }"
display the employee number and job id for all employees whose salary is smaller than any salary of those employees whose job title is MK_MAN.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_employee_id ?T1_job_id WHERE { ?T1 a :employees . ?T1 :employee_id ?T1_employee_id . ?T1 :job_id ?T1_job_id . ?T1 :salary ?T1_salary . FILTER(?T1_salary < (?T22_job_id)) . {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_71 ) WHERE { ?T22 a :employees . ?T22 :salary ?T22_salary . ?T22 :job_id ?T22_job_id . FILTER(?T22_job_id = 'MK_MAN') . } } }",SELECT ?T1_employee_id ?T1_job_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/employee_id> ?T1_employee_id . ?T1 <http://valuenet/ontop/job_id> ?T1_job_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary < (?T22_job_id)) . {SELECT (min( ?T22_salary) as ?aggregation_T22_salary_71 ) WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/salary> ?T22_salary . ?T22 <http://valuenet/ontop/job_id> ?T22_job_id . FILTER(?T22_job_id = 'MK_MAN') . } } }
"display the employee number, name( first name and last name ) and job title for all employees whose salary is more than any salary of those employees whose job title is PU_MAN.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_employee_id ?T1_first_name ?T1_last_name ?T1_job_id WHERE { ?T1 a :employees . ?T1 :employee_id ?T1_employee_id . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :job_id ?T1_job_id . ?T1 :salary ?T1_salary . FILTER(?T1_salary > (?T22_job_id)) . {SELECT (max( ?T22_salary) as ?aggregation_T22_salary_171 ) WHERE { ?T22 a :employees . ?T22 :salary ?T22_salary . ?T22 :job_id ?T22_job_id . FILTER(?T22_job_id = 'PU_MAN') . } } }",SELECT ?T1_employee_id ?T1_first_name ?T1_last_name ?T1_job_id WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/employee_id> ?T1_employee_id . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/job_id> ?T1_job_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . FILTER(?T1_salary > (?T22_job_id)) . {SELECT (max( ?T22_salary) as ?aggregation_T22_salary_171 ) WHERE { ?T22 a <http://valuenet/ontop/employees> . ?T22 <http://valuenet/ontop/salary> ?T22_salary . ?T22 <http://valuenet/ontop/job_id> ?T22_job_id . FILTER(?T22_job_id = 'PU_MAN') . } } }
display the department id and the total salary for those departments which contains at least two employees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_department_id (sum( ?T1_salary) as ?aggregation_T1_salary_199 ) WHERE { ?T1 a :employees . ?T1 :department_id ?T1_department_id . ?T1 :salary ?T1_salary . } GROUP BY ?T1_department_id HAVING(count( *) >= 2)",SELECT ?T1_department_id (sum( ?T1_salary) as ?aggregation_T1_salary_199 ) WHERE { ?T1 a <http://valuenet/ontop/employees> . ?T1 <http://valuenet/ontop/department_id> ?T1_department_id . ?T1 <http://valuenet/ontop/salary> ?T1_salary . } GROUP BY ?T1_department_id HAVING(count( *) >= 2)
