nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of authors.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/authors> . }
Count the number of institutions.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :inst . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/inst> . }
Count the number of total papers.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :papers . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/papers> . }
Find the titles of all the papers written by 'Jeremy Gibbons',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T2 a :authors . ?T13 :ref-auth ?T2 . ?T1 :title ?T1_title . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Jeremy' && ?T2_lname = 'Gibbons') . }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/authors> . ?T13 <http://valuenet/ontop/ref-auth> ?T2 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Jeremy' && ?T2_lname = 'Gibbons') . }
Which institution is the author 'Matthias Blume' belong to? Give me the name of the institution.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :inst . ?T13 a :authorship . ?T13 :ref-inst ?T1 . ?T1 :name ?T1_name . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . ?T2 a :authors . ?T13 :ref-auth ?T2 . ?T1 :name ?T1_name . ?T2 :fname ?T2_fname . ?T2 :lname ?T2_lname . FILTER(?T2_fname = 'Matthias' && ?T2_lname = 'Blume') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/inst> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-inst> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . ?T2 a <http://valuenet/ontop/authors> . ?T13 <http://valuenet/ontop/ref-auth> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/fname> ?T2_fname . ?T2 <http://valuenet/ontop/lname> ?T2_lname . FILTER(?T2_fname = 'Matthias' && ?T2_lname = 'Blume') . }
Who belong to the institution 'University of Oxford'? Show the first names and last names.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :ref-auth ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :name ?T2_name . ?T2 a :inst . ?T13 :ref-inst ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :name ?T2_name . FILTER(?T2_name = 'University of Oxford') . }",SELECT DISTINCT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-auth> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/inst> . ?T13 <http://valuenet/ontop/ref-inst> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'University of Oxford') . }
Who is the author of the paper titled 'Binders Unbound'? Give me the last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :ref-auth ?T1 . ?T1 :lname ?T1_lname . ?T2 :title ?T2_title . ?T2 a :papers . ?T13 :ref-paper ?T2 . ?T1 :lname ?T1_lname . ?T2 :title ?T2_title . FILTER(?T2_title = 'Binders Unbound') . }",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-auth> ?T1 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/title> ?T2_title . ?T2 a <http://valuenet/ontop/papers> . ?T13 <http://valuenet/ontop/ref-paper> ?T2 . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/title> ?T2_title . FILTER(?T2_title = 'Binders Unbound') . }
"Find the first and last name of the author(s) who wrote the paper 'Nameless, Painless'.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :ref-auth ?T1 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :title ?T2_title . ?T2 a :papers . ?T13 :ref-paper ?T2 . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T2 :title ?T2_title . FILTER(?T2_title = 'Nameless , Painless') . }","SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-auth> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/title> ?T2_title . ?T2 a <http://valuenet/ontop/papers> . ?T13 <http://valuenet/ontop/ref-paper> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T2 <http://valuenet/ontop/title> ?T2_title . FILTER(?T2_title = 'Nameless , Painless') . }"
List the titles of the papers whose authors are from the institution 'Indiana University'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_title WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :name ?T2_name . ?T2 a :inst . ?T13 :ref-inst ?T2 . ?T1 :title ?T1_title . ?T2 :name ?T2_name . FILTER(?T2_name = 'Indiana University') . }",SELECT DISTINCT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/inst> . ?T13 <http://valuenet/ontop/ref-inst> ?T2 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Indiana University') . }
Find the number of papers published by authors from the institution 'Tokohu University'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_91 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :name ?T2_name . ?T2 a :inst . ?T13 :ref-inst ?T2 . ?T1 :title ?T1_title . ?T2 :name ?T2_name . FILTER(?T2_name = 'Tokohu University') . }",SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_91 ) WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/inst> . ?T13 <http://valuenet/ontop/ref-inst> ?T2 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Tokohu University') . }
Find the number of papers published by the institution 'University of Pennsylvania'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_48 ) WHERE { ?T1 a :papers . ?T13 a :authorship . ?T13 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :name ?T2_name . ?T2 a :inst . ?T13 :ref-inst ?T2 . ?T1 :title ?T1_title . ?T2 :name ?T2_name . FILTER(?T2_name = 'University of Pennsylvania') . }",SELECT DISTINCT (count(DISTINCT ?T1_title) as ?aggregation_T1_title_48 ) WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/inst> . ?T13 <http://valuenet/ontop/ref-inst> ?T2 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'University of Pennsylvania') . }
Find papers whose second author has last name 'Turon' and is affiliated with an institution in the country 'USA'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :papers . ?T3 a :authorship . ?T3 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :country ?T2_country . ?T3 :authorder ?T3_authorder . ?T4 :lname ?T4_lname . ?T2 a :inst . ?T3 :ref-inst ?T2 . ?T1 :title ?T1_title . ?T2 :country ?T2_country . ?T3 :authorder ?T3_authorder . ?T4 :lname ?T4_lname . ?T4 a :authors . ?T3 :ref-auth ?T4 . ?T1 :title ?T1_title . ?T2 :country ?T2_country . ?T3 :authorder ?T3_authorder . ?T4 :lname ?T4_lname . FILTER(?T2_country = 'USA' && ?T3_authorder = 2 && ?T4_lname = 'Turon') . }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T3 a <http://valuenet/ontop/authorship> . ?T3 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T3 <http://valuenet/ontop/authorder> ?T3_authorder . ?T4 <http://valuenet/ontop/lname> ?T4_lname . ?T2 a <http://valuenet/ontop/inst> . ?T3 <http://valuenet/ontop/ref-inst> ?T2 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T3 <http://valuenet/ontop/authorder> ?T3_authorder . ?T4 <http://valuenet/ontop/lname> ?T4_lname . ?T4 a <http://valuenet/ontop/authors> . ?T3 <http://valuenet/ontop/ref-auth> ?T4 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T3 <http://valuenet/ontop/authorder> ?T3_authorder . ?T4 <http://valuenet/ontop/lname> ?T4_lname . FILTER(?T2_country = 'USA' && ?T3_authorder = 2 && ?T4_lname = 'Turon') . }
Which author has written the most papers? Find his or her last name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname (count( *) as ?aggregation_all) WHERE { ?T1 a :authors . ?T1 :lname ?T1_lname . } GROUP BY ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_lname (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . } GROUP BY ?T1_lname ORDER BY DESC (?aggregation_all) LIMIT 1
Retrieve the country that has published the most papers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :inst . ?T1 :country ?T1_country . } GROUP BY ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/inst> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1
Find the name of the organization that has published the largest number of papers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :inst . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/inst> . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the titles of the papers that contain the word 'ML'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :papers . ?T1 :title ?T1_title . ?T1 :title ?T1_title . FILTER(contains (?T1_title, 'ML')) . }","SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/title> ?T1_title . FILTER(contains (?T1_title, 'ML')) . }"
Which papers have the substring 'Database' in their titles? Show the titles of the papers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :papers . ?T1 :title ?T1_title . ?T1 :title ?T1_title . FILTER(contains (?T1_title, 'Database')) . }","SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T1 <http://valuenet/ontop/title> ?T1_title . FILTER(contains (?T1_title, 'Database')) . }"
Find the first names of all the authors who have written a paper with title containing the word 'Functional'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :authors . ?T13 a :authorship . ?T13 :ref-auth ?T1 . ?T1 :fname ?T1_fname . ?T2 :title ?T2_title . ?T2 a :papers . ?T13 :ref-paper ?T2 . ?T1 :fname ?T1_fname . ?T2 :title ?T2_title . FILTER(contains (?T2_title, 'Functional')) . }","SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T13 a <http://valuenet/ontop/authorship> . ?T13 <http://valuenet/ontop/ref-auth> ?T1 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/title> ?T2_title . ?T2 a <http://valuenet/ontop/papers> . ?T13 <http://valuenet/ontop/ref-paper> ?T2 . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T2 <http://valuenet/ontop/title> ?T2_title . FILTER(contains (?T2_title, 'Functional')) . }"
Retrieve the title of the paper that has the largest number of authors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :papers . ?T2 a :authorship . ?T2 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :authorder ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_27)) . {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_27 ) WHERE { ?T23 a :authorship . ?T23 :authorder ?T23_authorder . } } }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T2 a <http://valuenet/ontop/authorship> . ?T2 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/authorder> ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_27)) . {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_27 ) WHERE { ?T23 a <http://valuenet/ontop/authorship> . ?T23 <http://valuenet/ontop/authorder> ?T23_authorder . } } }
Which paper has the most authors? Give me the paper title.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_title WHERE { ?T1 a :papers . ?T2 a :authorship . ?T2 :ref-paper ?T1 . ?T1 :title ?T1_title . ?T2 :authorder ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_51)) . {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_51 ) WHERE { ?T23 a :authorship . ?T23 :authorder ?T23_authorder . } } }",SELECT ?T1_title WHERE { ?T1 a <http://valuenet/ontop/papers> . ?T2 a <http://valuenet/ontop/authorship> . ?T2 <http://valuenet/ontop/ref-paper> ?T1 . ?T1 <http://valuenet/ontop/title> ?T1_title . ?T2 <http://valuenet/ontop/authorder> ?T2_authorder . FILTER(?T2_authorder = (?aggregation_T23_authorder_51)) . {SELECT (max( ?T23_authorder) as ?aggregation_T23_authorder_51 ) WHERE { ?T23 a <http://valuenet/ontop/authorship> . ?T23 <http://valuenet/ontop/authorder> ?T23_authorder . } } }
Which authors have last name 'Ueno'? List their first names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :authors . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . FILTER(?T1_lname = 'Ueno') . }",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . FILTER(?T1_lname = 'Ueno') . }
Find the last name of the author with first name 'Amal'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :authors . ?T1 :lname ?T1_lname . ?T1 :fname ?T1_fname . FILTER(?T1_fname = 'Amal') . }",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/fname> ?T1_fname . FILTER(?T1_fname = 'Amal') . }
Find the first names of all the authors ordered in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname WHERE { ?T1 a :authors . ?T1 :fname ?T1_fname . ?T1 :fname ?T1_fname . } ORDER BY ASC (?T1_fname)",SELECT ?T1_fname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/fname> ?T1_fname . } ORDER BY ASC (?T1_fname)
Retrieve all the last names of authors in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lname WHERE { ?T1 a :authors . ?T1 :lname ?T1_lname . ?T1 :lname ?T1_lname . } ORDER BY ASC (?T1_lname)",SELECT ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . } ORDER BY ASC (?T1_lname)
Retrieve all the first and last names of authors in the alphabetical order of last names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_fname ?T1_lname WHERE { ?T1 a :authors . ?T1 :fname ?T1_fname . ?T1 :lname ?T1_lname . ?T1 :lname ?T1_lname . } ORDER BY ASC (?T1_lname)",SELECT ?T1_fname ?T1_lname WHERE { ?T1 a <http://valuenet/ontop/authors> . ?T1 <http://valuenet/ontop/fname> ?T1_fname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . ?T1 <http://valuenet/ontop/lname> ?T1_lname . } ORDER BY ASC (?T1_lname)
