nl_question,sparql_partial_uri,sparql_complete_uri
Find the names of all modern rooms with a base price below $160 and two beds.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . ?T1 :beds ?T1_beds . ?T1 :decor ?T1_decor . FILTER(?T1_baseprice < 160 && ?T1_beds = 2 && ?T1_decor = 'modern') . }",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . ?T1 <http://valuenet/ontop/beds> ?T1_beds . ?T1 <http://valuenet/ontop/decor> ?T1_decor . FILTER(?T1_baseprice < 160 && ?T1_beds = 2 && ?T1_decor = 'modern') . }
Find all the rooms that have a price higher than 160 and can accommodate more than 2 people. Report room names and ids.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname ?T1_roomid WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :roomid ?T1_roomid . ?T1 :baseprice ?T1_baseprice . ?T1 :maxoccupancy ?T1_maxoccupancy . FILTER(?T1_baseprice > 160 && ?T1_maxoccupancy > 2) . }",SELECT ?T1_roomname ?T1_roomid WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/roomid> ?T1_roomid . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . ?T1 <http://valuenet/ontop/maxoccupancy> ?T1_maxoccupancy . FILTER(?T1_baseprice > 160 && ?T1_maxoccupancy > 2) . }
Find the most popular room in the hotel. The most popular room is the room that had seen the largest number of reservations.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :ref-room ?T1 . ?T1 :roomname ?T1_roomname . } GROUP BY ?T1_roomname ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_roomname (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T2 a <http://valuenet/ontop/reservations> . ?T2 <http://valuenet/ontop/ref-room> ?T1 . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . } GROUP BY ?T1_roomname ORDER BY DESC (?aggregation_all) LIMIT 1
Find the number of kids staying in the rooms reserved by a person called ROY SWEAZ.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_kids WHERE { ?T1 a :reservations . ?T1 :kids ?T1_kids . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . FILTER(?T1_firstname = 'ROY' && ?T1_lastname = 'SWEAZY') . }",SELECT ?T1_kids WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T1 <http://valuenet/ontop/kids> ?T1_kids . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . FILTER(?T1_firstname = 'ROY' && ?T1_lastname = 'SWEAZY') . }
How many times does ROY SWEAZY has reserved a room.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reservations . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . FILTER(?T1_firstname = 'ROY' && ?T1_lastname = 'SWEAZY') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . FILTER(?T1_firstname = 'ROY' && ?T1_lastname = 'SWEAZY') . }
"Which room has the highest rate? List the room's full name, rate, check in and check out date.","PREFIX : <http://valuenet/ontop/>
SELECT ?T2_roomname ?T1_rate ?T1_checkin ?T1_checkout WHERE { ?T1 a :reservations . ?T2 a :rooms . ?T1 :ref-room ?T2 . ?T2 :roomname ?T2_roomname . ?T1 :rate ?T1_rate . ?T1 :checkin ?T1_checkin . ?T1 :checkout ?T1_checkout . } ORDER BY DESC (?T1_rate) LIMIT 1",SELECT ?T2_roomname ?T1_rate ?T1_checkin ?T1_checkout WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T2 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/ref-room> ?T2 . ?T2 <http://valuenet/ontop/roomname> ?T2_roomname . ?T1 <http://valuenet/ontop/rate> ?T1_rate . ?T1 <http://valuenet/ontop/checkin> ?T1_checkin . ?T1 <http://valuenet/ontop/checkout> ?T1_checkout . } ORDER BY DESC (?T1_rate) LIMIT 1
"Return the name, rate, check in and check out date for the room with the highest rate.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname ?T2_rate ?T2_checkin ?T2_checkout WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :ref-room ?T1 . ?T1 :roomname ?T1_roomname . ?T2 :rate ?T2_rate . ?T2 :checkin ?T2_checkin . ?T2 :checkout ?T2_checkout . ?T2 :rate ?T2_rate . } ORDER BY DESC (?T2_rate) LIMIT 1",SELECT ?T1_roomname ?T2_rate ?T2_checkin ?T2_checkout WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T2 a <http://valuenet/ontop/reservations> . ?T2 <http://valuenet/ontop/ref-room> ?T1 . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T2 <http://valuenet/ontop/rate> ?T2_rate . ?T2 <http://valuenet/ontop/checkin> ?T2_checkin . ?T2 <http://valuenet/ontop/checkout> ?T2_checkout . ?T2 <http://valuenet/ontop/rate> ?T2_rate . } ORDER BY DESC (?T2_rate) LIMIT 1
"Find the number of adults for the room reserved and checked in by CONRAD SELBIG on Oct 23, 2010.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_adults WHERE { ?T1 a :reservations . ?T1 :adults ?T1_adults . ?T1 :checkin ?T1_checkin . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . FILTER(?T1_checkin = '2010-10-23' && ?T1_firstname = 'CONRAD' && ?T1_lastname = 'SELBIG') . }",SELECT ?T1_adults WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T1 <http://valuenet/ontop/adults> ?T1_adults . ?T1 <http://valuenet/ontop/checkin> ?T1_checkin . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . FILTER(?T1_checkin = '2010-10-23' && ?T1_firstname = 'CONRAD' && ?T1_lastname = 'SELBIG') . }
"Return the number of kids for the room reserved and checked in by DAMIEN TRACHSEL on  Sep 21, 2010.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_kids WHERE { ?T1 a :reservations . ?T1 :kids ?T1_kids . ?T1 :checkin ?T1_checkin . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . FILTER(?T1_checkin = '2010-09-21' && ?T1_firstname = 'DAMIEN' && ?T1_lastname = 'TRACHSEL') . }",SELECT ?T1_kids WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T1 <http://valuenet/ontop/kids> ?T1_kids . ?T1 <http://valuenet/ontop/checkin> ?T1_checkin . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . FILTER(?T1_checkin = '2010-09-21' && ?T1_firstname = 'DAMIEN' && ?T1_lastname = 'TRACHSEL') . }
Find the total number of king beds available.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_beds) as ?aggregation_T1_beds_35 ) WHERE { ?T1 a :rooms . ?T1 :beds ?T1_beds . ?T1 :bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') . }",SELECT (sum( ?T1_beds) as ?aggregation_T1_beds_35 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/beds> ?T1_beds . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . FILTER(?T1_bedtype = 'King') . }
List the names and decor of rooms that have a king bed. Sort the list by their price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname ?T1_decor WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :decor ?T1_decor . ?T1 :baseprice ?T1_baseprice . ?T1 :bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') . } ORDER BY ASC (?T1_baseprice)",SELECT ?T1_roomname ?T1_decor WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/decor> ?T1_decor . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . FILTER(?T1_bedtype = 'King') . } ORDER BY ASC (?T1_baseprice)
Which room has cheapest base price? List the room's name and the base price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname ?T1_baseprice WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . ?T1 :baseprice ?T1_baseprice . } ORDER BY ASC (?T1_baseprice) LIMIT 1",SELECT ?T1_roomname ?T1_baseprice WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } ORDER BY ASC (?T1_baseprice) LIMIT 1
Return the decor of the room named 'Recluse and defiance'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_decor WHERE { ?T1 a :rooms . ?T1 :decor ?T1_decor . ?T1 :roomname ?T1_roomname . FILTER(?T1_roomname = 'Recluse && defiance') . }",SELECT ?T1_decor WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/decor> ?T1_decor . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . FILTER(?T1_roomname = 'Recluse && defiance') . }
What is the average base price of different bed type? List bed type and average base price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_184 ) WHERE { ?T1 a :rooms . ?T1 :bedtype ?T1_bedtype . ?T1 :baseprice ?T1_baseprice . } GROUP BY ?T1_bedtype",SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_184 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } GROUP BY ?T1_bedtype
"For each bed type, find the average base price of different bed type.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_96 ) WHERE { ?T1 a :rooms . ?T1 :bedtype ?T1_bedtype . ?T1 :baseprice ?T1_baseprice . } GROUP BY ?T1_bedtype",SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_96 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } GROUP BY ?T1_bedtype
List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :reservations . ?T1 :adults ?T1_adults . ?T1 :kids ?T1_kids . ?T2 a :rooms . ?T1 :ref-room ?T2 . ?T2 :maxoccupancy ?T2_maxoccupancy . BIND(?T1_adults +?T1_kids as ?total) FILTER(?T2_maxoccupancy = ?total) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T1 <http://valuenet/ontop/adults> ?T1_adults . ?T1 <http://valuenet/ontop/kids> ?T1_kids . ?T2 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/ref-room> ?T2 . ?T2 <http://valuenet/ontop/maxoccupancy> ?T2_maxoccupancy . BIND(?T1_adults +?T1_kids as ?total) FILTER(?T2_maxoccupancy = ?total) . }
Find the first and last names of people who payed more than the rooms' base prices.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a :reservations . ?T2 a :rooms . ?T1 :ref-room ?T2 . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . ?T1 :rate ?T1_rate . ?T2 :baseprice ?T2_baseprice . FILTER(?T1_rate - ?T2_baseprice > 0) . }",SELECT ?T1_firstname ?T1_lastname WHERE { ?T1 a <http://valuenet/ontop/reservations> . ?T2 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/ref-room> ?T2 . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . ?T1 <http://valuenet/ontop/rate> ?T1_rate . ?T2 <http://valuenet/ontop/baseprice> ?T2_baseprice . FILTER(?T1_rate - ?T2_baseprice > 0) . }
Find the number of rooms with a king bed.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . FILTER(?T1_bedtype = 'King') . }
Find the number of rooms for each bed type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bedtype (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :bedtype ?T1_bedtype . } GROUP BY ?T1_bedtype",SELECT ?T1_bedtype (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . } GROUP BY ?T1_bedtype
Find the name of the room with the maximum occupancy.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :maxoccupancy ?T1_maxoccupancy . } ORDER BY DESC (?T1_maxoccupancy) LIMIT 1",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/maxoccupancy> ?T1_maxoccupancy . } ORDER BY DESC (?T1_maxoccupancy) LIMIT 1
Find the id and name of the most expensive base price room.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomid ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomid ?T1_roomid . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . } ORDER BY DESC (?T1_baseprice) LIMIT 1",SELECT ?T1_roomid ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomid> ?T1_roomid . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } ORDER BY DESC (?T1_baseprice) LIMIT 1
List the type of bed and name of all traditional rooms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname ?T1_bedtype WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :bedtype ?T1_bedtype . ?T1 :decor ?T1_decor . FILTER(?T1_decor = 'traditional') . }",SELECT ?T1_roomname ?T1_bedtype WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . ?T1 <http://valuenet/ontop/decor> ?T1_decor . FILTER(?T1_decor = 'traditional') . }
Find the number of rooms with king bed for each decor type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :decor ?T1_decor . ?T1 :bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King') . } GROUP BY ?T1_decor",SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/decor> ?T1_decor . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . FILTER(?T1_bedtype = 'King') . } GROUP BY ?T1_decor
Find the average and minimum price of the rooms in different decor.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_decor (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_99 ) (min( ?T1_baseprice) as ?aggregation_T1_baseprice_25 ) WHERE { ?T1 a :rooms . ?T1 :decor ?T1_decor . ?T1 :baseprice ?T1_baseprice . ?T1 :baseprice ?T1_baseprice . } GROUP BY ?T1_decor",SELECT ?T1_decor (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_99 ) (min( ?T1_baseprice) as ?aggregation_T1_baseprice_25 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/decor> ?T1_decor . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } GROUP BY ?T1_decor
What is the average minimum and price of the rooms for each different decor.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_decor (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_130 ) (min( ?T1_baseprice) as ?aggregation_T1_baseprice_127 ) WHERE { ?T1 a :rooms . ?T1 :decor ?T1_decor . ?T1 :baseprice ?T1_baseprice . ?T1 :baseprice ?T1_baseprice . } GROUP BY ?T1_decor",SELECT ?T1_decor (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_130 ) (min( ?T1_baseprice) as ?aggregation_T1_baseprice_127 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/decor> ?T1_decor . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } GROUP BY ?T1_decor
List the name of all rooms sorted by their prices.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . } ORDER BY ASC (?T1_baseprice)",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } ORDER BY ASC (?T1_baseprice)
Find the number of rooms with price higher than 120 for different decor.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :decor ?T1_decor . ?T1 :baseprice ?T1_baseprice . FILTER(?T1_baseprice > 120) . } GROUP BY ?T1_decor",SELECT ?T1_decor (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/decor> ?T1_decor . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . FILTER(?T1_baseprice > 120) . } GROUP BY ?T1_decor
"For each bed type, find the average room price.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_95 ) WHERE { ?T1 a :rooms . ?T1 :bedtype ?T1_bedtype . ?T1 :baseprice ?T1_baseprice . } GROUP BY ?T1_bedtype",SELECT ?T1_bedtype (avg( ?T1_baseprice) as ?aggregation_T1_baseprice_95 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . } GROUP BY ?T1_bedtype
List the name of rooms with king or queen bed.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :bedtype ?T1_bedtype . ?T1 :bedtype ?T1_bedtype . FILTER(?T1_bedtype = 'King' || ?T1_bedtype = 'Queen') . }",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . FILTER(?T1_bedtype = 'King' || ?T1_bedtype = 'Queen') . }
Find the number of distinct bed types available in this inn.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_bedtype) as ?aggregation_T1_bedtype_132 ) WHERE { ?T1 a :rooms . ?T1 :bedtype ?T1_bedtype . }",SELECT DISTINCT (count(DISTINCT ?T1_bedtype) as ?aggregation_T1_bedtype_132 ) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/bedtype> ?T1_bedtype . }
Find the name of rooms whose price is higher than the average price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . FILTER(?T1_baseprice > (?aggregation_T22_baseprice_11)) . {SELECT (avg( ?T22_baseprice) as ?aggregation_T22_baseprice_11 ) WHERE { ?T22 a :rooms . ?T22 :baseprice ?T22_baseprice . } } }",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . FILTER(?T1_baseprice > (?aggregation_T22_baseprice_11)) . {SELECT (avg( ?T22_baseprice) as ?aggregation_T22_baseprice_11 ) WHERE { ?T22 a <http://valuenet/ontop/rooms> . ?T22 <http://valuenet/ontop/baseprice> ?T22_baseprice . } } }
What are the name of rooms that cost more than the average.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . FILTER(?T1_baseprice > (?aggregation_T22_baseprice_105)) . {SELECT (avg( ?T22_baseprice) as ?aggregation_T22_baseprice_105 ) WHERE { ?T22 a :rooms . ?T22 :baseprice ?T22_baseprice . } } }",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . FILTER(?T1_baseprice > (?aggregation_T22_baseprice_105)) . {SELECT (avg( ?T22_baseprice) as ?aggregation_T22_baseprice_105 ) WHERE { ?T22 a <http://valuenet/ontop/rooms> . ?T22 <http://valuenet/ontop/baseprice> ?T22_baseprice . } } }
Find the number of rooms that do not have any reservation.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :rooms . ?T1 :roomid ?T1_roomid . FILTER(?T1_roomid not in (?T22_room)) . {SELECT DISTINCT ?T22_room WHERE { ?T22 a :reservations . ?T22 :room ?T22_room . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomid> ?T1_roomid . FILTER(?T1_roomid not in (?T22_room)) . {SELECT DISTINCT ?T22_room WHERE { ?T22 a <http://valuenet/ontop/reservations> . ?T22 <http://valuenet/ontop/room> ?T22_room . } } }
Return the name and number of reservations made for each of the rooms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname (count( *) as ?aggregation_all) ?T2_room WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :ref-room ?T1 . ?T1 :roomname ?T1_roomname . ?T2 :room ?T2_room . } GROUP BY ?T1_roomname ?T2_room",SELECT ?T1_roomname (count( *) as ?aggregation_all) ?T2_room WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T2 a <http://valuenet/ontop/reservations> . ?T2 <http://valuenet/ontop/ref-room> ?T1 . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T2 <http://valuenet/ontop/room> ?T2_room . } GROUP BY ?T1_roomname ?T2_room
Find the names of rooms that have been reserved for more than 60 times.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :ref-room ?T1 . ?T1 :roomname ?T1_roomname . } GROUP BY ?T1_roomname HAVING(count( *) > 60)",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T2 a <http://valuenet/ontop/reservations> . ?T2 <http://valuenet/ontop/ref-room> ?T1 . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . } GROUP BY ?T1_roomname HAVING(count( *) > 60)
Find the name of rooms whose base price is between 120 and 150.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T1 :roomname ?T1_roomname . ?T1 :baseprice ?T1_baseprice . FILTER(?T1_baseprice >= 120 && ?T1_baseprice <= 150) . }",SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T1 <http://valuenet/ontop/baseprice> ?T1_baseprice . FILTER(?T1_baseprice >= 120 && ?T1_baseprice <= 150) . }
Find the name of rooms booked by some customers whose first name contains ROY.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_roomname WHERE { ?T1 a :rooms . ?T2 a :reservations . ?T2 :ref-room ?T1 . ?T1 :roomname ?T1_roomname . ?T2 :firstname ?T2_firstname . FILTER(contains (?T2_firstname, 'ROY')) . }","SELECT ?T1_roomname WHERE { ?T1 a <http://valuenet/ontop/rooms> . ?T2 a <http://valuenet/ontop/reservations> . ?T2 <http://valuenet/ontop/ref-room> ?T1 . ?T1 <http://valuenet/ontop/roomname> ?T1_roomname . ?T2 <http://valuenet/ontop/firstname> ?T2_firstname . FILTER(contains (?T2_firstname, 'ROY')) . }"
