nl_question,sparql_partial_uri,sparql_complete_uri
"List the method, date and amount of all the payments, in ascending order of date.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_payment_method_code ?T1_date_payment_made ?T1_amount_payment WHERE { ?T1 a :payments . ?T1 :payment_method_code ?T1_payment_method_code . ?T1 :date_payment_made ?T1_date_payment_made . ?T1 :amount_payment ?T1_amount_payment . ?T1 :date_payment_made ?T1_date_payment_made . } ORDER BY ASC (?T1_date_payment_made)",SELECT ?T1_payment_method_code ?T1_date_payment_made ?T1_amount_payment WHERE { ?T1 a <http://valuenet/ontop/payments> . ?T1 <http://valuenet/ontop/payment_method_code> ?T1_payment_method_code . ?T1 <http://valuenet/ontop/date_payment_made> ?T1_date_payment_made . ?T1 <http://valuenet/ontop/amount_payment> ?T1_amount_payment . ?T1 <http://valuenet/ontop/date_payment_made> ?T1_date_payment_made . } ORDER BY ASC (?T1_date_payment_made)
"Among all the claims, what is the settlement amount of the claim with the largest claim amount? List both the settlement amount and claim amount.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_amount_settled ?T1_amount_claimed WHERE { ?T1 a :claims . ?T1 :amount_settled ?T1_amount_settled . ?T1 :amount_claimed ?T1_amount_claimed . ?T1 :amount_claimed ?T1_amount_claimed . } ORDER BY DESC (?T1_amount_claimed) LIMIT 1",SELECT ?T1_amount_settled ?T1_amount_claimed WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/amount_settled> ?T1_amount_settled . ?T1 <http://valuenet/ontop/amount_claimed> ?T1_amount_claimed . ?T1 <http://valuenet/ontop/amount_claimed> ?T1_amount_claimed . } ORDER BY DESC (?T1_amount_claimed) LIMIT 1
"Among all the claims, which claims have a claimed amount larger than the average? List the date the claim was made and the date it was settled.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T1 :date_claim_made ?T1_date_claim_made . ?T1 :date_claim_settled ?T1_date_claim_settled . ?T1 :amount_claimed ?T1_amount_claimed . FILTER(?T1_amount_claimed > (?aggregation_T22_amount_claimed_24)) . {SELECT (avg( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_24 ) WHERE { ?T22 a :claims . ?T22 :amount_claimed ?T22_amount_claimed . } } }",SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . ?T1 <http://valuenet/ontop/date_claim_settled> ?T1_date_claim_settled . ?T1 <http://valuenet/ontop/amount_claimed> ?T1_amount_claimed . FILTER(?T1_amount_claimed > (?aggregation_T22_amount_claimed_24)) . {SELECT (avg( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_24 ) WHERE { ?T22 a <http://valuenet/ontop/claims> . ?T22 <http://valuenet/ontop/amount_claimed> ?T22_amount_claimed . } } }
"Give me the claim date, settlement date for all the claims whose claimed amount is larger than the average.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T1 :date_claim_made ?T1_date_claim_made . ?T1 :date_claim_settled ?T1_date_claim_settled . ?T1 :amount_claimed ?T1_amount_claimed . FILTER(?T1_amount_claimed > (?aggregation_T22_amount_claimed_47)) . {SELECT (avg( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_47 ) WHERE { ?T22 a :claims . ?T22 :amount_claimed ?T22_amount_claimed . } } }",SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . ?T1 <http://valuenet/ontop/date_claim_settled> ?T1_date_claim_settled . ?T1 <http://valuenet/ontop/amount_claimed> ?T1_amount_claimed . FILTER(?T1_amount_claimed > (?aggregation_T22_amount_claimed_47)) . {SELECT (avg( ?T22_amount_claimed) as ?aggregation_T22_amount_claimed_47 ) WHERE { ?T22 a <http://valuenet/ontop/claims> . ?T22 <http://valuenet/ontop/amount_claimed> ?T22_amount_claimed . } } }
"Among all the claims, which settlements have a claimed amount that is no more than the average? List the claim start date.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_claim_made WHERE { ?T1 a :claims . ?T1 :date_claim_made ?T1_date_claim_made . ?T1 :amount_settled ?T1_amount_settled . FILTER(?T1_amount_settled <= (?aggregation_T22_amount_settled_155)) . {SELECT (avg( ?T22_amount_settled) as ?aggregation_T22_amount_settled_155 ) WHERE { ?T22 a :claims . ?T22 :amount_settled ?T22_amount_settled . } } }",SELECT ?T1_date_claim_made WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . ?T1 <http://valuenet/ontop/amount_settled> ?T1_amount_settled . FILTER(?T1_amount_settled <= (?aggregation_T22_amount_settled_155)) . {SELECT (avg( ?T22_amount_settled) as ?aggregation_T22_amount_settled_155 ) WHERE { ?T22 a <http://valuenet/ontop/claims> . ?T22 <http://valuenet/ontop/amount_settled> ?T22_amount_settled . } } }
How many settlements does each claim correspond to? List the claim id and the number of settlements.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_claim_id (count( *) as ?aggregation_all) WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :ref-claim ?T1 . ?T1 :claim_id ?T1_claim_id . } GROUP BY ?T1_claim_id",SELECT ?T1_claim_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T2 a <http://valuenet/ontop/settlements> . ?T2 <http://valuenet/ontop/ref-claim> ?T1 . ?T1 <http://valuenet/ontop/claim_id> ?T1_claim_id . } GROUP BY ?T1_claim_id
How many settlements were made on the claim with the most recent claim settlement date? List the number and the claim id.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_claim_id WHERE { ?T1 a :settlements . ?T2 a :claims . ?T1 :ref-claim ?T2 . ?T2 :claim_id ?T2_claim_id . ?T2 :date_claim_settled ?T2_date_claim_settled . } GROUP BY ?T2_claim_id ORDER BY DESC (?T2_date_claim_settled) LIMIT 1",SELECT (count( *) as ?aggregation_all) ?T2_claim_id WHERE { ?T1 a <http://valuenet/ontop/settlements> . ?T2 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/ref-claim> ?T2 . ?T2 <http://valuenet/ontop/claim_id> ?T2_claim_id . ?T2 <http://valuenet/ontop/date_claim_settled> ?T2_date_claim_settled . } GROUP BY ?T2_claim_id ORDER BY DESC (?T2_date_claim_settled) LIMIT 1
Tell me the the date when the first claim was made.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_claim_made WHERE { ?T1 a :claims . ?T1 :date_claim_made ?T1_date_claim_made . ?T1 :date_claim_made ?T1_date_claim_made . } ORDER BY ASC (?T1_date_claim_made) LIMIT 1",SELECT ?T1_date_claim_made WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . } ORDER BY ASC (?T1_date_claim_made) LIMIT 1
Compute the total amount of settlement across all the settlements.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_amount_settled) as ?aggregation_T1_amount_settled_172 ) WHERE { ?T1 a :settlements . ?T1 :amount_settled ?T1_amount_settled . }",SELECT (sum( ?T1_amount_settled) as ?aggregation_T1_amount_settled_172 ) WHERE { ?T1 a <http://valuenet/ontop/settlements> . ?T1 <http://valuenet/ontop/amount_settled> ?T1_amount_settled . }
Who are the customers that had more than 1 policy? List the customer details and id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_details ?T1_customer_id WHERE { ?T1 a :customers . ?T2 a :customer_policies . ?T2 :ref-customer ?T1 . ?T1 :customer_details ?T1_customer_details . ?T1 :customer_id ?T1_customer_id . } GROUP BY ?T1_customer_details ?T1_customer_id HAVING(count( *) > 1)",SELECT ?T1_customer_details ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/customer_policies> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_details> ?T1_customer_details . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . } GROUP BY ?T1_customer_details ?T1_customer_id HAVING(count( *) > 1)
Tell me the the claim date and settlement date for each settlement case.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :settlements . ?T1 :date_claim_made ?T1_date_claim_made . ?T1 :date_claim_settled ?T1_date_claim_settled . }",SELECT ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a <http://valuenet/ontop/settlements> . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . ?T1 <http://valuenet/ontop/date_claim_settled> ?T1_date_claim_settled . }
Compute the total amount of payment processed.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_amount_payment) as ?aggregation_T1_amount_payment_58 ) WHERE { ?T1 a :payments . ?T1 :amount_payment ?T1_amount_payment . }",SELECT (sum( ?T1_amount_payment) as ?aggregation_T1_amount_payment_58 ) WHERE { ?T1 a <http://valuenet/ontop/payments> . ?T1 <http://valuenet/ontop/amount_payment> ?T1_amount_payment . }
Return the distinct customer details.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T1 :customer_details ?T1_customer_details . }",SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_details> ?T1_customer_details . }
Find the policy type the most customers choose.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :customer_policies . ?T1 :policy_type_code ?T1_policy_type_code . } GROUP BY ?T1_policy_type_code ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customer_policies> . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . } GROUP BY ?T1_policy_type_code ORDER BY DESC (?aggregation_all) LIMIT 1
Count the total number of settlements made.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :settlements . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/settlements> . }
"Which Payments were processed with Visa? List the payment Id, the date and the amount.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_payment_id ?T1_date_payment_made ?T1_amount_payment WHERE { ?T1 a :payments . ?T1 :payment_id ?T1_payment_id . ?T1 :date_payment_made ?T1_date_payment_made . ?T1 :amount_payment ?T1_amount_payment . ?T1 :payment_method_code ?T1_payment_method_code . FILTER(?T1_payment_method_code = 'Visa') . }",SELECT ?T1_payment_id ?T1_date_payment_made ?T1_amount_payment WHERE { ?T1 a <http://valuenet/ontop/payments> . ?T1 <http://valuenet/ontop/payment_id> ?T1_payment_id . ?T1 <http://valuenet/ontop/date_payment_made> ?T1_date_payment_made . ?T1 <http://valuenet/ontop/amount_payment> ?T1_amount_payment . ?T1 <http://valuenet/ontop/payment_method_code> ?T1_payment_method_code . FILTER(?T1_payment_method_code = 'Visa') . }
List the details of the customers who do not have any policies.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_customer_details as ?col1) WHERE { ?T1 a :customers . ?T1 :customer_details ?T1_customer_details . }} MINUS {SELECT (?T2_customer_details as ?col1) WHERE { ?T2 a :customers . ?T2 :customer_details ?T2_customer_details . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_customer_details as ?col1) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_details> ?T1_customer_details . }} MINUS {SELECT (?T2_customer_details as ?col1) WHERE { ?T2 a <http://valuenet/ontop/customers> . ?T2 <http://valuenet/ontop/customer_details> ?T2_customer_details . } } }
"List the date the claim was made, the date it was settled and the amount settled for all the claims which had exactly one settlement.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :ref-claim ?T1 . ?T1 :claim_id ?T1_claim_id . ?T1 :date_claim_made ?T1_date_claim_made . ?T1 :date_claim_settled ?T1_date_claim_settled . } GROUP BY ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled HAVING(count( *) = 1)",SELECT ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T2 a <http://valuenet/ontop/settlements> . ?T2 <http://valuenet/ontop/ref-claim> ?T1 . ?T1 <http://valuenet/ontop/claim_id> ?T1_claim_id . ?T1 <http://valuenet/ontop/date_claim_made> ?T1_date_claim_made . ?T1 <http://valuenet/ontop/date_claim_settled> ?T1_date_claim_settled . } GROUP BY ?T1_claim_id ?T1_date_claim_made ?T1_date_claim_settled HAVING(count( *) = 1)
Find the total claimed amount of all the claims.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_200 ) WHERE { ?T1 a :claims . ?T1 :amount_claimed ?T1_amount_claimed . }",SELECT (sum( ?T1_amount_claimed) as ?aggregation_T1_amount_claimed_200 ) WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T1 <http://valuenet/ontop/amount_claimed> ?T1_amount_claimed . }
