nl_question,sparql_partial_uri,sparql_complete_uri
Find all the phone numbers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :customer_phone ?T1_customer_phone . }",SELECT ?T1_customer_phone WHERE { ?T1 a <http://valuenet/ontop/available_policies> . ?T1 <http://valuenet/ontop/customer_phone> ?T1_customer_phone . }
Find the phone numbers of customers using the most common policy type among the available policies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_phone WHERE { ?T1 a :available_policies . ?T1 :customer_phone ?T1_customer_phone . ?T1 :policy_type_code ?T1_policy_type_code . FILTER(?T1_policy_type_code = (?T22_policy_type_code)) . {SELECT ?T22_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T22 a :available_policies . ?T22 :policy_type_code ?T22_policy_type_code . } GROUP BY ?T22_policy_type_code ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_customer_phone WHERE { ?T1 a <http://valuenet/ontop/available_policies> . ?T1 <http://valuenet/ontop/customer_phone> ?T1_customer_phone . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . FILTER(?T1_policy_type_code = (?T22_policy_type_code)) . {SELECT ?T22_policy_type_code (count( *) as ?aggregation_all) WHERE { ?T22 a <http://valuenet/ontop/available_policies> . ?T22 <http://valuenet/ontop/policy_type_code> ?T22_policy_type_code . } GROUP BY ?T22_policy_type_code ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Find the policy type used by more than 4 customers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T1 :policy_type_code ?T1_policy_type_code . } GROUP BY ?T1_policy_type_code HAVING(count( *) > 4)",SELECT ?T1_policy_type_code WHERE { ?T1 a <http://valuenet/ontop/available_policies> . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . } GROUP BY ?T1_policy_type_code HAVING(count( *) > 4)
Find the total and average amount of settlements.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_184 ) (avg( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_179 ) WHERE { ?T1 a :settlements . ?T1 :settlement_amount ?T1_settlement_amount . ?T1 :settlement_amount ?T1_settlement_amount . }",SELECT (sum( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_184 ) (avg( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_179 ) WHERE { ?T1 a <http://valuenet/ontop/settlements> . ?T1 <http://valuenet/ontop/settlement_amount> ?T1_settlement_amount . ?T1 <http://valuenet/ontop/settlement_amount> ?T1_settlement_amount . }
Return the sum and average of all settlement amounts.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_190 ) (avg( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_150 ) WHERE { ?T1 a :settlements . ?T1 :settlement_amount ?T1_settlement_amount . ?T1 :settlement_amount ?T1_settlement_amount . }",SELECT (sum( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_190 ) (avg( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_150 ) WHERE { ?T1 a <http://valuenet/ontop/settlements> . ?T1 <http://valuenet/ontop/settlement_amount> ?T1_settlement_amount . ?T1 <http://valuenet/ontop/settlement_amount> ?T1_settlement_amount . }
Find the name of services that have been used for more than 2 times in first notification of loss.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_service_name WHERE { ?T1 a :services . ?T2 a :first_notification_of_loss . ?T2 :ref-service ?T1 . ?T1 :service_name ?T1_service_name . } GROUP BY ?T1_service_name HAVING(count( *) > 2)",SELECT ?T1_service_name WHERE { ?T1 a <http://valuenet/ontop/services> . ?T2 a <http://valuenet/ontop/first_notification_of_loss> . ?T2 <http://valuenet/ontop/ref-service> ?T1 . ?T1 <http://valuenet/ontop/service_name> ?T1_service_name . } GROUP BY ?T1_service_name HAVING(count( *) > 2)
Find the claim that has the largest total settlement amount. Return the effective date of the claim.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_effective_date WHERE { ?T1 a :claims . ?T2 a :settlements . ?T2 :ref-claim ?T1 . ?T1 :effective_date ?T1_effective_date . ?T2 :settlement_amount ?T2_settlement_amount . } GROUP BY ?T1_effective_date ORDER BY DESC (sum( ?T2_settlement_amount)) LIMIT 1",SELECT ?T1_effective_date WHERE { ?T1 a <http://valuenet/ontop/claims> . ?T2 a <http://valuenet/ontop/settlements> . ?T2 <http://valuenet/ontop/ref-claim> ?T1 . ?T1 <http://valuenet/ontop/effective_date> ?T1_effective_date . ?T2 <http://valuenet/ontop/settlement_amount> ?T2_settlement_amount . } GROUP BY ?T1_effective_date ORDER BY DESC (sum( ?T2_settlement_amount)) LIMIT 1
Count the total number of policies used by the customer named 'Dayana Robel'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :ref-customer ?T2 . ?T2 :customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers_policies> . ?T2 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/ref-customer> ?T2 . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') . }
Which customer uses the most policies? Give me the customer name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :customers_policies . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . } GROUP BY ?T1_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/customers_policies> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . } GROUP BY ?T1_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1
Tell me the types of the policy used by the customer named 'Dayana Robel'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :ref-policy ?T1 . ?T1 :policy_type_code ?T1_policy_type_code . ?T2 :customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :ref-customer ?T2 . ?T1 :policy_type_code ?T1_policy_type_code . ?T2 :customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') . }",SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a <http://valuenet/ontop/available_policies> . ?T13 a <http://valuenet/ontop/customers_policies> . ?T13 <http://valuenet/ontop/ref-policy> ?T1 . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . ?T2 a <http://valuenet/ontop/customers> . ?T13 <http://valuenet/ontop/ref-customer> ?T2 . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . FILTER(?T2_customer_name = 'Dayana Robel') . }
List all the policy types used by the customer enrolled in the most policies.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a :available_policies . ?T13 a :customers_policies . ?T13 :ref-policy ?T1 . ?T1 :policy_type_code ?T1_policy_type_code . ?T2 :customer_name ?T2_customer_name . ?T2 a :customers . ?T13 :ref-customer ?T2 . ?T1 :policy_type_code ?T1_policy_type_code . ?T2 :customer_name ?T2_customer_name . FILTER(?T2_customer_name = (?T23_customer_name)) . {SELECT ?T23_customer_name (count( *) as ?aggregation_all) WHERE { ?T23 a :customers . ?T24 a :customers_policies . ?T24 :ref-customer ?T23 . ?T23 :customer_name ?T23_customer_name . } GROUP BY ?T23_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT DISTINCT ?T1_policy_type_code WHERE { ?T1 a <http://valuenet/ontop/available_policies> . ?T13 a <http://valuenet/ontop/customers_policies> . ?T13 <http://valuenet/ontop/ref-policy> ?T1 . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . ?T2 a <http://valuenet/ontop/customers> . ?T13 <http://valuenet/ontop/ref-customer> ?T2 . ?T1 <http://valuenet/ontop/policy_type_code> ?T1_policy_type_code . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . FILTER(?T2_customer_name = (?T23_customer_name)) . {SELECT ?T23_customer_name (count( *) as ?aggregation_all) WHERE { ?T23 a <http://valuenet/ontop/customers> . ?T24 a <http://valuenet/ontop/customers_policies> . ?T24 <http://valuenet/ontop/ref-customer> ?T23 . ?T23 <http://valuenet/ontop/customer_name> ?T23_customer_name . } GROUP BY ?T23_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1 } }
List all the services in the alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_service_name WHERE { ?T1 a :services . ?T1 :service_name ?T1_service_name . ?T1 :service_name ?T1_service_name . } ORDER BY ASC (?T1_service_name)",SELECT ?T1_service_name WHERE { ?T1 a <http://valuenet/ontop/services> . ?T1 <http://valuenet/ontop/service_name> ?T1_service_name . ?T1 <http://valuenet/ontop/service_name> ?T1_service_name . } ORDER BY ASC (?T1_service_name)
Count the total number of available services.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :services . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/services> . }
Find the names of users who do not have a first notification of loss record.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a :customers . ?T1 :customer_name ?T1_customer_name . }} MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a :customers . ?T2 :customer_name ?T2_customer_name . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_customer_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . }} MINUS {SELECT (?T2_customer_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/customers> . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . } } }
Find the IDs of customers whose name contains 'Diana'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_id WHERE { ?T1 a :customers . ?T1 :customer_id ?T1_customer_id . ?T1 :customer_name ?T1_customer_name . FILTER(contains (?T1_customer_name, 'Diana')) . }","SELECT ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . FILTER(contains (?T1_customer_name, 'Diana')) . }"
Find the maximum and minimum settlement amount.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_65 ) (min( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_164 ) WHERE { ?T1 a :settlements . ?T1 :settlement_amount ?T1_settlement_amount . ?T1 :settlement_amount ?T1_settlement_amount . }",SELECT (max( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_65 ) (min( ?T1_settlement_amount) as ?aggregation_T1_settlement_amount_164 ) WHERE { ?T1 a <http://valuenet/ontop/settlements> . ?T1 <http://valuenet/ontop/settlement_amount> ?T1_settlement_amount . ?T1 <http://valuenet/ontop/settlement_amount> ?T1_settlement_amount . }
Retrieve the open and close dates of all the policies associated with the customer whose name contains 'Diana',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_opened ?T1_date_closed WHERE { ?T1 a :customers_policies . ?T2 a :customers . ?T1 :ref-customer ?T2 . ?T1 :date_opened ?T1_date_opened . ?T1 :date_closed ?T1_date_closed . ?T2 :customer_name ?T2_customer_name . FILTER(contains (?T2_customer_name, 'Diana')) . }","SELECT ?T1_date_opened ?T1_date_closed WHERE { ?T1 a <http://valuenet/ontop/customers_policies> . ?T2 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/ref-customer> ?T2 . ?T1 <http://valuenet/ontop/date_opened> ?T1_date_opened . ?T1 <http://valuenet/ontop/date_closed> ?T1_date_closed . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . FILTER(contains (?T2_customer_name, 'Diana')) . }"
