nl_question,sparql_partial_uri,sparql_complete_uri
List the names of editors in ascending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY ASC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY ASC (?T1_age)
List the names of editors who are older than 25.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :name ?T1_name . ?T1 :age ?T1_age . FILTER(?T1_age > 25) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 25) . }
Show the names of editors of age either 24 or 25.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age = 24 || ?T1_age = 25) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age = 24 || ?T1_age = 25) . }
What are the different ages of editors? Show each age along with the number of editors of that age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T1 :age ?T1_age . } GROUP BY ?T1_age",SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T1 <http://valuenet/ontop/age> ?T1_age . } GROUP BY ?T1_age
Please show the most common age of editors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T1 :age ?T1_age . } GROUP BY ?T1_age ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_age (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T1 <http://valuenet/ontop/age> ?T1_age . } GROUP BY ?T1_age ORDER BY DESC (?aggregation_all) LIMIT 1
Show the distinct themes of journals.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_theme WHERE { ?T1 a :journal . ?T1 :theme ?T1_theme . }",SELECT DISTINCT ?T1_theme WHERE { ?T1 a <http://valuenet/ontop/journal> . ?T1 <http://valuenet/ontop/theme> ?T1_theme . }
Show the names of editors and the theme of journals for which they serve on committees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_theme WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :ref-editor ?T1 . ?T1 :name ?T1_name . ?T2 :theme ?T2_theme . ?T2 a :journal . ?T13 :ref-journal ?T2 . ?T1 :name ?T1_name . ?T2 :theme ?T2_theme . }",SELECT ?T1_name ?T2_theme WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T13 a <http://valuenet/ontop/journal_committee> . ?T13 <http://valuenet/ontop/ref-editor> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/theme> ?T2_theme . ?T2 a <http://valuenet/ontop/journal> . ?T13 <http://valuenet/ontop/ref-journal> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/theme> ?T2_theme . }
"Show the names and ages of editors and the theme of journals for which they serve on committees, in ascending alphabetical order of theme.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_age ?T2_theme WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :ref-editor ?T1 . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T2 :theme ?T2_theme . ?T2 :theme ?T2_theme . ?T2 a :journal . ?T13 :ref-journal ?T2 . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T2 :theme ?T2_theme . ?T2 :theme ?T2_theme . } ORDER BY ASC (?T2_theme)",SELECT ?T1_name ?T1_age ?T2_theme WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T13 a <http://valuenet/ontop/journal_committee> . ?T13 <http://valuenet/ontop/ref-editor> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/theme> ?T2_theme . ?T2 <http://valuenet/ontop/theme> ?T2_theme . ?T2 a <http://valuenet/ontop/journal> . ?T13 <http://valuenet/ontop/ref-journal> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/theme> ?T2_theme . ?T2 <http://valuenet/ontop/theme> ?T2_theme . } ORDER BY ASC (?T2_theme)
Show the names of editors that are on the committee of journals with sales bigger than 3000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :editor . ?T13 a :journal_committee . ?T13 :ref-editor ?T1 . ?T1 :name ?T1_name . ?T2 :sales ?T2_sales . ?T2 a :journal . ?T13 :ref-journal ?T2 . ?T1 :name ?T1_name . ?T2 :sales ?T2_sales . FILTER(?T2_sales > 3000) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T13 a <http://valuenet/ontop/journal_committee> . ?T13 <http://valuenet/ontop/ref-editor> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/sales> ?T2_sales . ?T2 a <http://valuenet/ontop/journal> . ?T13 <http://valuenet/ontop/ref-journal> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/sales> ?T2_sales . FILTER(?T2_sales > 3000) . }
"Show the id, name of each editor and the number of journal committees they are on.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_editor_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :editor . ?T2 a :journal_committee . ?T2 :ref-editor ?T1 . ?T1 :editor_id ?T1_editor_id . ?T1 :name ?T1_name . } GROUP BY ?T1_editor_id ?T1_name",SELECT ?T1_editor_id ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T2 a <http://valuenet/ontop/journal_committee> . ?T2 <http://valuenet/ontop/ref-editor> ?T1 . ?T1 <http://valuenet/ontop/editor_id> ?T1_editor_id . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_editor_id ?T1_name
Show the names of editors that are on at least two journal committees.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :editor . ?T2 a :journal_committee . ?T2 :ref-editor ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T2 a <http://valuenet/ontop/journal_committee> . ?T2 <http://valuenet/ontop/ref-editor> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)
List the names of editors that are not on any journal committee.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :editor . ?T1 :name ?T1_name . ?T1 :editor_id ?T1_editor_id . FILTER(?T1_editor_id not in (?T22_editor_id)) . {SELECT ?T22_editor_id WHERE { ?T22 a :journal_committee . ?T22 :editor_id ?T22_editor_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/editor> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/editor_id> ?T1_editor_id . FILTER(?T1_editor_id not in (?T22_editor_id)) . {SELECT ?T22_editor_id WHERE { ?T22 a <http://valuenet/ontop/journal_committee> . ?T22 <http://valuenet/ontop/editor_id> ?T22_editor_id . } } }
"List the date, theme and sales of the journal which did not have any of the listed editors serving on committee.","PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_date as ?col1) (?T1_theme as ?col2) (?T1_sales as ?col3) WHERE { ?T1 a :journal . ?T1 :date ?T1_date . ?T1 :theme ?T1_theme . ?T1 :sales ?T1_sales . }} MINUS {SELECT (?T2_date as ?col1) (?T2_theme as ?col2) (?T2_sales as ?col3) WHERE { ?T2 a :journal . ?T2 :date ?T2_date . ?T2 :theme ?T2_theme . ?T2 :sales ?T2_sales . } } }",SELECT distinct?col1?col2?col3 WHERE { { SELECT (?T1_date as ?col1) (?T1_theme as ?col2) (?T1_sales as ?col3) WHERE { ?T1 a <http://valuenet/ontop/journal> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T1 <http://valuenet/ontop/sales> ?T1_sales . }} MINUS {SELECT (?T2_date as ?col1) (?T2_theme as ?col2) (?T2_sales as ?col3) WHERE { ?T2 a <http://valuenet/ontop/journal> . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 <http://valuenet/ontop/theme> ?T2_theme . ?T2 <http://valuenet/ontop/sales> ?T2_sales . } } }
