nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of bank branches.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :bank . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/bank> . }
Find the number of customers in the banks at New York City.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_57 ) WHERE { ?T1 a :bank . ?T1 :no_of_customers ?T1_no_of_customers . ?T1 :city ?T1_city . FILTER(?T1_city = 'New York City') . }",SELECT (sum( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_57 ) WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/no_of_customers> ?T1_no_of_customers . ?T1 <http://valuenet/ontop/city> ?T1_city . FILTER(?T1_city = 'New York City') . }
Find the average number of customers in all banks of Utah state.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_51 ) WHERE { ?T1 a :bank . ?T1 :no_of_customers ?T1_no_of_customers . ?T1 :state ?T1_state . FILTER(?T1_state = 'Utah') . }",SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_51 ) WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/no_of_customers> ?T1_no_of_customers . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_state = 'Utah') . }
Find the average number of customers cross all banks.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_144 ) WHERE { ?T1 a :bank . ?T1 :no_of_customers ?T1_no_of_customers . }",SELECT (avg( ?T1_no_of_customers) as ?aggregation_T1_no_of_customers_144 ) WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/no_of_customers> ?T1_no_of_customers . }
Find the city and state of the bank branch named morningside.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city ?T1_state WHERE { ?T1 a :bank . ?T1 :city ?T1_city . ?T1 :state ?T1_state . ?T1 :bname ?T1_bname . FILTER(?T1_bname = 'morningside') . }",SELECT ?T1_city ?T1_state WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/bname> ?T1_bname . FILTER(?T1_bname = 'morningside') . }
Find the branch names of banks in the New York state.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bname ?T1_bname . ?T1 :state ?T1_state . FILTER(?T1_state = 'New York') . }",SELECT ?T1_bname WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/bname> ?T1_bname . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_state = 'New York') . }
List the name of all customers sorted by their account balance in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :acc_bal ?T1_acc_bal . } ORDER BY ASC (?T1_acc_bal)",SELECT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/acc_bal> ?T1_acc_bal . } ORDER BY ASC (?T1_acc_bal)
List the name of all different customers who have some loan sorted by their total loan amount.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :ref-cust ?T1 . ?T1 :cust_name ?T1_cust_name . ?T2 :amount ?T2_amount . } GROUP BY ?T1_cust_name ORDER BY ASC (sum( ?T2_amount))",SELECT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T2 <http://valuenet/ontop/amount> ?T2_amount . } GROUP BY ?T1_cust_name ORDER BY ASC (sum( ?T2_amount))
"Find the state, account type, and credit score of the customer whose number of loan is 0.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_state ?T1_acc_type ?T1_credit_score WHERE { ?T1 a :customer . ?T1 :state ?T1_state . ?T1 :acc_type ?T1_acc_type . ?T1 :credit_score ?T1_credit_score . ?T1 :no_of_loans ?T1_no_of_loans . FILTER(?T1_no_of_loans = 0) . }",SELECT ?T1_state ?T1_acc_type ?T1_credit_score WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/acc_type> ?T1_acc_type . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . ?T1 <http://valuenet/ontop/no_of_loans> ?T1_no_of_loans . FILTER(?T1_no_of_loans = 0) . }
Find the number of different cities which banks are located at.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_139 ) WHERE { ?T1 a :bank . ?T1 :city ?T1_city . }",SELECT DISTINCT (count(DISTINCT ?T1_city) as ?aggregation_T1_city_139 ) WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/city> ?T1_city . }
Find the number of different states which banks are located at.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_state) as ?aggregation_T1_state_140 ) WHERE { ?T1 a :bank . ?T1 :state ?T1_state . }",SELECT DISTINCT (count(DISTINCT ?T1_state) as ?aggregation_T1_state_140 ) WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/state> ?T1_state . }
Count the number of different account types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_acc_type) as ?aggregation_T1_acc_type_136 ) WHERE { ?T1 a :customer . ?T1 :acc_type ?T1_acc_type . }",SELECT DISTINCT (count(DISTINCT ?T1_acc_type) as ?aggregation_T1_acc_type_136 ) WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/acc_type> ?T1_acc_type . }
Find the name and account balance of the customer whose name includes the letter ‘a’.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name ?T1_acc_bal WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :acc_bal ?T1_acc_bal . ?T1 :cust_name ?T1_cust_name . FILTER(contains (?T1_cust_name, 'a')) . }","SELECT ?T1_cust_name ?T1_acc_bal WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/acc_bal> ?T1_acc_bal . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . FILTER(contains (?T1_cust_name, 'a')) . }"
Find the total account balance of each customer from Utah or Texas.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_acc_bal) as ?aggregation_T1_acc_bal_1 ) WHERE { ?T1 a :customer . ?T1 :acc_bal ?T1_acc_bal . ?T1 :state ?T1_state . ?T1 :state ?T1_state . FILTER(?T1_state = 'Utah' || ?T1_state = 'Texas') . }",SELECT (sum( ?T1_acc_bal) as ?aggregation_T1_acc_bal_1 ) WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/acc_bal> ?T1_acc_bal . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_state = 'Utah' || ?T1_state = 'Texas') . }
Find the name of customers who have both saving and checking account types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :acc_type ?T1_acc_type . FILTER(?T1_acc_type = 'saving') . FILTER (?T1_cust_name in (?T2_cust_name)) . ?T2 a :customer . ?T2 :cust_name ?T2_cust_name . ?T2 :acc_type ?T2_acc_type . FILTER(?T2_acc_type = 'checking') . }",SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/acc_type> ?T1_acc_type . FILTER(?T1_acc_type = 'saving') . FILTER (?T1_cust_name in (?T2_cust_name)) . ?T2 a <http://valuenet/ontop/customer> . ?T2 <http://valuenet/ontop/cust_name> ?T2_cust_name . ?T2 <http://valuenet/ontop/acc_type> ?T2_acc_type . FILTER(?T2_acc_type = 'checking') . }
Find the name of customers who do not have an saving account.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . }} MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T2 :cust_name ?T2_cust_name . ?T2 :acc_type ?T2_acc_type . FILTER(?T2_acc_type = 'saving') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . }} MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/customer> . ?T2 <http://valuenet/ontop/cust_name> ?T2_cust_name . ?T2 <http://valuenet/ontop/acc_type> ?T2_acc_type . FILTER(?T2_acc_type = 'saving') . } } }
Find the name of customers who do not have a loan with a type of Mortgages.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . }} MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a :customer . ?T3 a :loan . ?T3 :ref-cust ?T2 . ?T2 :cust_name ?T2_cust_name . ?T3 :loan_type ?T3_loan_type . FILTER(?T3_loan_type = 'Mortgages') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_cust_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . }} MINUS {SELECT (?T2_cust_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/customer> . ?T3 a <http://valuenet/ontop/loan> . ?T3 <http://valuenet/ontop/ref-cust> ?T2 . ?T2 <http://valuenet/ontop/cust_name> ?T2_cust_name . ?T3 <http://valuenet/ontop/loan_type> ?T3_loan_type . FILTER(?T3_loan_type = 'Mortgages') . } } }
Find the name of customers who have loans of both Mortgages and Auto.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :ref-cust ?T1 . ?T1 :cust_name ?T1_cust_name . ?T2 :loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Mortgages') . FILTER (?T1_cust_name in (?T3_cust_name)) . ?T3 a :customer . ?T4 a :loan . ?T4 :ref-cust ?T3 . ?T3 :cust_name ?T3_cust_name . ?T4 :loan_type ?T4_loan_type . FILTER(?T4_loan_type = 'Auto') . }",SELECT DISTINCT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T2 <http://valuenet/ontop/loan_type> ?T2_loan_type . FILTER(?T2_loan_type = 'Mortgages') . FILTER (?T1_cust_name in (?T3_cust_name)) . ?T3 a <http://valuenet/ontop/customer> . ?T4 a <http://valuenet/ontop/loan> . ?T4 <http://valuenet/ontop/ref-cust> ?T3 . ?T3 <http://valuenet/ontop/cust_name> ?T3_cust_name . ?T4 <http://valuenet/ontop/loan_type> ?T4_loan_type . FILTER(?T4_loan_type = 'Auto') . }
Find the name of customers whose credit score is below the average credit scores of all customers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :credit_score ?T1_credit_score . FILTER(?T1_credit_score < (?aggregation_T22_credit_score_191)) . {SELECT (avg( ?T22_credit_score) as ?aggregation_T22_credit_score_191 ) WHERE { ?T22 a :customer . ?T22 :credit_score ?T22_credit_score . } } }",SELECT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . FILTER(?T1_credit_score < (?aggregation_T22_credit_score_191)) . {SELECT (avg( ?T22_credit_score) as ?aggregation_T22_credit_score_191 ) WHERE { ?T22 a <http://valuenet/ontop/customer> . ?T22 <http://valuenet/ontop/credit_score> ?T22_credit_score . } } }
Find the branch name of the bank that has the most number of customers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bname ?T1_bname . ?T1 :no_of_customers ?T1_no_of_customers . } ORDER BY DESC (?T1_no_of_customers) LIMIT 1",SELECT ?T1_bname WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/bname> ?T1_bname . ?T1 <http://valuenet/ontop/no_of_customers> ?T1_no_of_customers . } ORDER BY DESC (?T1_no_of_customers) LIMIT 1
Find the name of customer who has the lowest credit score.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :credit_score ?T1_credit_score . } ORDER BY ASC (?T1_credit_score) LIMIT 1",SELECT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . } ORDER BY ASC (?T1_credit_score) LIMIT 1
"Find the name, account type, and account balance of the customer who has the highest credit score.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name ?T1_acc_type ?T1_acc_bal WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :acc_type ?T1_acc_type . ?T1 :acc_bal ?T1_acc_bal . ?T1 :credit_score ?T1_credit_score . } ORDER BY DESC (?T1_credit_score) LIMIT 1",SELECT ?T1_cust_name ?T1_acc_type ?T1_acc_bal WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/acc_type> ?T1_acc_type . ?T1 <http://valuenet/ontop/acc_bal> ?T1_acc_bal . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . } ORDER BY DESC (?T1_credit_score) LIMIT 1
Find the state which has the most number of customers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_state WHERE { ?T1 a :bank . ?T1 :state ?T1_state . ?T1 :no_of_customers ?T1_no_of_customers . } GROUP BY ?T1_state ORDER BY DESC (sum( ?T1_no_of_customers)) LIMIT 1",SELECT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/no_of_customers> ?T1_no_of_customers . } GROUP BY ?T1_state ORDER BY DESC (sum( ?T1_no_of_customers)) LIMIT 1
"For each account type, find the average account balance of customers with credit score lower than 50.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_acc_bal) as ?aggregation_T1_acc_bal_77 ) ?T1_acc_type WHERE { ?T1 a :customer . ?T1 :acc_bal ?T1_acc_bal . ?T1 :acc_type ?T1_acc_type . ?T1 :credit_score ?T1_credit_score . FILTER(?T1_credit_score < 50) . } GROUP BY ?T1_acc_type",SELECT (avg( ?T1_acc_bal) as ?aggregation_T1_acc_bal_77 ) ?T1_acc_type WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/acc_bal> ?T1_acc_bal . ?T1 <http://valuenet/ontop/acc_type> ?T1_acc_type . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . FILTER(?T1_credit_score < 50) . } GROUP BY ?T1_acc_type
"For each state, find the total account balance of customers whose credit score is above 100.","PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_acc_bal) as ?aggregation_T1_acc_bal_118 ) ?T1_state WHERE { ?T1 a :customer . ?T1 :acc_bal ?T1_acc_bal . ?T1 :state ?T1_state . ?T1 :credit_score ?T1_credit_score . FILTER(?T1_credit_score > 100) . } GROUP BY ?T1_state",SELECT (sum( ?T1_acc_bal) as ?aggregation_T1_acc_bal_118 ) ?T1_state WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/acc_bal> ?T1_acc_bal . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . FILTER(?T1_credit_score > 100) . } GROUP BY ?T1_state
Find the total amount of loans offered by each bank branch.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_198 ) ?T2_bname WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :ref-branch ?T2 . ?T1 :amount ?T1_amount . ?T2 :bname ?T2_bname . } GROUP BY ?T2_bname",SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_198 ) ?T2_bname WHERE { ?T1 a <http://valuenet/ontop/loan> . ?T2 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/ref-branch> ?T2 . ?T1 <http://valuenet/ontop/amount> ?T1_amount . ?T2 <http://valuenet/ontop/bname> ?T2_bname . } GROUP BY ?T2_bname
Find the name of customers who have more than one loan.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :ref-cust ?T1 . ?T1 :cust_name ?T1_cust_name . } GROUP BY ?T1_cust_name HAVING(count( *) > 1)",SELECT ?T1_cust_name WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . } GROUP BY ?T1_cust_name HAVING(count( *) > 1)
Find the name and account balance of the customers who have loans with a total amount of more than 5000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cust_name ?T1_acc_type WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :ref-cust ?T1 . ?T1 :cust_name ?T1_cust_name . ?T1 :acc_type ?T1_acc_type . ?T2 :amount ?T2_amount . } GROUP BY ?T1_cust_name ?T1_acc_type HAVING(sum( ?T2_amount) > 5000)",SELECT ?T1_cust_name ?T1_acc_type WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/acc_type> ?T1_acc_type . ?T2 <http://valuenet/ontop/amount> ?T2_amount . } GROUP BY ?T1_cust_name ?T1_acc_type HAVING(sum( ?T2_amount) > 5000)
Find the name of bank branch that provided the greatest total amount of loans.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :ref-branch ?T1 . ?T1 :bname ?T1_bname . ?T2 :amount ?T2_amount . } GROUP BY ?T1_bname ORDER BY DESC (sum( ?T2_amount)) LIMIT 1",SELECT ?T1_bname WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-branch> ?T1 . ?T1 <http://valuenet/ontop/bname> ?T1_bname . ?T2 <http://valuenet/ontop/amount> ?T2_amount . } GROUP BY ?T1_bname ORDER BY DESC (sum( ?T2_amount)) LIMIT 1
Find the name of bank branches that provided some loans.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_bname WHERE { ?T1 a :bank . ?T1 :bname ?T1_bname . }",SELECT DISTINCT ?T1_bname WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/bname> ?T1_bname . }
Find the name and credit score of the customers who have some loans.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_cust_name ?T1_credit_score WHERE { ?T1 a :customer . ?T1 :cust_name ?T1_cust_name . ?T1 :credit_score ?T1_credit_score . }",SELECT DISTINCT ?T1_cust_name ?T1_credit_score WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/cust_name> ?T1_cust_name . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . }
Find the city and name of bank branches that provide business loans.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bname ?T1_city WHERE { ?T1 a :bank . ?T2 a :loan . ?T2 :ref-branch ?T1 . ?T1 :bname ?T1_bname . ?T1 :city ?T1_city . ?T2 :loan_type ?T2_loan_type . FILTER(?T2_loan_type = 'Business') . }",SELECT ?T1_bname ?T1_city WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-branch> ?T1 . ?T1 <http://valuenet/ontop/bname> ?T1_bname . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T2 <http://valuenet/ontop/loan_type> ?T2_loan_type . FILTER(?T2_loan_type = 'Business') . }
Find the names of bank branches that have provided a loan to any customer whose credit score is below 100.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_bname WHERE { ?T1 a :bank . ?T2 a :customer . ?T2 :ref-branch ?T1 . ?T1 :bname ?T1_bname . ?T2 :credit_score ?T2_credit_score . FILTER(?T2_credit_score < 100) . }",SELECT ?T1_bname WHERE { ?T1 a <http://valuenet/ontop/bank> . ?T2 a <http://valuenet/ontop/customer> . ?T2 <http://valuenet/ontop/ref-branch> ?T1 . ?T1 <http://valuenet/ontop/bname> ?T1_bname . ?T2 <http://valuenet/ontop/credit_score> ?T2_credit_score . FILTER(?T2_credit_score < 100) . }
Find the total amount of loans provided by bank branches in the state of New York.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_23 ) WHERE { ?T1 a :loan . ?T2 a :bank . ?T1 :ref-branch ?T2 . ?T1 :amount ?T1_amount . ?T2 :state ?T2_state . FILTER(?T2_state = 'New York') . }",SELECT (sum( ?T1_amount) as ?aggregation_T1_amount_23 ) WHERE { ?T1 a <http://valuenet/ontop/loan> . ?T2 a <http://valuenet/ontop/bank> . ?T1 <http://valuenet/ontop/ref-branch> ?T2 . ?T1 <http://valuenet/ontop/amount> ?T1_amount . ?T2 <http://valuenet/ontop/state> ?T2_state . FILTER(?T2_state = 'New York') . }
Find the average credit score of the customers who have some loan.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_168 ) WHERE { ?T1 a :customer . ?T2 a :loan . ?T2 :ref-cust ?T1 . ?T1 :credit_score ?T1_credit_score . ?T1 :cust_id ?T1_cust_id . }",SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_168 ) WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T2 a <http://valuenet/ontop/loan> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . ?T1 <http://valuenet/ontop/cust_id> ?T1_cust_id . }
Find the average credit score of the customers who do not have any loan.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_148 ) WHERE { ?T1 a :customer . ?T1 :credit_score ?T1_credit_score . ?T1 :cust_id ?T1_cust_id . FILTER(?T1_cust_id not in (?T22_cust_id)) . {SELECT ?T22_cust_id WHERE { ?T22 a :loan . ?T22 :cust_id ?T22_cust_id . } } }",SELECT (avg( ?T1_credit_score) as ?aggregation_T1_credit_score_148 ) WHERE { ?T1 a <http://valuenet/ontop/customer> . ?T1 <http://valuenet/ontop/credit_score> ?T1_credit_score . ?T1 <http://valuenet/ontop/cust_id> ?T1_cust_id . FILTER(?T1_cust_id not in (?T22_cust_id)) . {SELECT ?T22_cust_id WHERE { ?T22 a <http://valuenet/ontop/loan> . ?T22 <http://valuenet/ontop/cust_id> ?T22_cust_id . } } }
