nl_question,sparql_partial_uri,sparql_complete_uri
"How many events have each participants attended? List the participant id, type and the number.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_participant_id ?T1_participant_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :participants . ?T2 a :participants_in_events . ?T2 :ref-participant ?T1 . ?T1 :participant_id ?T1_participant_id . ?T1 :participant_type_code ?T1_participant_type_code . } GROUP BY ?T1_participant_id ?T1_participant_type_code",SELECT ?T1_participant_id ?T1_participant_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/participants> . ?T2 a <http://valuenet/ontop/participants_in_events> . ?T2 <http://valuenet/ontop/ref-participant> ?T1 . ?T1 <http://valuenet/ontop/participant_id> ?T1_participant_id . ?T1 <http://valuenet/ontop/participant_type_code> ?T1_participant_type_code . } GROUP BY ?T1_participant_id ?T1_participant_type_code
List the type of the services in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_service_type_code WHERE { ?T1 a :services . ?T1 :service_type_code ?T1_service_type_code . ?T1 :service_type_code ?T1_service_type_code . } ORDER BY ASC (?T1_service_type_code)",SELECT ?T1_service_type_code WHERE { ?T1 a <http://valuenet/ontop/services> . ?T1 <http://valuenet/ontop/service_type_code> ?T1_service_type_code . ?T1 <http://valuenet/ontop/service_type_code> ?T1_service_type_code . } ORDER BY ASC (?T1_service_type_code)
List the service id and details for the events.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_service_id ?T1_event_details WHERE { ?T1 a :events . ?T1 :service_id ?T1_service_id . ?T1 :event_details ?T1_event_details . }",SELECT ?T1_service_id ?T1_event_details WHERE { ?T1 a <http://valuenet/ontop/events> . ?T1 <http://valuenet/ontop/service_id> ?T1_service_id . ?T1 <http://valuenet/ontop/event_details> ?T1_event_details . }
How many events had participants whose details had the substring 'Dr.',"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :participants_in_events . ?T2 a :participants . ?T1 :ref-participant ?T2 . ?T2 :participant_details ?T2_participant_details . FILTER(contains (?T2_participant_details, 'Dr.')) . }","SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/participants_in_events> . ?T2 a <http://valuenet/ontop/participants> . ?T1 <http://valuenet/ontop/ref-participant> ?T2 . ?T2 <http://valuenet/ontop/participant_details> ?T2_participant_details . FILTER(contains (?T2_participant_details, 'Dr.')) . }"
