nl_question,sparql_partial_uri,sparql_complete_uri
How many residents does each property have? List property id and resident count.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_property_id (count( *) as ?aggregation_all) WHERE { ?T1 a :properties . ?T2 a :residents . ?T2 :ref-property ?T1 . ?T1 :property_id ?T1_property_id . } GROUP BY ?T1_property_id",SELECT ?T1_property_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/properties> . ?T2 a <http://valuenet/ontop/residents> . ?T2 <http://valuenet/ontop/ref-property> ?T1 . ?T1 <http://valuenet/ontop/property_id> ?T1_property_id . } GROUP BY ?T1_property_id
"List the id and type of each thing, and the details of the organization that owns it.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_thing_id ?T1_type_of_thing_code ?T2_organization_details WHERE { ?T1 a :things . ?T2 a :organizations . ?T1 :ref-organization ?T2 . ?T1 :thing_id ?T1_thing_id . ?T1 :type_of_thing_code ?T1_type_of_thing_code . ?T2 :organization_details ?T2_organization_details . }",SELECT ?T1_thing_id ?T1_type_of_thing_code ?T2_organization_details WHERE { ?T1 a <http://valuenet/ontop/things> . ?T2 a <http://valuenet/ontop/organizations> . ?T1 <http://valuenet/ontop/ref-organization> ?T2 . ?T1 <http://valuenet/ontop/thing_id> ?T1_thing_id . ?T1 <http://valuenet/ontop/type_of_thing_code> ?T1_type_of_thing_code . ?T2 <http://valuenet/ontop/organization_details> ?T2_organization_details . }
Which events have the number of notes between one and three? List the event id and the property id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_event_id ?T1_property_id WHERE { ?T1 a :customer_events . ?T2 a :customer_event_notes . ?T2 :ref-customer_event ?T1 . ?T1 :customer_event_id ?T1_customer_event_id . ?T1 :property_id ?T1_property_id . } GROUP BY ?T1_customer_event_id ?T1_property_id HAVING(count( *) >= 1 && count( *) <= 3)",SELECT ?T1_customer_event_id ?T1_property_id WHERE { ?T1 a <http://valuenet/ontop/customer_events> . ?T2 a <http://valuenet/ontop/customer_event_notes> . ?T2 <http://valuenet/ontop/ref-customer_event> ?T1 . ?T1 <http://valuenet/ontop/customer_event_id> ?T1_customer_event_id . ?T1 <http://valuenet/ontop/property_id> ?T1_property_id . } GROUP BY ?T1_customer_event_id ?T1_property_id HAVING(count( *) >= 1 && count( *) <= 3)
Which organizations are not a parent organization of others? List the organization id.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_organization_id as ?col1) WHERE { ?T1 a :organizations . ?T1 :organization_id ?T1_organization_id . }} MINUS {SELECT (?T2_parent_organization_id as ?col1) WHERE { ?T2 a :organizations . ?T2 :parent_organization_id ?T2_parent_organization_id . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_organization_id as ?col1) WHERE { ?T1 a <http://valuenet/ontop/organizations> . ?T1 <http://valuenet/ontop/organization_id> ?T1_organization_id . }} MINUS {SELECT (?T2_parent_organization_id as ?col1) WHERE { ?T2 a <http://valuenet/ontop/organizations> . ?T2 <http://valuenet/ontop/parent_organization_id> ?T2_parent_organization_id . } } }
List the customer event id and the corresponding move in date and property id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_event_id ?T1_date_moved_in ?T1_property_id WHERE { ?T1 a :customer_events . ?T1 :customer_event_id ?T1_customer_event_id . ?T1 :date_moved_in ?T1_date_moved_in . ?T1 :property_id ?T1_property_id . }",SELECT ?T1_customer_event_id ?T1_date_moved_in ?T1_property_id WHERE { ?T1 a <http://valuenet/ontop/customer_events> . ?T1 <http://valuenet/ontop/customer_event_id> ?T1_customer_event_id . ?T1 <http://valuenet/ontop/date_moved_in> ?T1_date_moved_in . ?T1 <http://valuenet/ontop/property_id> ?T1_property_id . }
