nl_question,sparql_partial_uri,sparql_complete_uri
What is the cmi cross reference id that is related to at least one council tax entry? List the cross reference id and source system code.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cmi_cross_ref_id ?T1_source_system_code WHERE { ?T1 a :cmi_cross_references . ?T2 a :council_tax . ?T2 :ref-cmi_cross_ref ?T1 . ?T1 :cmi_cross_ref_id ?T1_cmi_cross_ref_id . ?T1 :source_system_code ?T1_source_system_code . } GROUP BY ?T1_cmi_cross_ref_id ?T1_source_system_code HAVING(count( *) >= 1)",SELECT ?T1_cmi_cross_ref_id ?T1_source_system_code WHERE { ?T1 a <http://valuenet/ontop/cmi_cross_references> . ?T2 a <http://valuenet/ontop/council_tax> . ?T2 <http://valuenet/ontop/ref-cmi_cross_ref> ?T1 . ?T1 <http://valuenet/ontop/cmi_cross_ref_id> ?T1_cmi_cross_ref_id . ?T1 <http://valuenet/ontop/source_system_code> ?T1_source_system_code . } GROUP BY ?T1_cmi_cross_ref_id ?T1_source_system_code HAVING(count( *) >= 1)
"How many business rates are related to each cmi cross reference? List cross reference id, master customer id and the n","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cmi_cross_ref_id ?T1_master_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :cmi_cross_references . ?T2 a :business_rates . ?T2 :ref-cmi_cross_ref ?T1 . ?T1 :cmi_cross_ref_id ?T1_cmi_cross_ref_id . ?T1 :master_customer_id ?T1_master_customer_id . } GROUP BY ?T1_cmi_cross_ref_id ?T1_master_customer_id",SELECT ?T1_cmi_cross_ref_id ?T1_master_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/cmi_cross_references> . ?T2 a <http://valuenet/ontop/business_rates> . ?T2 <http://valuenet/ontop/ref-cmi_cross_ref> ?T1 . ?T1 <http://valuenet/ontop/cmi_cross_ref_id> ?T1_cmi_cross_ref_id . ?T1 <http://valuenet/ontop/master_customer_id> ?T1_master_customer_id . } GROUP BY ?T1_cmi_cross_ref_id ?T1_master_customer_id
"What is the tax source system code related to the benefits and overpayments? List the code and the benifit id, order by benifit id.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_source_system_code ?T2_council_tax_id WHERE { ?T1 a :cmi_cross_references . ?T2 a :benefits_overpayments . ?T2 :ref-cmi_cross_ref ?T1 . ?T1 :source_system_code ?T1_source_system_code . ?T2 :council_tax_id ?T2_council_tax_id . ?T2 :council_tax_id ?T2_council_tax_id . } ORDER BY ASC (?T2_council_tax_id)",SELECT ?T1_source_system_code ?T2_council_tax_id WHERE { ?T1 a <http://valuenet/ontop/cmi_cross_references> . ?T2 a <http://valuenet/ontop/benefits_overpayments> . ?T2 <http://valuenet/ontop/ref-cmi_cross_ref> ?T1 . ?T1 <http://valuenet/ontop/source_system_code> ?T1_source_system_code . ?T2 <http://valuenet/ontop/council_tax_id> ?T2_council_tax_id . ?T2 <http://valuenet/ontop/council_tax_id> ?T2_council_tax_id . } ORDER BY ASC (?T2_council_tax_id)
"List all information about customer master index, and sort them by details in descending order.","PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :customer_master_index . ?T1 :cmi_details ?T1_cmi_details . } ORDER BY DESC (?T1_cmi_details)",SELECT * WHERE { ?T1 a <http://valuenet/ontop/customer_master_index> . ?T1 <http://valuenet/ontop/cmi_details> ?T1_cmi_details . } ORDER BY DESC (?T1_cmi_details)
List the council tax ids and their related cmi cross references of all the parking fines.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_council_tax_id ?T1_cmi_cross_ref_id WHERE { ?T1 a :parking_fines . ?T1 :council_tax_id ?T1_council_tax_id . ?T1 :cmi_cross_ref_id ?T1_cmi_cross_ref_id . }",SELECT ?T1_council_tax_id ?T1_cmi_cross_ref_id WHERE { ?T1 a <http://valuenet/ontop/parking_fines> . ?T1 <http://valuenet/ontop/council_tax_id> ?T1_council_tax_id . ?T1 <http://valuenet/ontop/cmi_cross_ref_id> ?T1_cmi_cross_ref_id . }
