nl_question,sparql_partial_uri,sparql_complete_uri
List the names of technicians in ascending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY ASC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY ASC (?T1_age)
List the name of technicians whose team is not 'NYY'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :name ?T1_name . ?T1 :team ?T1_team . FILTER(?T1_team != 'NYY') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/team> ?T1_team . FILTER(?T1_team != 'NYY') . }
Show the name of technicians aged either 36 or 37,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age = 36 || ?T1_age = 37) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age = 36 || ?T1_age = 37) . }
Show different teams of technicians and the number of technicians in each team.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T1 :team ?T1_team . } GROUP BY ?T1_team",SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/team> ?T1_team . } GROUP BY ?T1_team
Please show the team that has the most number of technicians.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T1 :team ?T1_team . } GROUP BY ?T1_team ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/team> ?T1_team . } GROUP BY ?T1_team ORDER BY DESC (?aggregation_all) LIMIT 1
Show the team that have at least two technicians.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team WHERE { ?T1 a :technician . ?T1 :team ?T1_team . } GROUP BY ?T1_team HAVING(count( *) >= 2)",SELECT ?T1_team WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/team> ?T1_team . } GROUP BY ?T1_team HAVING(count( *) >= 2)
Show names of technicians and series of machines they are assigned to repair.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_machine_series WHERE { ?T1 a :technician . ?T13 a :repair_assignment . ?T13 :ref-technician ?T1 . ?T1 :name ?T1_name . ?T2 :machine_series ?T2_machine_series . ?T2 a :machine . ?T13 :ref-machine ?T2 . ?T1 :name ?T1_name . ?T2 :machine_series ?T2_machine_series . }",SELECT ?T1_name ?T2_machine_series WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T13 a <http://valuenet/ontop/repair_assignment> . ?T13 <http://valuenet/ontop/ref-technician> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/machine_series> ?T2_machine_series . ?T2 a <http://valuenet/ontop/machine> . ?T13 <http://valuenet/ontop/ref-machine> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/machine_series> ?T2_machine_series . }
Show names of technicians in ascending order of quality rank of the machine they are assigned.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :technician . ?T13 a :repair_assignment . ?T13 :ref-technician ?T1 . ?T1 :name ?T1_name . ?T2 :quality_rank ?T2_quality_rank . ?T2 a :machine . ?T13 :ref-machine ?T2 . ?T1 :name ?T1_name . ?T2 :quality_rank ?T2_quality_rank . } ORDER BY ASC (?T2_quality_rank)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T13 a <http://valuenet/ontop/repair_assignment> . ?T13 <http://valuenet/ontop/ref-technician> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/quality_rank> ?T2_quality_rank . ?T2 a <http://valuenet/ontop/machine> . ?T13 <http://valuenet/ontop/ref-machine> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/quality_rank> ?T2_quality_rank . } ORDER BY ASC (?T2_quality_rank)
Show names of technicians and the number of machines they are assigned to repair.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :technician . ?T2 a :repair_assignment . ?T2 :ref-technician ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T2 a <http://valuenet/ontop/repair_assignment> . ?T2 <http://valuenet/ontop/ref-technician> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
List the names of technicians who have not been assigned to repair machines.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :technician . ?T1 :name ?T1_name . ?T1 :technician-technician_id ?T1_technician_id . FILTER(?T1_technician_id not in (?T22_technician_id)) . {SELECT ?T22_technician_id WHERE { ?T22 a :repair_assignment . ?T22 :repair_assignment-technician_id ?T22_technician_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/technician-technician_id> ?T1_technician_id . FILTER(?T1_technician_id not in (?T22_technician_id)) . {SELECT ?T22_technician_id WHERE { ?T22 a <http://valuenet/ontop/repair_assignment> . ?T22 <http://valuenet/ontop/repair_assignment-technician_id> ?T22_technician_id . } } }
Show the starting years shared by technicians from team 'CLE' and 'CWS'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_starting_year WHERE { ?T1 a :technician . ?T1 :starting_year ?T1_starting_year . ?T1 :team ?T1_team . FILTER(?T1_team = 'CLE') . FILTER (?T1_starting_year in (?T2_starting_year)) . ?T2 a :technician . ?T2 :starting_year ?T2_starting_year . ?T2 :team ?T2_team . FILTER(?T2_team = 'CWS') . }",SELECT DISTINCT ?T1_starting_year WHERE { ?T1 a <http://valuenet/ontop/technician> . ?T1 <http://valuenet/ontop/starting_year> ?T1_starting_year . ?T1 <http://valuenet/ontop/team> ?T1_team . FILTER(?T1_team = 'CLE') . FILTER (?T1_starting_year in (?T2_starting_year)) . ?T2 a <http://valuenet/ontop/technician> . ?T2 <http://valuenet/ontop/starting_year> ?T2_starting_year . ?T2 <http://valuenet/ontop/team> ?T2_team . FILTER(?T2_team = 'CWS') . }
