nl_question,sparql_partial_uri,sparql_complete_uri
Return the name and id of the furniture with the highest market rate.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_furniture_id WHERE { ?T1 a :furniture . ?T1 :name ?T1_name . ?T1 :furniture_id ?T1_furniture_id . ?T1 :market_rate ?T1_market_rate . } ORDER BY DESC (?T1_market_rate) LIMIT 1",SELECT ?T1_name ?T1_furniture_id WHERE { ?T1 a <http://valuenet/ontop/furniture> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/furniture_id> ?T1_furniture_id . ?T1 <http://valuenet/ontop/market_rate> ?T1_market_rate . } ORDER BY DESC (?T1_market_rate) LIMIT 1
find the total market rate of the furnitures that have the top 2 market shares.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum(?t1_market_rate) as ?sum) WHERE{ SELECT ?t1_market_rate WHERE{?t1 a :furniture.?t1 :market_rate ?t1_market_rate . }ORDER BY DESC (?t1_market_rate) LIMIT 2}",SELECT (sum(?t1_market_rate) as ?sum) WHERE{ SELECT ?t1_market_rate WHERE{?t1 a :furniture.?t1 <http://valuenet/ontop/market_rate> ?t1_market_rate . }ORDER BY DESC (?t1_market_rate) LIMIT 2}
Find the component amounts and names of all furnitures that have more than 10 components.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_num_of_component ?T1_name WHERE { ?T1 a :furniture . ?T1 :num_of_component ?T1_num_of_component . ?T1 :name ?T1_name . ?T1 :num_of_component ?T1_num_of_component . FILTER(?T1_num_of_component > 10) . }",SELECT ?T1_num_of_component ?T1_name WHERE { ?T1 a <http://valuenet/ontop/furniture> . ?T1 <http://valuenet/ontop/num_of_component> ?T1_num_of_component . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/num_of_component> ?T1_num_of_component . FILTER(?T1_num_of_component > 10) . }
Find the name and component amount of the least popular furniture.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_num_of_component WHERE { ?T1 a :furniture . ?T1 :name ?T1_name . ?T1 :num_of_component ?T1_num_of_component . ?T1 :market_rate ?T1_market_rate . } ORDER BY ASC (?T1_market_rate) LIMIT 1",SELECT ?T1_name ?T1_num_of_component WHERE { ?T1 a <http://valuenet/ontop/furniture> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/num_of_component> ?T1_num_of_component . ?T1 <http://valuenet/ontop/market_rate> ?T1_market_rate . } ORDER BY ASC (?T1_market_rate) LIMIT 1
Find the names of furnitures whose prices are lower than the highest price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :furniture . ?T2 a :furniture_manufacte . ?T2 :ref-furniture ?T1 . ?T1 :name ?T1_name . ?T2 :price_in_dollar ?T2_price_in_dollar . FILTER(?T2_price_in_dollar < (?aggregation_T23_price_in_dollar_123)) . {SELECT (max( ?T23_price_in_dollar) as ?aggregation_T23_price_in_dollar_123 ) WHERE { ?T23 a :furniture_manufacte . ?T23 :price_in_dollar ?T23_price_in_dollar . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/furniture> . ?T2 a <http://valuenet/ontop/furniture_manufacte> . ?T2 <http://valuenet/ontop/ref-furniture> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/price_in_dollar> ?T2_price_in_dollar . FILTER(?T2_price_in_dollar < (?aggregation_T23_price_in_dollar_123)) . {SELECT (max( ?T23_price_in_dollar) as ?aggregation_T23_price_in_dollar_123 ) WHERE { ?T23 a <http://valuenet/ontop/furniture_manufacte> . ?T23 <http://valuenet/ontop/price_in_dollar> ?T23_price_in_dollar . } } }
Which manufacturer has the most number of shops? List its name and year of opening.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_open_year ?T1_name WHERE { ?T1 a :manufacturer . ?T1 :open_year ?T1_open_year . ?T1 :name ?T1_name . ?T1 :num_of_shops ?T1_num_of_shops . } ORDER BY DESC (?T1_num_of_shops) LIMIT 1",SELECT ?T1_open_year ?T1_name WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/num_of_shops> ?T1_num_of_shops . } ORDER BY DESC (?T1_num_of_shops) LIMIT 1
Find the average number of factories for the manufacturers that have more than 20 shops.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_num_of_factories) as ?aggregation_T1_num_of_factories_70 ) WHERE { ?T1 a :manufacturer . ?T1 :num_of_factories ?T1_num_of_factories . ?T1 :num_of_shops ?T1_num_of_shops . FILTER(?T1_num_of_shops > 20) . }",SELECT (avg( ?T1_num_of_factories) as ?aggregation_T1_num_of_factories_70 ) WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T1 <http://valuenet/ontop/num_of_factories> ?T1_num_of_factories . ?T1 <http://valuenet/ontop/num_of_shops> ?T1_num_of_shops . FILTER(?T1_num_of_shops > 20) . }
List all manufacturer names and ids ordered by their opening year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_manufacturer_id WHERE { ?T1 a :manufacturer . ?T1 :name ?T1_name . ?T1 :manufacturer_id ?T1_manufacturer_id . ?T1 :open_year ?T1_open_year . } ORDER BY ASC (?T1_open_year)",SELECT ?T1_name ?T1_manufacturer_id WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/manufacturer_id> ?T1_manufacturer_id . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . } ORDER BY ASC (?T1_open_year)
Give me the name and year of opening of the manufacturers that have either less than 10 factories or more than 10 shops.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_open_year WHERE { ?T1 a :manufacturer . ?T1 :name ?T1_name . ?T1 :open_year ?T1_open_year . ?T1 :num_of_shops ?T1_num_of_shops . ?T1 :num_of_factories ?T1_num_of_factories . FILTER(?T1_num_of_shops > 10 || ?T1_num_of_factories < 10) . }",SELECT ?T1_name ?T1_open_year WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . ?T1 <http://valuenet/ontop/num_of_shops> ?T1_num_of_shops . ?T1 <http://valuenet/ontop/num_of_factories> ?T1_num_of_factories . FILTER(?T1_num_of_shops > 10 || ?T1_num_of_factories < 10) . }
what is the average number of factories and maximum number of shops for manufacturers that opened before 1990.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_num_of_shops) as ?aggregation_T1_num_of_shops_12 ) (avg( ?T1_num_of_factories) as ?aggregation_T1_num_of_factories_19 ) WHERE { ?T1 a :manufacturer . ?T1 :num_of_shops ?T1_num_of_shops . ?T1 :num_of_factories ?T1_num_of_factories . ?T1 :open_year ?T1_open_year . FILTER(?T1_open_year < 1990) . }",SELECT (max( ?T1_num_of_shops) as ?aggregation_T1_num_of_shops_12 ) (avg( ?T1_num_of_factories) as ?aggregation_T1_num_of_factories_19 ) WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T1 <http://valuenet/ontop/num_of_shops> ?T1_num_of_shops . ?T1 <http://valuenet/ontop/num_of_factories> ?T1_num_of_factories . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . FILTER(?T1_open_year < 1990) . }
Find the id and number of shops for the company that produces the most expensive furniture.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_manufacturer_id ?T1_num_of_shops WHERE { ?T1 a :manufacturer . ?T2 a :furniture_manufacte . ?T2 :ref-manufacturer ?T1 . ?T1 :manufacturer_id ?T1_manufacturer_id . ?T1 :num_of_shops ?T1_num_of_shops . ?T2 :price_in_dollar ?T2_price_in_dollar . } ORDER BY DESC (?T2_price_in_dollar) LIMIT 1",SELECT ?T1_manufacturer_id ?T1_num_of_shops WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T2 a <http://valuenet/ontop/furniture_manufacte> . ?T2 <http://valuenet/ontop/ref-manufacturer> ?T1 . ?T1 <http://valuenet/ontop/manufacturer_id> ?T1_manufacturer_id . ?T1 <http://valuenet/ontop/num_of_shops> ?T1_num_of_shops . ?T2 <http://valuenet/ontop/price_in_dollar> ?T2_price_in_dollar . } ORDER BY DESC (?T2_price_in_dollar) LIMIT 1
Find the number of funiture types produced by each manufacturer as well as the company names.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :furniture_manufacte . ?T2 a :manufacturer . ?T1 :ref-manufacturer ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/furniture_manufacte> . ?T2 a <http://valuenet/ontop/manufacturer> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Give me the names and prices of furnitures which some companies are manufacturing.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_price_in_dollar WHERE { ?T1 a :furniture . ?T2 a :furniture_manufacte . ?T2 :ref-furniture ?T1 . ?T1 :name ?T1_name . ?T2 :price_in_dollar ?T2_price_in_dollar . }",SELECT ?T1_name ?T2_price_in_dollar WHERE { ?T1 a <http://valuenet/ontop/furniture> . ?T2 a <http://valuenet/ontop/furniture_manufacte> . ?T2 <http://valuenet/ontop/ref-furniture> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/price_in_dollar> ?T2_price_in_dollar . }
Find the market shares and names of furnitures which no any company is producing in our records.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_market_rate ?T1_name WHERE { ?T1 a :furniture . ?T1 :market_rate ?T1_market_rate . ?T1 :name ?T1_name . ?T1 :furniture_id ?T1_furniture_id . FILTER(?T1_furniture_id not in (?T22_furniture_id)) . {SELECT ?T22_furniture_id WHERE { ?T22 a :furniture_manufacte . ?T22 :furniture_id ?T22_furniture_id . } } }",SELECT ?T1_market_rate ?T1_name WHERE { ?T1 a <http://valuenet/ontop/furniture> . ?T1 <http://valuenet/ontop/market_rate> ?T1_market_rate . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/furniture_id> ?T1_furniture_id . FILTER(?T1_furniture_id not in (?T22_furniture_id)) . {SELECT ?T22_furniture_id WHERE { ?T22 a <http://valuenet/ontop/furniture_manufacte> . ?T22 <http://valuenet/ontop/furniture_id> ?T22_furniture_id . } } }
Find the name of the company that produces both furnitures with less than 6 components and furnitures with more than 10 components.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :manufacturer . ?T13 a :furniture_manufacte . ?T13 :ref-manufacturer ?T1 . ?T1 :name ?T1_name . ?T2 :num_of_component ?T2_num_of_component . ?T2 a :furniture . ?T13 :ref-furniture ?T2 . ?T1 :name ?T1_name . ?T2 :num_of_component ?T2_num_of_component . FILTER(?T2_num_of_component < 6) . FILTER (?T1_name in (?T3_name)) . ?T3 a :manufacturer . ?T15 a :furniture_manufacte . ?T15 :ref-manufacturer ?T3 . ?T3 :name ?T3_name . ?T4 :num_of_component ?T4_num_of_component . ?T4 a :furniture . ?T15 :ref-furniture ?T4 . ?T3 :name ?T3_name . ?T4 :num_of_component ?T4_num_of_component . FILTER(?T4_num_of_component > 10) . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/manufacturer> . ?T13 a <http://valuenet/ontop/furniture_manufacte> . ?T13 <http://valuenet/ontop/ref-manufacturer> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_component> ?T2_num_of_component . ?T2 a <http://valuenet/ontop/furniture> . ?T13 <http://valuenet/ontop/ref-furniture> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_component> ?T2_num_of_component . FILTER(?T2_num_of_component < 6) . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/manufacturer> . ?T15 a <http://valuenet/ontop/furniture_manufacte> . ?T15 <http://valuenet/ontop/ref-manufacturer> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/num_of_component> ?T4_num_of_component . ?T4 a <http://valuenet/ontop/furniture> . ?T15 <http://valuenet/ontop/ref-furniture> ?T4 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/num_of_component> ?T4_num_of_component . FILTER(?T4_num_of_component > 10) . }
