nl_question,sparql_partial_uri,sparql_complete_uri
Return the founder of Sony.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :founder ?T1_founder . ?T1 :name ?T1_name . FILTER(?T1_name = 'Sony') . }",SELECT ?T1_founder WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/founder> ?T1_founder . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(?T1_name = 'Sony') . }
"Find all manufacturers' names and their headquarters, sorted by the ones with highest revenue first.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . ?T1 :headquarter ?T1_headquarter . ?T1 :revenue ?T1_revenue . } ORDER BY DESC (?T1_revenue)",SELECT ?T1_name ?T1_headquarter WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . } ORDER BY DESC (?T1_revenue)
"Return the average, maximum, and total revenues across all manufacturers.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_revenue) as ?aggregation_T1_revenue_144 ) (max( ?T1_revenue) as ?aggregation_T1_revenue_195 ) (sum( ?T1_revenue) as ?aggregation_T1_revenue_161 ) WHERE { ?T1 a :manufacturers . ?T1 :revenue ?T1_revenue . ?T1 :revenue ?T1_revenue . ?T1 :revenue ?T1_revenue . }",SELECT (avg( ?T1_revenue) as ?aggregation_T1_revenue_144 ) (max( ?T1_revenue) as ?aggregation_T1_revenue_195 ) (sum( ?T1_revenue) as ?aggregation_T1_revenue_161 ) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . }
Return the number of companies created by Andy.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :manufacturers . ?T1 :founder ?T1_founder . FILTER(?T1_founder = 'Andy') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/founder> ?T1_founder . FILTER(?T1_founder = 'Andy') . }
Find the total revenue created by the companies whose headquarter is located at Austin.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_101 ) WHERE { ?T1 a :manufacturers . ?T1 :revenue ?T1_revenue . ?T1 :headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Austin') . }",SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_101 ) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . FILTER(?T1_headquarter = 'Austin') . }
Give the distinct headquarters of manufacturers.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_headquarter WHERE { ?T1 a :manufacturers . ?T1 :headquarter ?T1_headquarter . }",SELECT DISTINCT ?T1_headquarter WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . }
Find the number of manufactures that are based in Tokyo or Beijing.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :manufacturers . ?T1 :headquarter ?T1_headquarter . ?T1 :headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Beijing') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Beijing') . }
Find the founder of the company whose name begins with the letter 'S'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :founder ?T1_founder . ?T1 :name ?T1_name . FILTER(contains (?T1_name, 'S')) . }","SELECT ?T1_founder WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/founder> ?T1_founder . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(contains (?T1_name, 'S')) . }"
Find the name of companies whose revenue is between 100 and 150.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . ?T1 :revenue ?T1_revenue . FILTER(?T1_revenue >= 100 && ?T1_revenue <= 150) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . FILTER(?T1_revenue >= 100 && ?T1_revenue <= 150) . }
Return the total revenue of companies with headquarters in Tokyo or Taiwan.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_103 ) WHERE { ?T1 a :manufacturers . ?T1 :revenue ?T1_revenue . ?T1 :headquarter ?T1_headquarter . ?T1 :headquarter ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Taiwan') . }",SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_103 ) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . FILTER(?T1_headquarter = 'Tokyo' || ?T1_headquarter = 'Taiwan') . }
Find the name of product that is produced by both companies Creative Labs and Sony.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Creative Labs') . FILTER (?T1_name in (?T3_name)) . ?T3 a :products . ?T4 a :manufacturers . ?T3 :ref-manufacturer ?T4 . ?T3 :name ?T3_name . ?T4 :name ?T4_name . FILTER(?T4_name = 'Sony') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Creative Labs') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/products> . ?T4 a <http://valuenet/ontop/manufacturers> . ?T3 <http://valuenet/ontop/ref-manufacturer> ?T4 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/name> ?T4_name . FILTER(?T4_name = 'Sony') . }
"Find the name, headquarter and founder of the manufacturer that has the highest revenue.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_headquarter ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . ?T1 :headquarter ?T1_headquarter . ?T1 :founder ?T1_founder . ?T1 :revenue ?T1_revenue . } ORDER BY DESC (?T1_revenue) LIMIT 1",SELECT ?T1_name ?T1_headquarter ?T1_founder WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . ?T1 <http://valuenet/ontop/founder> ?T1_founder . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . } ORDER BY DESC (?T1_revenue) LIMIT 1
"Find the name, headquarter and revenue of all manufacturers sorted by their revenue in the descending order.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_headquarter ?T1_revenue WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . ?T1 :headquarter ?T1_headquarter . ?T1 :revenue ?T1_revenue . ?T1 :revenue ?T1_revenue . } ORDER BY DESC (?T1_revenue)",SELECT ?T1_name ?T1_headquarter ?T1_revenue WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/headquarter> ?T1_headquarter . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . } ORDER BY DESC (?T1_revenue)
Find the name of companies whose revenue is greater than the average revenue of all companies.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . ?T1 :revenue ?T1_revenue . FILTER(?T1_revenue > (?aggregation_T22_revenue_182)) . {SELECT (avg( ?T22_revenue) as ?aggregation_T22_revenue_182 ) WHERE { ?T22 a :manufacturers . ?T22 :revenue ?T22_revenue . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . FILTER(?T1_revenue > (?aggregation_T22_revenue_182)) . {SELECT (avg( ?T22_revenue) as ?aggregation_T22_revenue_182 ) WHERE { ?T22 a <http://valuenet/ontop/manufacturers> . ?T22 <http://valuenet/ontop/revenue> ?T22_revenue . } } }
Find the name of companies whose revenue is smaller than the revenue of all companies based in Austin.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . ?T1 :revenue ?T1_revenue . FILTER(?T1_revenue < (?T22_headquarter)) . {SELECT (min( ?T22_revenue) as ?aggregation_T22_revenue_43 ) WHERE { ?T22 a :manufacturers . ?T22 :revenue ?T22_revenue . ?T22 :headquarter ?T22_headquarter . FILTER(?T22_headquarter = 'Austin') . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . FILTER(?T1_revenue < (?T22_headquarter)) . {SELECT (min( ?T22_revenue) as ?aggregation_T22_revenue_43 ) WHERE { ?T22 a <http://valuenet/ontop/manufacturers> . ?T22 <http://valuenet/ontop/revenue> ?T22_revenue . ?T22 <http://valuenet/ontop/headquarter> ?T22_headquarter . FILTER(?T22_headquarter = 'Austin') . } } }
Find the total revenue of companies whose revenue is larger than the revenue of some companies based in Austin.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_121 ) WHERE { ?T1 a :manufacturers . ?T1 :revenue ?T1_revenue . ?T1 :revenue ?T1_revenue . FILTER(?T1_revenue > (?T22_headquarter)) . {SELECT (min( ?T22_revenue) as ?aggregation_T22_revenue_142 ) WHERE { ?T22 a :manufacturers . ?T22 :revenue ?T22_revenue . ?T22 :headquarter ?T22_headquarter . FILTER(?T22_headquarter = 'Austin') . } } }",SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_121 ) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . FILTER(?T1_revenue > (?T22_headquarter)) . {SELECT (min( ?T22_revenue) as ?aggregation_T22_revenue_142 ) WHERE { ?T22 a <http://valuenet/ontop/manufacturers> . ?T22 <http://valuenet/ontop/revenue> ?T22_revenue . ?T22 <http://valuenet/ontop/headquarter> ?T22_headquarter . FILTER(?T22_headquarter = 'Austin') . } } }
Find the total revenue of companies of each founder.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_103 ) ?T1_founder WHERE { ?T1 a :manufacturers . ?T1 :revenue ?T1_revenue . ?T1 :founder ?T1_founder . } GROUP BY ?T1_founder",SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_103 ) ?T1_founder WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/founder> ?T1_founder . } GROUP BY ?T1_founder
Find the total revenue for each manufacturer.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_63 ) ?T1_name WHERE { ?T1 a :manufacturers . ?T1 :revenue ?T1_revenue . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT (sum( ?T1_revenue) as ?aggregation_T1_revenue_63 ) ?T1_name WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/revenue> ?T1_revenue . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
"Find the average prices of all products from each manufacture, and list each company's name.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price) as ?aggregation_T1_price_185 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T1 :price ?T1_price . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (avg( ?T1_price) as ?aggregation_T1_price_185 ) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Find the number of different products that are produced by companies at different headquarter cities.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_95 ) ?T2_headquarter WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T1 :name ?T1_name . ?T2 :headquarter ?T2_headquarter . } GROUP BY ?T2_headquarter",SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_95 ) ?T2_headquarter WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/headquarter> ?T2_headquarter . } GROUP BY ?T2_headquarter
Find number of products which Sony does not make.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_58 ) WHERE { ?T1 a :products . ?T1 :name ?T1_name . ?T1 :name ?T1_name . FILTER(?T1_name not in (?T23_name)) . {SELECT ?T22_name WHERE { ?T22 a :products . ?T23 a :manufacturers . ?T22 :ref-manufacturer ?T23 . ?T22 :name ?T22_name . ?T23 :name ?T23_name . FILTER(?T23_name = 'Sony') . } } }",SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_58 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(?T1_name not in (?T23_name)) . {SELECT ?T22_name WHERE { ?T22 a <http://valuenet/ontop/products> . ?T23 a <http://valuenet/ontop/manufacturers> . ?T22 <http://valuenet/ontop/ref-manufacturer> ?T23 . ?T22 <http://valuenet/ontop/name> ?T22_name . ?T23 <http://valuenet/ontop/name> ?T23_name . FILTER(?T23_name = 'Sony') . } } }
Find the name of companies that do not make DVD drive.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :manufacturers . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :manufacturers . ?T3 a :products . ?T3 :ref-manufacturer ?T2 . ?T2 :name ?T2_name . ?T3 :name ?T3_name . FILTER(?T3_name = 'DVD drive') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/manufacturers> . ?T3 a <http://valuenet/ontop/products> . ?T3 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/name> ?T3_name . FILTER(?T3_name = 'DVD drive') . } } }
"Find the number of products for each manufacturer, showing the name of each company.","PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Select the names of all the products in the store.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :products . ?T1 :name ?T1_name . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
Select the names and the prices of all the products in the store.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :name ?T1_name . ?T1 :price ?T1_price . }",SELECT ?T1_name ?T1_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/price> ?T1_price . }
Select the name of the products with a price less than or equal to $200.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :products . ?T1 :name ?T1_name . ?T1 :price ?T1_price . FILTER(?T1_price <= 200) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/price> ?T1_price . FILTER(?T1_price <= 200) . }
Find all information of all the products with a price between $60 and $120.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :products . ?T1 :price ?T1_price . FILTER(?T1_price >= 60 && ?T1_price <= 120) . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/price> ?T1_price . FILTER(?T1_price >= 60 && ?T1_price <= 120) . }
Compute the average price of all the products.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price) as ?aggregation_T1_price_56 ) WHERE { ?T1 a :products . ?T1 :price ?T1_price . }",SELECT (avg( ?T1_price) as ?aggregation_T1_price_56 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/price> ?T1_price . }
Compute the average price of all products with manufacturer code equal to 2.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price) as ?aggregation_T1_price_51 ) WHERE { ?T1 a :products . ?T1 :price ?T1_price . ?T1 :manufacturer ?T1_manufacturer . FILTER(?T1_manufacturer = 2) . }",SELECT (avg( ?T1_price) as ?aggregation_T1_price_51 ) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T1 <http://valuenet/ontop/manufacturer> ?T1_manufacturer . FILTER(?T1_manufacturer = 2) . }
Compute the number of products with a price larger than or equal to $180.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :price ?T1_price . FILTER(?T1_price >= 180) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/price> ?T1_price . FILTER(?T1_price >= 180) . }
"Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name  (in ascending order).","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :name ?T1_name . ?T1 :price ?T1_price . ?T1 :price ?T1_price . ?T1 :price ?T1_price . FILTER(?T1_price >= 180) . } ORDER BY ASC (?T1_price)",SELECT ?T1_name ?T1_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T1 <http://valuenet/ontop/price> ?T1_price . FILTER(?T1_price >= 180) . } ORDER BY ASC (?T1_price)
Select all the data from the products and each product's manufacturer.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :products . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/products> . }
"Select the average price of each manufacturer's products, showing only the manufacturer's code.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price) as ?aggregation_T1_price_59 ) ?T1_manufacturer WHERE { ?T1 a :products . ?T1 :price ?T1_price . ?T1 :manufacturer ?T1_manufacturer . } GROUP BY ?T1_manufacturer",SELECT (avg( ?T1_price) as ?aggregation_T1_price_59 ) ?T1_manufacturer WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T1 <http://valuenet/ontop/manufacturer> ?T1_manufacturer . } GROUP BY ?T1_manufacturer
"Select the average price of each manufacturer's products, showing the manufacturer's name.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price) as ?aggregation_T1_price_133 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T1 :price ?T1_price . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (avg( ?T1_price) as ?aggregation_T1_price_133 ) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Select the names of manufacturer whose products have an average price higher than or equal to $150.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price) as ?aggregation_T1_price_194 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T1 :price ?T1_price . ?T2 :name ?T2_name . ?T1 :price ?T1_price . } GROUP BY ?T2_name HAVING(avg( ?T1_price) >= 150)",SELECT (avg( ?T1_price) as ?aggregation_T1_price_194 ) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T1 <http://valuenet/ontop/price> ?T1_price . } GROUP BY ?T2_name HAVING(avg( ?T1_price) >= 150)
Select the name and price of the cheapest product.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_price WHERE { ?T1 a :products . ?T1 :name ?T1_name . ?T1 :price ?T1_price . ?T1 :price ?T1_price . } ORDER BY ASC (?T1_price) LIMIT 1",SELECT ?T1_name ?T1_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T1 <http://valuenet/ontop/price> ?T1_price . } ORDER BY ASC (?T1_price) LIMIT 1
Select the name of each manufacturer along with the name and price of its most expensive product.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (max( ?T1_price) as ?aggregation_T1_price_103 ) ?T2_name WHERE { ?T1 a :products . ?T2 a :manufacturers . ?T1 :ref-manufacturer ?T2 . ?T1 :name ?T1_name . ?T1 :price ?T1_price . ?T2 :name ?T2_name . } GROUP BY ?T1_name ?T2_name",SELECT ?T1_name (max( ?T1_price) as ?aggregation_T1_price_103 ) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/manufacturers> . ?T1 <http://valuenet/ontop/ref-manufacturer> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/price> ?T1_price . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T1_name ?T2_name
