nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of countries.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :country . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/country> . }
Show the country name and capital of all countries.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country_name ?T1_capital WHERE { ?T1 a :country . ?T1 :country_name ?T1_country_name . ?T1 :capital ?T1_capital . }",SELECT ?T1_country_name ?T1_capital WHERE { ?T1 a <http://valuenet/ontop/country> . ?T1 <http://valuenet/ontop/country_name> ?T1_country_name . ?T1 <http://valuenet/ontop/capital> ?T1_capital . }
Show all official native languages that contain the word 'English'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_native_language WHERE { ?T1 a :country . ?T1 :official_native_language ?T1_official_native_language . ?T1 :official_native_language ?T1_official_native_language . FILTER(contains (?T1_official_native_language, 'English')) . }","SELECT ?T1_official_native_language WHERE { ?T1 a <http://valuenet/ontop/country> . ?T1 <http://valuenet/ontop/official_native_language> ?T1_official_native_language . ?T1 <http://valuenet/ontop/official_native_language> ?T1_official_native_language . FILTER(contains (?T1_official_native_language, 'English')) . }"
Show all distinct positions of matches.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T1 :position ?T1_position . }",SELECT DISTINCT ?T1_position WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/position> ?T1_position . }
Show the players from college UCLA.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player WHERE { ?T1 a :match_season . ?T1 :player ?T1_player . ?T1 :college ?T1_college . FILTER(?T1_college = 'UCLA') . }",SELECT ?T1_player WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/player> ?T1_player . ?T1 <http://valuenet/ontop/college> ?T1_college . FILTER(?T1_college = 'UCLA') . }
Show the distinct position of players from college UCLA or Duke.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T1 :position ?T1_position . ?T1 :college ?T1_college . ?T1 :college ?T1_college . FILTER(?T1_college = 'UCLA' || ?T1_college = 'Duke') . }",SELECT DISTINCT ?T1_position WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T1 <http://valuenet/ontop/college> ?T1_college . ?T1 <http://valuenet/ontop/college> ?T1_college . FILTER(?T1_college = 'UCLA' || ?T1_college = 'Duke') . }
Show the draft pick numbers and draft classes of players whose positions are defenders.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_draft_pick_number ?T1_draft_class WHERE { ?T1 a :match_season . ?T1 :draft_pick_number ?T1_draft_pick_number . ?T1 :draft_class ?T1_draft_class . ?T1 :position ?T1_position . FILTER(?T1_position = 'Defender') . }",SELECT ?T1_draft_pick_number ?T1_draft_class WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/draft_pick_number> ?T1_draft_pick_number . ?T1 <http://valuenet/ontop/draft_class> ?T1_draft_class . ?T1 <http://valuenet/ontop/position> ?T1_position . FILTER(?T1_position = 'Defender') . }
Count the number of different teams involved in match season.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_team) as ?aggregation_T1_team_199 ) WHERE { ?T1 a :match_season . ?T1 :team ?T1_team . }",SELECT DISTINCT (count(DISTINCT ?T1_team) as ?aggregation_T1_team_199 ) WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/team> ?T1_team . }
Show the players and the years played.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player ?T1_years_played WHERE { ?T1 a :player . ?T1 :player ?T1_player . ?T1 :years_played ?T1_years_played . }",SELECT ?T1_player ?T1_years_played WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/player> ?T1_player . ?T1 <http://valuenet/ontop/years_played> ?T1_years_played . }
Show all team names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :team . ?T1 :name ?T1_name . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
"Show the season, the player, and the name of the country that player belongs to.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_season ?T1_player ?T2_country_name WHERE { ?T1 a :match_season . ?T2 a :country . ?T1 :ref-country ?T2 . ?T1 :season ?T1_season . ?T1 :player ?T1_player . ?T2 :country_name ?T2_country_name . }",SELECT ?T1_season ?T1_player ?T2_country_name WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T2 a <http://valuenet/ontop/country> . ?T1 <http://valuenet/ontop/ref-country> ?T2 . ?T1 <http://valuenet/ontop/season> ?T1_season . ?T1 <http://valuenet/ontop/player> ?T1_player . ?T2 <http://valuenet/ontop/country_name> ?T2_country_name . }
Give the different positions of players who play for the country with the capital Dublin.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_position WHERE { ?T1 a :match_season . ?T2 a :country . ?T1 :ref-country ?T2 . ?T1 :position ?T1_position . ?T2 :capital ?T2_capital . FILTER(?T2_capital = 'Dublin') . }",SELECT DISTINCT ?T1_position WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T2 a <http://valuenet/ontop/country> . ?T1 <http://valuenet/ontop/ref-country> ?T2 . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T2 <http://valuenet/ontop/capital> ?T2_capital . FILTER(?T2_capital = 'Dublin') . }
Return the official native languages of countries who have players from Maryland or Duke colleges.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_official_native_language WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :ref-country ?T1 . ?T1 :official_native_language ?T1_official_native_language . ?T2 :college ?T2_college . ?T2 :college ?T2_college . FILTER(?T2_college = 'Maryland' || ?T2_college = 'Duke') . }",SELECT ?T1_official_native_language WHERE { ?T1 a <http://valuenet/ontop/country> . ?T2 a <http://valuenet/ontop/match_season> . ?T2 <http://valuenet/ontop/ref-country> ?T1 . ?T1 <http://valuenet/ontop/official_native_language> ?T1_official_native_language . ?T2 <http://valuenet/ontop/college> ?T2_college . ?T2 <http://valuenet/ontop/college> ?T2_college . FILTER(?T2_college = 'Maryland' || ?T2_college = 'Duke') . }
How many distinct official languages are there among countries of players whose positions are defenders.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_official_native_language) as ?aggregation_T1_official_native_language_149 ) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :ref-country ?T1 . ?T1 :official_native_language ?T1_official_native_language . ?T2 :position ?T2_position . FILTER(?T2_position = 'Defender') . }",SELECT DISTINCT (count(DISTINCT ?T1_official_native_language) as ?aggregation_T1_official_native_language_149 ) WHERE { ?T1 a <http://valuenet/ontop/country> . ?T2 a <http://valuenet/ontop/match_season> . ?T2 <http://valuenet/ontop/ref-country> ?T1 . ?T1 <http://valuenet/ontop/official_native_language> ?T1_official_native_language . ?T2 <http://valuenet/ontop/position> ?T2_position . FILTER(?T2_position = 'Defender') . }
Count the number of different official languages corresponding to countries that players who play Defender are from.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_official_native_language) as ?aggregation_T1_official_native_language_30 ) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :ref-country ?T1 . ?T1 :official_native_language ?T1_official_native_language . ?T2 :position ?T2_position . FILTER(?T2_position = 'Defender') . }",SELECT DISTINCT (count(DISTINCT ?T1_official_native_language) as ?aggregation_T1_official_native_language_30 ) WHERE { ?T1 a <http://valuenet/ontop/country> . ?T2 a <http://valuenet/ontop/match_season> . ?T2 <http://valuenet/ontop/ref-country> ?T1 . ?T1 <http://valuenet/ontop/official_native_language> ?T1_official_native_language . ?T2 <http://valuenet/ontop/position> ?T2_position . FILTER(?T2_position = 'Defender') . }
"Show the season, the player, and the name of the team that players belong to.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_season ?T1_player ?T2_name WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :ref-team ?T2 . ?T1 :season ?T1_season . ?T1 :player ?T1_player . ?T2 :name ?T2_name . }",SELECT ?T1_season ?T1_player ?T2_name WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T2 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/ref-team> ?T2 . ?T1 <http://valuenet/ontop/season> ?T1_season . ?T1 <http://valuenet/ontop/player> ?T1_player . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the positions of the players from the team with name 'Ryley Goldner'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_position WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :ref-team ?T2 . ?T1 :position ?T1_position . ?T2 :name ?T2_name . FILTER(?T2_name = 'Ryley Goldner') . }",SELECT ?T1_position WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T2 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/ref-team> ?T2 . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Ryley Goldner') . }
How many distinct colleges are associated with players from the team with name 'Columbus Crew'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_college) as ?aggregation_T1_college_106 ) WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :ref-team ?T2 . ?T1 :college ?T1_college . ?T2 :name ?T2_name . FILTER(?T2_name = 'Columbus Crew') . }",SELECT DISTINCT (count(DISTINCT ?T1_college) as ?aggregation_T1_college_106 ) WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T2 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/ref-team> ?T2 . ?T1 <http://valuenet/ontop/college> ?T1_college . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Columbus Crew') . }
Count the number of different colleges that players who play for Columbus Crew are from.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_college) as ?aggregation_T1_college_160 ) WHERE { ?T1 a :match_season . ?T2 a :team . ?T1 :ref-team ?T2 . ?T1 :college ?T1_college . ?T2 :name ?T2_name . FILTER(?T2_name = 'Columbus Crew') . }",SELECT DISTINCT (count(DISTINCT ?T1_college) as ?aggregation_T1_college_160 ) WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T2 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/ref-team> ?T2 . ?T1 <http://valuenet/ontop/college> ?T1_college . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Columbus Crew') . }
Show the players and years played for players from team 'Columbus Crew'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player ?T1_years_played WHERE { ?T1 a :player . ?T2 a :team . ?T1 :ref-team ?T2 . ?T1 :player ?T1_player . ?T1 :years_played ?T1_years_played . ?T2 :name ?T2_name . FILTER(?T2_name = 'Columbus Crew') . }",SELECT ?T1_player ?T1_years_played WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/ref-team> ?T2 . ?T1 <http://valuenet/ontop/player> ?T1_player . ?T1 <http://valuenet/ontop/years_played> ?T1_years_played . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Columbus Crew') . }
Show the position of players and the corresponding number of players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :position ?T1_position . } GROUP BY ?T1_position",SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/position> ?T1_position . } GROUP BY ?T1_position
Show the country names and the corresponding number of players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country_name (count( *) as ?aggregation_all) WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :ref-country ?T1 . ?T1 :country_name ?T1_country_name . } GROUP BY ?T1_country_name",SELECT ?T1_country_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/country> . ?T2 a <http://valuenet/ontop/match_season> . ?T2 <http://valuenet/ontop/ref-country> ?T1 . ?T1 <http://valuenet/ontop/country_name> ?T1_country_name . } GROUP BY ?T1_country_name
Return all players sorted by college in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player WHERE { ?T1 a :match_season . ?T1 :player ?T1_player . ?T1 :college ?T1_college . } ORDER BY ASC (?T1_college)",SELECT ?T1_player WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/player> ?T1_player . ?T1 <http://valuenet/ontop/college> ?T1_college . } ORDER BY ASC (?T1_college)
Show the most common position of players in match seasons.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :position ?T1_position . } GROUP BY ?T1_position ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_position (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/position> ?T1_position . } GROUP BY ?T1_position ORDER BY DESC (?aggregation_all) LIMIT 1
Show the top 3 most common colleges of players in match seasons.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :match_season . ?T1 :college ?T1_college . } GROUP BY ?T1_college ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/college> ?T1_college . } GROUP BY ?T1_college ORDER BY DESC (?aggregation_all) LIMIT 1
Show the name of colleges that have at least two players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_college WHERE { ?T1 a :match_season . ?T1 :college ?T1_college . } GROUP BY ?T1_college HAVING(count( *) >= 2)",SELECT ?T1_college WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/college> ?T1_college . } GROUP BY ?T1_college HAVING(count( *) >= 2)
Return the names of teams that have no match season record.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :team . ?T1 :name ?T1_name . ?T1 :team_id ?T1_team_id . FILTER(?T1_team_id not in (?T22_team)) . {SELECT ?T22_team WHERE { ?T22 a :match_season . ?T22 :team ?T22_team . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/team> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/team_id> ?T1_team_id . FILTER(?T1_team_id not in (?T22_team)) . {SELECT ?T22_team WHERE { ?T22 a <http://valuenet/ontop/match_season> . ?T22 <http://valuenet/ontop/team> ?T22_team . } } }
"Return the names of countries that have players that play the Forward position, as well as players who play the Defender position.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country_name WHERE { ?T1 a :country . ?T2 a :match_season . ?T2 :ref-country ?T1 . ?T1 :country_name ?T1_country_name . ?T2 :position ?T2_position . FILTER(?T2_position = 'Forward') . FILTER (?T1_country_name in (?T3_country_name)) . ?T3 a :country . ?T4 a :match_season . ?T4 :ref-country ?T3 . ?T3 :country_name ?T3_country_name . ?T4 :position ?T4_position . FILTER(?T4_position = 'Defender') . }",SELECT DISTINCT ?T1_country_name WHERE { ?T1 a <http://valuenet/ontop/country> . ?T2 a <http://valuenet/ontop/match_season> . ?T2 <http://valuenet/ontop/ref-country> ?T1 . ?T1 <http://valuenet/ontop/country_name> ?T1_country_name . ?T2 <http://valuenet/ontop/position> ?T2_position . FILTER(?T2_position = 'Forward') . FILTER (?T1_country_name in (?T3_country_name)) . ?T3 a <http://valuenet/ontop/country> . ?T4 a <http://valuenet/ontop/match_season> . ?T4 <http://valuenet/ontop/ref-country> ?T3 . ?T3 <http://valuenet/ontop/country_name> ?T3_country_name . ?T4 <http://valuenet/ontop/position> ?T4_position . FILTER(?T4_position = 'Defender') . }
"Return the colleges that have players who play the Midfielder position, as well as players who play the Defender position.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_college WHERE { ?T1 a :match_season . ?T1 :college ?T1_college . ?T1 :position ?T1_position . FILTER(?T1_position = 'Midfielder') . FILTER (?T1_college in (?T2_college)) . ?T2 a :match_season . ?T2 :college ?T2_college . ?T2 :position ?T2_position . FILTER(?T2_position = 'Defender') . }",SELECT DISTINCT ?T1_college WHERE { ?T1 a <http://valuenet/ontop/match_season> . ?T1 <http://valuenet/ontop/college> ?T1_college . ?T1 <http://valuenet/ontop/position> ?T1_position . FILTER(?T1_position = 'Midfielder') . FILTER (?T1_college in (?T2_college)) . ?T2 a <http://valuenet/ontop/match_season> . ?T2 <http://valuenet/ontop/college> ?T2_college . ?T2 <http://valuenet/ontop/position> ?T2_position . FILTER(?T2_position = 'Defender') . }
