nl_question,sparql_partial_uri,sparql_complete_uri
List the name of enzymes in descending lexicographical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :enzyme . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY DESC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/enzyme> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY DESC (?T1_name)
List the names and the locations that the enzymes can make an effect.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location WHERE { ?T1 a :enzyme . ?T1 :name ?T1_name . ?T1 :location ?T1_location . }",SELECT ?T1_name ?T1_location WHERE { ?T1 a <http://valuenet/ontop/enzyme> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . }
"What are the ids, names and FDA approval status of medicines in descending order of the number of enzymes that it can interact with.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_id ?T1_name ?T1_fda_approved WHERE { ?T1 a :medicine . ?T2 a :medicine_enzyme_interaction . ?T2 :ref-medicine ?T1 . ?T1 :id ?T1_id . ?T1 :name ?T1_name . ?T1 :fda_approved ?T1_fda_approved . } GROUP BY ?T1_id ?T1_name ?T1_fda_approved ORDER BY DESC (count( *))",SELECT ?T1_id ?T1_name ?T1_fda_approved WHERE { ?T1 a <http://valuenet/ontop/medicine> . ?T2 a <http://valuenet/ontop/medicine_enzyme_interaction> . ?T2 <http://valuenet/ontop/ref-medicine> ?T1 . ?T1 <http://valuenet/ontop/id> ?T1_id . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/fda_approved> ?T1_fda_approved . } GROUP BY ?T1_id ?T1_name ?T1_fda_approved ORDER BY DESC (count( *))
List the medicine name and trade name which can both interact as 'inhibitor' and 'activitor' with enzymes.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name ?T1_trade_name WHERE { ?T1 a :medicine . ?T2 a :medicine_enzyme_interaction . ?T2 :ref-medicine ?T1 . ?T1 :name ?T1_name . ?T1 :trade_name ?T1_trade_name . ?T2 :interaction_type ?T2_interaction_type . FILTER(?T2_interaction_type = 'inhibitor') . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_trade_name in (?T3_trade_name)) . ?T3 a :medicine . ?T4 a :medicine_enzyme_interaction . ?T4 :ref-medicine ?T3 . ?T3 :name ?T3_name . ?T3 :trade_name ?T3_trade_name . ?T4 :interaction_type ?T4_interaction_type . FILTER(?T4_interaction_type = 'activitor') . }",SELECT DISTINCT ?T1_name ?T1_trade_name WHERE { ?T1 a <http://valuenet/ontop/medicine> . ?T2 a <http://valuenet/ontop/medicine_enzyme_interaction> . ?T2 <http://valuenet/ontop/ref-medicine> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/trade_name> ?T1_trade_name . ?T2 <http://valuenet/ontop/interaction_type> ?T2_interaction_type . FILTER(?T2_interaction_type = 'inhibitor') . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_trade_name in (?T3_trade_name)) . ?T3 a <http://valuenet/ontop/medicine> . ?T4 a <http://valuenet/ontop/medicine_enzyme_interaction> . ?T4 <http://valuenet/ontop/ref-medicine> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T3 <http://valuenet/ontop/trade_name> ?T3_trade_name . ?T4 <http://valuenet/ontop/interaction_type> ?T4_interaction_type . FILTER(?T4_interaction_type = 'activitor') . }
Show the medicine names and trade names that cannot interact with the enzyme with product 'Heme'.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_trade_name as ?col2) WHERE { ?T1 a :medicine . ?T1 :name ?T1_name . ?T1 :trade_name ?T1_trade_name . }} MINUS {SELECT (?T2_name as ?col1) (?T2_trade_name as ?col2) WHERE { ?T2 a :medicine . ?T14 a :medicine_enzyme_interaction . ?T14 :ref-medicine ?T2 . ?T2 :name ?T2_name . ?T2 :trade_name ?T2_trade_name . ?T3 :product ?T3_product . ?T3 a :enzyme . ?T14 :ref-enzyme ?T3 . ?T2 :name ?T2_name . ?T2 :trade_name ?T2_trade_name . ?T3 :product ?T3_product . FILTER(?T3_product = 'Protoporphyrinogen IX') . } } }",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_trade_name as ?col2) WHERE { ?T1 a <http://valuenet/ontop/medicine> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/trade_name> ?T1_trade_name . }} MINUS {SELECT (?T2_name as ?col1) (?T2_trade_name as ?col2) WHERE { ?T2 a <http://valuenet/ontop/medicine> . ?T14 a <http://valuenet/ontop/medicine_enzyme_interaction> . ?T14 <http://valuenet/ontop/ref-medicine> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/trade_name> ?T2_trade_name . ?T3 <http://valuenet/ontop/product> ?T3_product . ?T3 a <http://valuenet/ontop/enzyme> . ?T14 <http://valuenet/ontop/ref-enzyme> ?T3 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/trade_name> ?T2_trade_name . ?T3 <http://valuenet/ontop/product> ?T3_product . FILTER(?T3_product = 'Protoporphyrinogen IX') . } } }
find the number of medicines offered by each trade.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_trade_name (count( *) as ?aggregation_all) WHERE { ?T1 a :medicine . ?T1 :trade_name ?T1_trade_name . } GROUP BY ?T1_trade_name",SELECT ?T1_trade_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/medicine> . ?T1 <http://valuenet/ontop/trade_name> ?T1_trade_name . } GROUP BY ?T1_trade_name
