nl_question,sparql_partial_uri,sparql_complete_uri
"Find the brand and name for each camera lens, and sort in descending order of maximum aperture.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_brand ?T1_name WHERE { ?T1 a :camera_lens . ?T1 :brand ?T1_brand . ?T1 :name ?T1_name . ?T1 :max_aperture ?T1_max_aperture . } ORDER BY DESC (?T1_max_aperture)",SELECT ?T1_brand ?T1_name WHERE { ?T1 a <http://valuenet/ontop/camera_lens> . ?T1 <http://valuenet/ontop/brand> ?T1_brand . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/max_aperture> ?T1_max_aperture . } ORDER BY DESC (?T1_max_aperture)
"List the id, color scheme, and name for all the photos.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_id ?T1_color ?T1_name WHERE { ?T1 a :photos . ?T1 :id ?T1_id . ?T1 :color ?T1_color . ?T1 :name ?T1_name . }",SELECT ?T1_id ?T1_color ?T1_name WHERE { ?T1 a <http://valuenet/ontop/photos> . ?T1 <http://valuenet/ontop/id> ?T1_id . ?T1 <http://valuenet/ontop/color> ?T1_color . ?T1 <http://valuenet/ontop/name> ?T1_name . }
List the brands of lenses that took both a picture of mountains with range 'Toubkal Atlas' and a picture of mountains with range 'Lasta Massif',"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_brand WHERE { ?T1 a :camera_lens . ?T13 a :photos . ?T13 :ref-camera_lens ?T1 . ?T1 :brand ?T1_brand . ?T2 :range ?T2_range . ?T2 a :mountain . ?T13 :ref-mountain ?T2 . ?T1 :brand ?T1_brand . ?T2 :range ?T2_range . FILTER(?T2_range = 'Toubkal Atlas') . FILTER (?T1_brand in (?T3_brand)) . ?T3 a :camera_lens . ?T15 a :photos . ?T15 :ref-camera_lens ?T3 . ?T3 :brand ?T3_brand . ?T4 :range ?T4_range . ?T4 a :mountain . ?T15 :ref-mountain ?T4 . ?T3 :brand ?T3_brand . ?T4 :range ?T4_range . FILTER(?T4_range = 'Lasta Massif') . }",SELECT DISTINCT ?T1_brand WHERE { ?T1 a <http://valuenet/ontop/camera_lens> . ?T13 a <http://valuenet/ontop/photos> . ?T13 <http://valuenet/ontop/ref-camera_lens> ?T1 . ?T1 <http://valuenet/ontop/brand> ?T1_brand . ?T2 <http://valuenet/ontop/range> ?T2_range . ?T2 a <http://valuenet/ontop/mountain> . ?T13 <http://valuenet/ontop/ref-mountain> ?T2 . ?T1 <http://valuenet/ontop/brand> ?T1_brand . ?T2 <http://valuenet/ontop/range> ?T2_range . FILTER(?T2_range = 'Toubkal Atlas') . FILTER (?T1_brand in (?T3_brand)) . ?T3 a <http://valuenet/ontop/camera_lens> . ?T15 a <http://valuenet/ontop/photos> . ?T15 <http://valuenet/ontop/ref-camera_lens> ?T3 . ?T3 <http://valuenet/ontop/brand> ?T3_brand . ?T4 <http://valuenet/ontop/range> ?T4_range . ?T4 a <http://valuenet/ontop/mountain> . ?T15 <http://valuenet/ontop/ref-mountain> ?T4 . ?T3 <http://valuenet/ontop/brand> ?T3_brand . ?T4 <http://valuenet/ontop/range> ?T4_range . FILTER(?T4_range = 'Lasta Massif') . }
Show the name and prominence of the mountains whose picture is not taken by a lens of brand 'Sigma'.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_prominence as ?col2) WHERE { ?T1 a :mountain . ?T1 :name ?T1_name . ?T1 :prominence ?T1_prominence . }} MINUS {SELECT (?T2_name as ?col1) (?T2_prominence as ?col2) WHERE { ?T2 a :mountain . ?T14 a :photos . ?T14 :ref-mountain ?T2 . ?T2 :name ?T2_name . ?T2 :prominence ?T2_prominence . ?T3 :brand ?T3_brand . ?T3 a :camera_lens . ?T14 :ref-camera_lens ?T3 . ?T2 :name ?T2_name . ?T2 :prominence ?T2_prominence . ?T3 :brand ?T3_brand . FILTER(?T3_brand = 'Sigma') . } } }",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_name as ?col1) (?T1_prominence as ?col2) WHERE { ?T1 a <http://valuenet/ontop/mountain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/prominence> ?T1_prominence . }} MINUS {SELECT (?T2_name as ?col1) (?T2_prominence as ?col2) WHERE { ?T2 a <http://valuenet/ontop/mountain> . ?T14 a <http://valuenet/ontop/photos> . ?T14 <http://valuenet/ontop/ref-mountain> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/prominence> ?T2_prominence . ?T3 <http://valuenet/ontop/brand> ?T3_brand . ?T3 a <http://valuenet/ontop/camera_lens> . ?T14 <http://valuenet/ontop/ref-camera_lens> ?T3 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/prominence> ?T2_prominence . ?T3 <http://valuenet/ontop/brand> ?T3_brand . FILTER(?T3_brand = 'Sigma') . } } }
List the camera lens names containing substring 'Digital'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :camera_lens . ?T1 :name ?T1_name . ?T1 :name ?T1_name . FILTER(contains (?T1_name, 'Digital')) . }","SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/camera_lens> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(contains (?T1_name, 'Digital')) . }"
What is the name of each camera lens and the number of photos taken by it? Order the result by the count of photos.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :camera_lens . ?T2 a :photos . ?T2 :ref-camera_lens ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY ASC (count( *))",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/camera_lens> . ?T2 a <http://valuenet/ontop/photos> . ?T2 <http://valuenet/ontop/ref-camera_lens> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY ASC (count( *))
