nl_question,sparql_partial_uri,sparql_complete_uri
Find the id of the song that lasts the longest.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_f_id WHERE { ?T1 a :files . ?T1 :f_id ?T1_f_id . ?T1 :duration ?T1_duration . } ORDER BY DESC (?T1_duration) LIMIT 1",SELECT ?T1_f_id WHERE { ?T1 a <http://valuenet/ontop/files> . ?T1 <http://valuenet/ontop/f_id> ?T1_f_id . ?T1 <http://valuenet/ontop/duration> ?T1_duration . } ORDER BY DESC (?T1_duration) LIMIT 1
Find the names of all English songs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song_name ?T1_song_name . ?T1 :languages ?T1_languages . FILTER(?T1_languages = 'english') . }",SELECT ?T1_song_name WHERE { ?T1 a <http://valuenet/ontop/song> . ?T1 <http://valuenet/ontop/song_name> ?T1_song_name . ?T1 <http://valuenet/ontop/languages> ?T1_languages . FILTER(?T1_languages = 'english') . }
What are the id of songs whose format is mp3.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_f_id WHERE { ?T1 a :files . ?T1 :f_id ?T1_f_id . ?T1 :formats ?T1_formats . FILTER(?T1_formats = 'mp3') . }",SELECT ?T1_f_id WHERE { ?T1 a <http://valuenet/ontop/files> . ?T1 <http://valuenet/ontop/f_id> ?T1_f_id . ?T1 <http://valuenet/ontop/formats> ?T1_formats . FILTER(?T1_formats = 'mp3') . }
List the name and country of origin for all singers who have produced songs with rating above 9.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_artist_name ?T1_country WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :ref-artist_name ?T1 . ?T1 :artist_name ?T1_artist_name . ?T1 :country ?T1_country . ?T2 :song-rating ?T2_rating . FILTER(?T2_rating > 9) . }",SELECT DISTINCT ?T1_artist_name ?T1_country WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/ref-artist_name> ?T1 . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T2 <http://valuenet/ontop/song-rating> ?T2_rating . FILTER(?T2_rating > 9) . }
List the file size and format for all songs that have resolution lower than 800.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_file_size ?T1_formats WHERE { ?T1 a :files . ?T2 a :song . ?T2 :ref-f ?T1 . ?T1 :file_size ?T1_file_size . ?T1 :formats ?T1_formats . ?T2 :resolution ?T2_resolution . FILTER(?T2_resolution < 800) . }",SELECT DISTINCT ?T1_file_size ?T1_formats WHERE { ?T1 a <http://valuenet/ontop/files> . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/ref-f> ?T1 . ?T1 <http://valuenet/ontop/file_size> ?T1_file_size . ?T1 <http://valuenet/ontop/formats> ?T1_formats . ?T2 <http://valuenet/ontop/resolution> ?T2_resolution . FILTER(?T2_resolution < 800) . }
What are the names and countries of origin for the artists who produced the top three highly rated songs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_artist_name ?T1_country WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :ref-artist_name ?T1 . ?T1 :artist_name ?T1_artist_name . ?T1 :country ?T1_country . ?T2 :song-rating ?T2_rating . } ORDER BY DESC (?T2_rating) LIMIT 1",SELECT ?T1_artist_name ?T1_country WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/ref-artist_name> ?T1 . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T2 <http://valuenet/ontop/song-rating> ?T2_rating . } ORDER BY DESC (?T2_rating) LIMIT 1
Find the file format that is used by the most files.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_formats (count( *) as ?aggregation_all) WHERE { ?T1 a :files . ?T1 :formats ?T1_formats . } GROUP BY ?T1_formats ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_formats (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/files> . ?T1 <http://valuenet/ontop/formats> ?T1_formats . } GROUP BY ?T1_formats ORDER BY DESC (?aggregation_all) LIMIT 1
Find the names of the artists who are from UK and have produced English songs.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_artist_name WHERE { ?T1 a :artist . ?T1 :artist_name ?T1_artist_name . ?T1 :country ?T1_country . FILTER(?T1_country = 'UK') . FILTER (?T1_artist_name in (?T2_artist_name)) . ?T2 a :song . ?T2 :artist_name ?T2_artist_name . ?T2 :languages ?T2_languages . FILTER(?T2_languages = 'english') . }",SELECT DISTINCT ?T1_artist_name WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country = 'UK') . FILTER (?T1_artist_name in (?T2_artist_name)) . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/artist_name> ?T2_artist_name . ?T2 <http://valuenet/ontop/languages> ?T2_languages . FILTER(?T2_languages = 'english') . }
Find the id of songs that are available in mp4 format and have resolution lower than 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_f_id WHERE { ?T1 a :files . ?T1 :f_id ?T1_f_id . ?T1 :formats ?T1_formats . FILTER(?T1_formats = 'mp4') . FILTER (?T1_f_id in (?T2_f_id)) . ?T2 a :song . ?T2 :f_id ?T2_f_id . ?T2 :resolution ?T2_resolution . FILTER(?T2_resolution < 1000) . }",SELECT DISTINCT ?T1_f_id WHERE { ?T1 a <http://valuenet/ontop/files> . ?T1 <http://valuenet/ontop/f_id> ?T1_f_id . ?T1 <http://valuenet/ontop/formats> ?T1_formats . FILTER(?T1_formats = 'mp4') . FILTER (?T1_f_id in (?T2_f_id)) . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/f_id> ?T2_f_id . ?T2 <http://valuenet/ontop/resolution> ?T2_resolution . FILTER(?T2_resolution < 1000) . }
Return the gender and name of artist who produced the song with the lowest resolution.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_gender ?T1_artist_name WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :ref-artist_name ?T1 . ?T1 :gender ?T1_gender . ?T1 :artist_name ?T1_artist_name . ?T2 :resolution ?T2_resolution . } ORDER BY ASC (?T2_resolution) LIMIT 1",SELECT ?T1_gender ?T1_artist_name WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/ref-artist_name> ?T1 . ?T1 <http://valuenet/ontop/gender> ?T1_gender . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T2 <http://valuenet/ontop/resolution> ?T2_resolution . } ORDER BY ASC (?T2_resolution) LIMIT 1
"For each file format, return the number of artists who released songs in that format.","PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_formats WHERE { ?T1 a :files . ?T1 :formats ?T1_formats . } GROUP BY ?T1_formats",SELECT (count( *) as ?aggregation_all) ?T1_formats WHERE { ?T1 a <http://valuenet/ontop/files> . ?T1 <http://valuenet/ontop/formats> ?T1_formats . } GROUP BY ?T1_formats
Find the distinct names of all songs that have a higher resolution than some songs in English.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song_name ?T1_song_name . ?T1 :resolution ?T1_resolution . FILTER(?T1_resolution > (?T22_languages)) . {SELECT (min( ?T22_resolution) as ?aggregation_T22_resolution_14 ) WHERE { ?T22 a :song . ?T22 :resolution ?T22_resolution . ?T22 :languages ?T22_languages . FILTER(?T22_languages = 'english') . } } }",SELECT DISTINCT ?T1_song_name WHERE { ?T1 a <http://valuenet/ontop/song> . ?T1 <http://valuenet/ontop/song_name> ?T1_song_name . ?T1 <http://valuenet/ontop/resolution> ?T1_resolution . FILTER(?T1_resolution > (?T22_languages)) . {SELECT (min( ?T22_resolution) as ?aggregation_T22_resolution_14 ) WHERE { ?T22 a <http://valuenet/ontop/song> . ?T22 <http://valuenet/ontop/resolution> ?T22_resolution . ?T22 <http://valuenet/ontop/languages> ?T22_languages . FILTER(?T22_languages = 'english') . } } }
"List the names of all genres in alphabetical oder, together with its ratings.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_g_name ?T1_rating WHERE { ?T1 a :genre . ?T1 :g_name ?T1_g_name . ?T1 :genre-rating ?T1_rating . ?T1 :g_name ?T1_g_name . } ORDER BY ASC (?T1_g_name)",SELECT ?T1_g_name ?T1_rating WHERE { ?T1 a <http://valuenet/ontop/genre> . ?T1 <http://valuenet/ontop/g_name> ?T1_g_name . ?T1 <http://valuenet/ontop/genre-rating> ?T1_rating . ?T1 <http://valuenet/ontop/g_name> ?T1_g_name . } ORDER BY ASC (?T1_g_name)
Give me a list of the names of all songs ordered by their resolution.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song_name ?T1_song_name . ?T1 :resolution ?T1_resolution . } ORDER BY ASC (?T1_resolution)",SELECT ?T1_song_name WHERE { ?T1 a <http://valuenet/ontop/song> . ?T1 <http://valuenet/ontop/song_name> ?T1_song_name . ?T1 <http://valuenet/ontop/resolution> ?T1_resolution . } ORDER BY ASC (?T1_resolution)
Find the names of songs whose genre is modern or language is English.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song_name WHERE { ?T1 a :song . ?T1 :song_name ?T1_song_name . ?T1 :genre_is ?T1_genre_is . ?T1 :languages ?T1_languages . FILTER(?T1_genre_is = 'modern' || ?T1_languages = 'english') . }",SELECT ?T1_song_name WHERE { ?T1 a <http://valuenet/ontop/song> . ?T1 <http://valuenet/ontop/song_name> ?T1_song_name . ?T1 <http://valuenet/ontop/genre_is> ?T1_genre_is . ?T1 <http://valuenet/ontop/languages> ?T1_languages . FILTER(?T1_genre_is = 'modern' || ?T1_languages = 'english') . }
Return the names of songs for which format is mp3 and resolution is below 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_song_name WHERE { ?T1 a :song . ?T2 a :files . ?T1 :ref-f ?T2 . ?T1 :song_name ?T1_song_name . ?T2 :formats ?T2_formats . FILTER(?T2_formats = 'mp3') . FILTER (?T1_song_name in (?T3_song_name)) . ?T3 a :song . ?T3 :song_name ?T3_song_name . ?T3 :resolution ?T3_resolution . FILTER(?T3_resolution < 1000) . }",SELECT DISTINCT ?T1_song_name WHERE { ?T1 a <http://valuenet/ontop/song> . ?T2 a <http://valuenet/ontop/files> . ?T1 <http://valuenet/ontop/ref-f> ?T2 . ?T1 <http://valuenet/ontop/song_name> ?T1_song_name . ?T2 <http://valuenet/ontop/formats> ?T2_formats . FILTER(?T2_formats = 'mp3') . FILTER (?T1_song_name in (?T3_song_name)) . ?T3 a <http://valuenet/ontop/song> . ?T3 <http://valuenet/ontop/song_name> ?T3_song_name . ?T3 <http://valuenet/ontop/resolution> ?T3_resolution . FILTER(?T3_resolution < 1000) . }
Find the names and number of works of all artists who have at least one English songs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_artist_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :song . ?T2 :ref-artist_name ?T1 . ?T1 :artist_name ?T1_artist_name . ?T2 :languages ?T2_languages . FILTER(?T2_languages = 'english') . } GROUP BY ?T1_artist_name HAVING(count( *) >= 1)",SELECT ?T1_artist_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/ref-artist_name> ?T1 . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T2 <http://valuenet/ontop/languages> ?T2_languages . FILTER(?T2_languages = 'english') . } GROUP BY ?T1_artist_name HAVING(count( *) >= 1)
"List the id, genre and artist name of English songs ordered by rating.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_f_id ?T1_genre_is ?T1_artist_name WHERE { ?T1 a :song . ?T1 :f_id ?T1_f_id . ?T1 :genre_is ?T1_genre_is . ?T1 :artist_name ?T1_artist_name . ?T1 :song-rating ?T1_rating . ?T1 :languages ?T1_languages . FILTER(?T1_languages = 'english') . } ORDER BY ASC (?T1_rating)",SELECT ?T1_f_id ?T1_genre_is ?T1_artist_name WHERE { ?T1 a <http://valuenet/ontop/song> . ?T1 <http://valuenet/ontop/f_id> ?T1_f_id . ?T1 <http://valuenet/ontop/genre_is> ?T1_genre_is . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T1 <http://valuenet/ontop/song-rating> ?T1_rating . ?T1 <http://valuenet/ontop/languages> ?T1_languages . FILTER(?T1_languages = 'english') . } ORDER BY ASC (?T1_rating)
Find the names of the artists who have produced English songs but have never received rating higher than 8.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a :song . ?T1 :artist_name ?T1_artist_name . ?T1 :languages ?T1_languages . FILTER(?T1_languages = 'english') . }} MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a :song . ?T2 :artist_name ?T2_artist_name . ?T2 :song-rating ?T2_rating . FILTER(?T2_rating > 8) . } } }",SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/song> . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T1 <http://valuenet/ontop/languages> ?T1_languages . FILTER(?T1_languages = 'english') . }} MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/artist_name> ?T2_artist_name . ?T2 <http://valuenet/ontop/song-rating> ?T2_rating . FILTER(?T2_rating > 8) . } } }
Find the names of the artists who are from Bangladesh and have never received rating higher than 7.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a :artist . ?T1 :artist_name ?T1_artist_name . ?T1 :country ?T1_country . FILTER(?T1_country = 'Bangladesh') . }} MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a :song . ?T2 :artist_name ?T2_artist_name . ?T2 :song-rating ?T2_rating . FILTER(?T2_rating > 7) . } } }",SELECT distinct?col1 WHERE { { SELECT DISTINCT (?T1_artist_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/artist_name> ?T1_artist_name . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country = 'Bangladesh') . }} MINUS {SELECT DISTINCT (?T2_artist_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/song> . ?T2 <http://valuenet/ontop/artist_name> ?T2_artist_name . ?T2 <http://valuenet/ontop/song-rating> ?T2_rating . FILTER(?T2_rating > 7) . } } }
