nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of artists.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/artist> . }
List the age of all music artists.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_age WHERE { ?T1 a :artist . ?T1 :age ?T1_age . }",SELECT ?T1_age WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/age> ?T1_age . }
Return the average age across all artists.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_100 ) WHERE { ?T1 a :artist . ?T1 :age ?T1_age . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_100 ) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/age> ?T1_age . }
Return the famous titles of the artist called 'Triumfall'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T1 :famous_title ?T1_famous_title . ?T1 :artist ?T1_artist . FILTER(?T1_artist = 'Triumfall') . }",SELECT ?T1_famous_title WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/famous_title> ?T1_famous_title . ?T1 <http://valuenet/ontop/artist> ?T1_artist . FILTER(?T1_artist = 'Triumfall') . }
Give the distinct famous release dates for all artists.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_famous_release_date WHERE { ?T1 a :artist . ?T1 :famous_release_date ?T1_famous_release_date . }",SELECT DISTINCT ?T1_famous_release_date WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/famous_release_date> ?T1_famous_release_date . }
Return the dates of ceremony and the results of all music festivals,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_ceremony ?T1_result WHERE { ?T1 a :music_festival . ?T1 :date_of_ceremony ?T1_date_of_ceremony . ?T1 :result ?T1_result . }",SELECT ?T1_date_of_ceremony ?T1_result WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/date_of_ceremony> ?T1_date_of_ceremony . ?T1 <http://valuenet/ontop/result> ?T1_result . }
Return the categories of music festivals that have the result 'Awarded'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_category WHERE { ?T1 a :music_festival . ?T1 :category ?T1_category . ?T1 :result ?T1_result . FILTER(?T1_result = 'Awarded') . }",SELECT ?T1_category WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/category> ?T1_category . ?T1 <http://valuenet/ontop/result> ?T1_result . FILTER(?T1_result = 'Awarded') . }
Give the maximum and minimum weeks on top across all volumes.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_132 ) (min( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_2 ) WHERE { ?T1 a :volume . ?T1 :weeks_on_top ?T1_weeks_on_top . ?T1 :weeks_on_top ?T1_weeks_on_top . }",SELECT (max( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_132 ) (min( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_2 ) WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/weeks_on_top> ?T1_weeks_on_top . ?T1 <http://valuenet/ontop/weeks_on_top> ?T1_weeks_on_top . }
Give the songs included in volumes that have more than 1 week on top.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song WHERE { ?T1 a :volume . ?T1 :song ?T1_song . ?T1 :weeks_on_top ?T1_weeks_on_top . FILTER(?T1_weeks_on_top > 1) . }",SELECT ?T1_song WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/song> ?T1_song . ?T1 <http://valuenet/ontop/weeks_on_top> ?T1_weeks_on_top . FILTER(?T1_weeks_on_top > 1) . }
Please list all songs in volumes in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song WHERE { ?T1 a :volume . ?T1 :song ?T1_song . ?T1 :song ?T1_song . } ORDER BY ASC (?T1_song)",SELECT ?T1_song WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/song> ?T1_song . ?T1 <http://valuenet/ontop/song> ?T1_song . } ORDER BY ASC (?T1_song)
Count the number of distinct artists who have volumes.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_74 ) WHERE { ?T1 a :volume . ?T1 :artist_id ?T1_artist_id . }",SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_74 ) WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/artist_id> ?T1_artist_id . }
Please show the date of ceremony of the volumes that last more than 2 weeks on top.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_ceremony WHERE { ?T1 a :music_festival . ?T2 a :volume . ?T1 :ref-volume ?T2 . ?T1 :date_of_ceremony ?T1_date_of_ceremony . ?T2 :weeks_on_top ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . }",SELECT ?T1_date_of_ceremony WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T2 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/ref-volume> ?T2 . ?T1 <http://valuenet/ontop/date_of_ceremony> ?T1_date_of_ceremony . ?T2 <http://valuenet/ontop/weeks_on_top> ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . }
Please show the songs that have result 'nominated' at music festivals.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song WHERE { ?T1 a :volume . ?T2 a :music_festival . ?T2 :ref-volume ?T1 . ?T1 :song ?T1_song . ?T2 :result ?T2_result . FILTER(?T2_result = 'Nominated') . }",SELECT ?T1_song WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T2 a <http://valuenet/ontop/music_festival> . ?T2 <http://valuenet/ontop/ref-volume> ?T1 . ?T1 <http://valuenet/ontop/song> ?T1_song . ?T2 <http://valuenet/ontop/result> ?T2_result . FILTER(?T2_result = 'Nominated') . }
Return the issue dates of volumes that are by the artist named Gorgoroth.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_issue_date WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :ref-artist ?T2 . ?T1 :issue_date ?T1_issue_date . ?T2 :artist ?T2_artist . FILTER(?T2_artist = 'Gorgoroth') . }",SELECT ?T1_issue_date WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T2 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/ref-artist> ?T2 . ?T1 <http://valuenet/ontop/issue_date> ?T1_issue_date . ?T2 <http://valuenet/ontop/artist> ?T2_artist . FILTER(?T2_artist = 'Gorgoroth') . }
Return names of songs in volumes that are by artists that are at least 32 years old.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_song WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :ref-artist ?T2 . ?T1 :song ?T1_song . ?T2 :age ?T2_age . FILTER(?T2_age >= 32) . }",SELECT ?T1_song WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T2 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/ref-artist> ?T2 . ?T1 <http://valuenet/ontop/song> ?T1_song . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age >= 32) . }
Return the average number of weeks on top for volumes by artists that are at most 25 years old.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_111 ) WHERE { ?T1 a :volume . ?T2 a :artist . ?T1 :ref-artist ?T2 . ?T1 :weeks_on_top ?T1_weeks_on_top . ?T2 :age ?T2_age . FILTER(?T2_age <= 25) . }",SELECT (avg( ?T1_weeks_on_top) as ?aggregation_T1_weeks_on_top_111 ) WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T2 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/ref-artist> ?T2 . ?T1 <http://valuenet/ontop/weeks_on_top> ?T1_weeks_on_top . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age <= 25) . }
Return the famous titles for artists that have volumes that lasted more than 2 weeks on top.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T2 a :volume . ?T2 :ref-artist ?T1 . ?T1 :famous_title ?T1_famous_title . ?T2 :weeks_on_top ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . }",SELECT ?T1_famous_title WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/volume> . ?T2 <http://valuenet/ontop/ref-artist> ?T1 . ?T1 <http://valuenet/ontop/famous_title> ?T1_famous_title . ?T2 <http://valuenet/ontop/weeks_on_top> ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . }
Please list the age and famous title of artists in descending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_famous_title ?T1_age WHERE { ?T1 a :artist . ?T1 :famous_title ?T1_famous_title . ?T1 :age ?T1_age . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age)",SELECT ?T1_famous_title ?T1_age WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/famous_title> ?T1_famous_title . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age)
Return the famous release date for the oldest artist.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_famous_release_date WHERE { ?T1 a :artist . ?T1 :famous_release_date ?T1_famous_release_date . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1",SELECT ?T1_famous_release_date WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/famous_release_date> ?T1_famous_release_date . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1
Please show the categories of the music festivals and the count.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a :music_festival . ?T1 :category ?T1_category . } GROUP BY ?T1_category",SELECT ?T1_category (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/category> ?T1_category . } GROUP BY ?T1_category
Return the result that is most frequent at music festivals.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a :music_festival . ?T1 :result ?T1_result . } GROUP BY ?T1_result ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/result> ?T1_result . } GROUP BY ?T1_result ORDER BY DESC (?aggregation_all) LIMIT 1
Please show the categories of the music festivals with count more than 1.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_category WHERE { ?T1 a :music_festival . ?T1 :category ?T1_category . } GROUP BY ?T1_category HAVING(count( *) > 1)",SELECT ?T1_category WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/category> ?T1_category . } GROUP BY ?T1_category HAVING(count( *) > 1)
Find the famous titles of artists that do not have any volume.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_famous_title WHERE { ?T1 a :artist . ?T1 :famous_title ?T1_famous_title . ?T1 :artist_id ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) . {SELECT ?T22_artist_id WHERE { ?T22 a :volume . ?T22 :artist_id ?T22_artist_id . } } }",SELECT ?T1_famous_title WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/famous_title> ?T1_famous_title . ?T1 <http://valuenet/ontop/artist_id> ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) . {SELECT ?T22_artist_id WHERE { ?T22 a <http://valuenet/ontop/volume> . ?T22 <http://valuenet/ontop/artist_id> ?T22_artist_id . } } }
Show the famous titles of the artists with both volumes that lasted more than 2 weeks on top and volumes that lasted less than 2 weeks on top.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_famous_title WHERE { ?T1 a :artist . ?T2 a :volume . ?T2 :ref-artist ?T1 . ?T1 :famous_title ?T1_famous_title . ?T2 :weeks_on_top ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . FILTER (?T1_famous_title in (?T3_famous_title)) . ?T3 a :artist . ?T4 a :volume . ?T4 :ref-artist ?T3 . ?T3 :famous_title ?T3_famous_title . ?T4 :weeks_on_top ?T4_weeks_on_top . FILTER(?T4_weeks_on_top < 2) . }",SELECT DISTINCT ?T1_famous_title WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/volume> . ?T2 <http://valuenet/ontop/ref-artist> ?T1 . ?T1 <http://valuenet/ontop/famous_title> ?T1_famous_title . ?T2 <http://valuenet/ontop/weeks_on_top> ?T2_weeks_on_top . FILTER(?T2_weeks_on_top > 2) . FILTER (?T1_famous_title in (?T3_famous_title)) . ?T3 a <http://valuenet/ontop/artist> . ?T4 a <http://valuenet/ontop/volume> . ?T4 <http://valuenet/ontop/ref-artist> ?T3 . ?T3 <http://valuenet/ontop/famous_title> ?T3_famous_title . ?T4 <http://valuenet/ontop/weeks_on_top> ?T4_weeks_on_top . FILTER(?T4_weeks_on_top < 2) . }
Return the dates of ceremony corresponding to music festivals that had the category 'Best Song' and result 'Awarded'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_ceremony WHERE { ?T1 a :music_festival . ?T1 :date_of_ceremony ?T1_date_of_ceremony . ?T1 :category ?T1_category . ?T1 :result ?T1_result . FILTER(?T1_category = 'Best Song' && ?T1_result = 'Awarded') . }",SELECT ?T1_date_of_ceremony WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/date_of_ceremony> ?T1_date_of_ceremony . ?T1 <http://valuenet/ontop/category> ?T1_category . ?T1 <http://valuenet/ontop/result> ?T1_result . FILTER(?T1_category = 'Best Song' && ?T1_result = 'Awarded') . }
Return the issue date of the volume that has spent the fewest weeks on top.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_issue_date WHERE { ?T1 a :volume . ?T1 :issue_date ?T1_issue_date . ?T1 :weeks_on_top ?T1_weeks_on_top . } ORDER BY ASC (?T1_weeks_on_top) LIMIT 1",SELECT ?T1_issue_date WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/issue_date> ?T1_issue_date . ?T1 <http://valuenet/ontop/weeks_on_top> ?T1_weeks_on_top . } ORDER BY ASC (?T1_weeks_on_top) LIMIT 1
Count the number of artists who have had volumes.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_119 ) WHERE { ?T1 a :volume . ?T1 :artist_id ?T1_artist_id . }",SELECT DISTINCT (count(DISTINCT ?T1_artist_id) as ?aggregation_T1_artist_id_119 ) WHERE { ?T1 a <http://valuenet/ontop/volume> . ?T1 <http://valuenet/ontop/artist_id> ?T1_artist_id . }
"Please show the results of music festivals and the number of music festivals that have had each, ordered by this count.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a :music_festival . ?T1 :result ?T1_result . } GROUP BY ?T1_result ORDER BY DESC (count( *) )",SELECT ?T1_result (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/music_festival> . ?T1 <http://valuenet/ontop/result> ?T1_result . } GROUP BY ?T1_result ORDER BY DESC (count( *) )
