nl_question,sparql_partial_uri,sparql_complete_uri
Find the number of people who is under 40 for each gender.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_gender WHERE { ?T1 a :person . ?T1 :gender ?T1_gender . ?T1 :age ?T1_age . FILTER(?T1_age < 40) . } GROUP BY ?T1_gender",SELECT (count( *) as ?aggregation_all) ?T1_gender WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/gender> ?T1_gender . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age < 40) . } GROUP BY ?T1_gender
Find the name of people whose age is greater than any engineer sorted by their age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age > (?T22_job)) . {SELECT (min( ?T22_age) as ?aggregation_T22_age_18 ) WHERE { ?T22 a :person . ?T22 :age ?T22_age . ?T22 :job ?T22_job . FILTER(?T22_job = 'engineer') . } } } ORDER BY ASC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > (?T22_job)) . {SELECT (min( ?T22_age) as ?aggregation_T22_age_18 ) WHERE { ?T22 a <http://valuenet/ontop/person> . ?T22 <http://valuenet/ontop/age> ?T22_age . ?T22 <http://valuenet/ontop/job> ?T22_job . FILTER(?T22_job = 'engineer') . } } } ORDER BY ASC (?T1_age)
What is the name of all the people who are older than at least one engineer? Order them by age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age > (?T22_job)) . {SELECT (min( ?T22_age) as ?aggregation_T22_age_131 ) WHERE { ?T22 a :person . ?T22 :age ?T22_age . ?T22 :job ?T22_job . FILTER(?T22_job = 'engineer') . } } } ORDER BY ASC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > (?T22_job)) . {SELECT (min( ?T22_age) as ?aggregation_T22_age_131 ) WHERE { ?T22 a <http://valuenet/ontop/person> . ?T22 <http://valuenet/ontop/age> ?T22_age . ?T22 <http://valuenet/ontop/job> ?T22_job . FILTER(?T22_job = 'engineer') . } } } ORDER BY ASC (?T1_age)
Find the number of people whose age is greater than all engineers.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :person . ?T1 :age ?T1_age . FILTER(?T1_age > (?T22_job)) . {SELECT (max( ?T22_age) as ?aggregation_T22_age_21 ) WHERE { ?T22 a :person . ?T22 :age ?T22_age . ?T22 :job ?T22_job . FILTER(?T22_job = 'engineer') . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > (?T22_job)) . {SELECT (max( ?T22_age) as ?aggregation_T22_age_21 ) WHERE { ?T22 a <http://valuenet/ontop/person> . ?T22 <http://valuenet/ontop/age> ?T22_age . ?T22 <http://valuenet/ontop/job> ?T22_job . FILTER(?T22_job = 'engineer') . } } }
"list the name, job title of all people ordered by their names.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_job WHERE { ?T1 a :person . ?T1 :name ?T1_name . ?T1 :job ?T1_job . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name ?T1_job WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/job> ?T1_job . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Find the names of all person sorted in the descending order using age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age)
Find the name and age of all males in order of their age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :person . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :gender ?T1_gender . FILTER(?T1_gender = 'male') . } ORDER BY ASC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/gender> ?T1_gender . FILTER(?T1_gender = 'male') . } ORDER BY ASC (?T1_age)
Find the name and age of the person who is a friend of both Dan and Alice.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name ?T1_age WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :ref-friend ?T1 . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T2 :friend ?T2_friend . FILTER(?T2_friend = 'Dan') . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_age in (?T3_age)) . ?T3 a :person . ?T4 a :personfriend . ?T4 :ref-friend ?T3 . ?T3 :name ?T3_name . ?T3 :age ?T3_age . ?T4 :friend ?T4_friend . FILTER(?T4_friend = 'Alice') . }",SELECT DISTINCT ?T1_name ?T1_age WHERE { ?T1 a <http://valuenet/ontop/person> . ?T2 a <http://valuenet/ontop/personfriend> . ?T2 <http://valuenet/ontop/ref-friend> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T2 <http://valuenet/ontop/friend> ?T2_friend . FILTER(?T2_friend = 'Dan') . FILTER (?T1_name in (?T3_name)) . FILTER (?T1_age in (?T3_age)) . ?T3 a <http://valuenet/ontop/person> . ?T4 a <http://valuenet/ontop/personfriend> . ?T4 <http://valuenet/ontop/ref-friend> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T3 <http://valuenet/ontop/age> ?T3_age . ?T4 <http://valuenet/ontop/friend> ?T4_friend . FILTER(?T4_friend = 'Alice') . }
Find the name of the person who has no student friends.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :person . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :personfriend . ?T3 a :person . ?T2 :ref-friend ?T3 . ?T2 :name ?T2_name . ?T3 :job ?T3_job . FILTER(?T3_job = 'student') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/personfriend> . ?T3 a <http://valuenet/ontop/person> . ?T2 <http://valuenet/ontop/ref-friend> ?T3 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/job> ?T3_job . FILTER(?T3_job = 'student') . } } }
Find the person who has exactly one friend.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) = 1)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/personfriend> . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) = 1)
Find the name of persons who are friends with Bob.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :ref-friend ?T1 . ?T1 :name ?T1_name . ?T2 :friend ?T2_friend . FILTER(?T2_friend = 'Bob') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/person> . ?T2 a <http://valuenet/ontop/personfriend> . ?T2 <http://valuenet/ontop/ref-friend> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/friend> ?T2_friend . FILTER(?T2_friend = 'Bob') . }
Find the female friends of Alice.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_friend WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :ref-friend ?T2 . ?T1 :friend ?T1_friend . ?T1 :name ?T1_name . ?T2 :gender ?T2_gender . FILTER(?T1_name = 'Alice' && ?T2_gender = 'female') . }",SELECT ?T1_friend WHERE { ?T1 a <http://valuenet/ontop/personfriend> . ?T2 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/ref-friend> ?T2 . ?T1 <http://valuenet/ontop/friend> ?T1_friend . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/gender> ?T2_gender . FILTER(?T1_name = 'Alice' && ?T2_gender = 'female') . }
Who has friends that are older than the average age? Print their friends and their ages as well,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name ?T1_friend ?T2_age WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :ref-friend ?T2 . ?T1 :name ?T1_name . ?T1 :friend ?T1_friend . ?T2 :age ?T2_age . ?T2 :age ?T2_age . FILTER(?T2_age > (?aggregation_T23_age_19)) . {SELECT (avg( ?T23_age) as ?aggregation_T23_age_19 ) WHERE { ?T23 a :person . ?T23 :age ?T23_age . } } }",SELECT DISTINCT ?T1_name ?T1_friend ?T2_age WHERE { ?T1 a <http://valuenet/ontop/personfriend> . ?T2 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/ref-friend> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/friend> ?T1_friend . ?T2 <http://valuenet/ontop/age> ?T2_age . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age > (?aggregation_T23_age_19)) . {SELECT (avg( ?T23_age) as ?aggregation_T23_age_19 ) WHERE { ?T23 a <http://valuenet/ontop/person> . ?T23 <http://valuenet/ontop/age> ?T23_age . } } }
Find the name of persons who are friends with Alice for the shortest years.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :personfriend . ?T1 :name ?T1_name . ?T1 :friend ?T1_friend . ?T1 :year ?T1_year . FILTER(?T1_friend = 'Alice' && ?T1_year = (?T22_friend)) . {SELECT (min( ?T22_year) as ?aggregation_T22_year_55 ) WHERE { ?T22 a :personfriend . ?T22 :year ?T22_year . ?T22 :friend ?T22_friend . FILTER(?T22_friend = 'Alice') . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/personfriend> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/friend> ?T1_friend . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_friend = 'Alice' && ?T1_year = (?T22_friend)) . {SELECT (min( ?T22_year) as ?aggregation_T22_year_55 ) WHERE { ?T22 a <http://valuenet/ontop/personfriend> . ?T22 <http://valuenet/ontop/year> ?T22_year . ?T22 <http://valuenet/ontop/friend> ?T22_friend . FILTER(?T22_friend = 'Alice') . } } }
"Find the name, age, and job title of persons who are friends with Alice for the longest years.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_age ?T1_job WHERE { ?T1 a :person . ?T2 a :personfriend . ?T2 :ref-friend ?T1 . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :job ?T1_job . ?T2 :friend ?T2_friend . ?T2 :year ?T2_year . FILTER(?T2_friend = 'Alice' && ?T2_year = (?T23_friend)) . {SELECT (max( ?T23_year) as ?aggregation_T23_year_2 ) WHERE { ?T23 a :personfriend . ?T23 :year ?T23_year . ?T23 :friend ?T23_friend . FILTER(?T23_friend = 'Alice') . } } }",SELECT ?T1_name ?T1_age ?T1_job WHERE { ?T1 a <http://valuenet/ontop/person> . ?T2 a <http://valuenet/ontop/personfriend> . ?T2 <http://valuenet/ontop/ref-friend> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/job> ?T1_job . ?T2 <http://valuenet/ontop/friend> ?T2_friend . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_friend = 'Alice' && ?T2_year = (?T23_friend)) . {SELECT (max( ?T23_year) as ?aggregation_T23_year_2 ) WHERE { ?T23 a <http://valuenet/ontop/personfriend> . ?T23 <http://valuenet/ontop/year> ?T23_year . ?T23 <http://valuenet/ontop/friend> ?T23_friend . FILTER(?T23_friend = 'Alice') . } } }
What is the total number of people who has no friend living in the city of Austin.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_46 ) WHERE { ?T1 a :personfriend . ?T1 :name ?T1_name . ?T1 :friend ?T1_friend . FILTER(?T1_friend not in (?T22_city)) . {SELECT ?T22_name WHERE { ?T22 a :person . ?T22 :name ?T22_name . ?T22 :city ?T22_city . FILTER(?T22_city = 'Austin') . } } }",SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_46 ) WHERE { ?T1 a <http://valuenet/ontop/personfriend> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/friend> ?T1_friend . FILTER(?T1_friend not in (?T22_city)) . {SELECT ?T22_name WHERE { ?T22 a <http://valuenet/ontop/person> . ?T22 <http://valuenet/ontop/name> ?T22_name . ?T22 <http://valuenet/ontop/city> ?T22_city . FILTER(?T22_city = 'Austin') . } } }
Find Alice's friends of friends.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :personfriend . ?T2 a :person . ?T1 :ref-friend ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T1 :name ?T1_name . FILTER(?T2_name = 'Alice' && ?T1_name != 'Alice') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/personfriend> . ?T2 a <http://valuenet/ontop/person> . ?T1 <http://valuenet/ontop/ref-friend> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(?T2_name = 'Alice' && ?T1_name != 'Alice') . }
