nl_question,sparql_partial_uri,sparql_complete_uri
List the names of journalists in ascending order of years working.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :journalist . ?T1 :name ?T1_name . ?T1 :years_working ?T1_years_working . } ORDER BY ASC (?T1_years_working)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/years_working> ?T1_years_working . } ORDER BY ASC (?T1_years_working)
Show the names of journalists from 'England' or 'Wales'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :journalist . ?T1 :name ?T1_name . ?T1 :nationality ?T1_nationality . ?T1 :nationality ?T1_nationality . FILTER(?T1_nationality = 'England' || ?T1_nationality = 'Wales') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . FILTER(?T1_nationality = 'England' || ?T1_nationality = 'Wales') . }
Show the different nationalities and the number of journalists of each nationality.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist . ?T1 :nationality ?T1_nationality . } GROUP BY ?T1_nationality",SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . } GROUP BY ?T1_nationality
Show the most common nationality for journalists.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist . ?T1 :nationality ?T1_nationality . } GROUP BY ?T1_nationality ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . } GROUP BY ?T1_nationality ORDER BY DESC (?aggregation_all) LIMIT 1
Show the nations that have both journalists with more than 10 years of working and journalists with less than 3 years of working.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_nationality WHERE { ?T1 a :journalist . ?T1 :nationality ?T1_nationality . ?T1 :years_working ?T1_years_working . FILTER(?T1_years_working > 10) . FILTER (?T1_nationality in (?T2_nationality)) . ?T2 a :journalist . ?T2 :nationality ?T2_nationality . ?T2 :years_working ?T2_years_working . FILTER(?T2_years_working < 3) . }",SELECT DISTINCT ?T1_nationality WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . ?T1 <http://valuenet/ontop/years_working> ?T1_years_working . FILTER(?T1_years_working > 10) . FILTER (?T1_nationality in (?T2_nationality)) . ?T2 a <http://valuenet/ontop/journalist> . ?T2 <http://valuenet/ontop/nationality> ?T2_nationality . ?T2 <http://valuenet/ontop/years_working> ?T2_years_working . FILTER(?T2_years_working < 3) . }
"Show the dates, places, and names of events in descending order of the attendance.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date ?T1_name ?T1_venue WHERE { ?T1 a :event . ?T1 :date ?T1_date . ?T1 :name ?T1_name . ?T1 :venue ?T1_venue . ?T1 :event_attendance ?T1_event_attendance . } ORDER BY DESC (?T1_event_attendance)",SELECT ?T1_date ?T1_name ?T1_venue WHERE { ?T1 a <http://valuenet/ontop/event> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T1 <http://valuenet/ontop/event_attendance> ?T1_event_attendance . } ORDER BY DESC (?T1_event_attendance)
Show the names of journalists and the dates of the events they reported.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_date WHERE { ?T1 a :journalist . ?T13 a :news_report . ?T13 :ref-journalist ?T1 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . ?T2 a :event . ?T13 :ref-event ?T2 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . }",SELECT ?T1_name ?T2_date WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T13 a <http://valuenet/ontop/news_report> . ?T13 <http://valuenet/ontop/ref-journalist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 a <http://valuenet/ontop/event> . ?T13 <http://valuenet/ontop/ref-event> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . }
Show the names of journalists and the names of the events they reported in ascending order,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :journalist . ?T13 a :news_report . ?T13 :ref-journalist ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 :event_attendance ?T2_event_attendance . ?T2 a :event . ?T13 :ref-event ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 :event_attendance ?T2_event_attendance . } ORDER BY ASC (?T2_event_attendance)",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T13 a <http://valuenet/ontop/news_report> . ?T13 <http://valuenet/ontop/ref-journalist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/event_attendance> ?T2_event_attendance . ?T2 a <http://valuenet/ontop/event> . ?T13 <http://valuenet/ontop/ref-event> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/event_attendance> ?T2_event_attendance . } ORDER BY ASC (?T2_event_attendance)
Show the names of journalists and the number of events they reported.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :journalist . ?T2 a :news_report . ?T2 :ref-journalist ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T2 a <http://valuenet/ontop/news_report> . ?T2 <http://valuenet/ontop/ref-journalist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Show the names of journalists that have reported more than one event.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :journalist . ?T2 a :news_report . ?T2 :ref-journalist ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T2 a <http://valuenet/ontop/news_report> . ?T2 <http://valuenet/ontop/ref-journalist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)
List the names of journalists who have not reported any event.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :journalist . ?T1 :name ?T1_name . ?T1 :journalist_id ?T1_journalist_id . FILTER(?T1_journalist_id not in (?T22_journalist_id)) . {SELECT ?T22_journalist_id WHERE { ?T22 a :news_report . ?T22 :journalist_id ?T22_journalist_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/journalist_id> ?T1_journalist_id . FILTER(?T1_journalist_id not in (?T22_journalist_id)) . {SELECT ?T22_journalist_id WHERE { ?T22 a <http://valuenet/ontop/news_report> . ?T22 <http://valuenet/ontop/journalist_id> ?T22_journalist_id . } } }
Find the average age and experience working length of journalists working on different role type.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_20 ) (avg( ?T1_years_working) as ?aggregation_T1_years_working_114 ) ?T2_work_type WHERE { ?T1 a :journalist . ?T2 a :news_report . ?T2 :ref-journalist ?T1 . ?T1 :age ?T1_age . ?T1 :years_working ?T1_years_working . ?T2 :work_type ?T2_work_type . } GROUP BY ?T2_work_type",SELECT (avg( ?T1_age) as ?aggregation_T1_age_20 ) (avg( ?T1_years_working) as ?aggregation_T1_years_working_114 ) ?T2_work_type WHERE { ?T1 a <http://valuenet/ontop/journalist> . ?T2 a <http://valuenet/ontop/news_report> . ?T2 <http://valuenet/ontop/ref-journalist> ?T1 . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/years_working> ?T1_years_working . ?T2 <http://valuenet/ontop/work_type> ?T2_work_type . } GROUP BY ?T2_work_type
List the event venues and names that have the top 2 most number of people attended.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_venue ?T1_name WHERE { ?T1 a :event . ?T1 :venue ?T1_venue . ?T1 :name ?T1_name . ?T1 :event_attendance ?T1_event_attendance . } ORDER BY DESC (?T1_event_attendance) LIMIT 1",SELECT ?T1_venue ?T1_name WHERE { ?T1 a <http://valuenet/ontop/event> . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/event_attendance> ?T1_event_attendance . } ORDER BY DESC (?T1_event_attendance) LIMIT 1
