nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of regions.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :region . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/region> . }
Show all distinct region names ordered by their labels.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_region_name ?T1_label WHERE { ?T1 a :region . ?T1 :region_name ?T1_region_name . ?T1 :has_label ?T1_label . ?T1 :has_label ?T1_label . } ORDER BY ASC (?T1_label)",SELECT DISTINCT ?T1_region_name ?T1_label WHERE { ?T1 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T1 <http://valuenet/ontop/has_label> ?T1_label . ?T1 <http://valuenet/ontop/has_label> ?T1_label . } ORDER BY ASC (?T1_label)
Count the number of different parties.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_party_name) as ?aggregation_T1_party_name_27 ) WHERE { ?T1 a :party . ?T1 :party_name ?T1_party_name . }",SELECT DISTINCT (count(DISTINCT ?T1_party_name) as ?aggregation_T1_party_name_27 ) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . }
"Show the ministers and the time they took and left office, listed by the time they left office.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_minister ?T1_took_office ?T1_left_office WHERE { ?T1 a :party . ?T1 :minister ?T1_minister . ?T1 :took_office ?T1_took_office . ?T1 :left_office ?T1_left_office . ?T1 :left_office ?T1_left_office . } ORDER BY ASC (?T1_left_office)",SELECT ?T1_minister ?T1_took_office ?T1_left_office WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/minister> ?T1_minister . ?T1 <http://valuenet/ontop/took_office> ?T1_took_office . ?T1 <http://valuenet/ontop/left_office> ?T1_left_office . ?T1 <http://valuenet/ontop/left_office> ?T1_left_office . } ORDER BY ASC (?T1_left_office)
Show the minister who took office after 1961 or before 1959.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :minister ?T1_minister . ?T1 :took_office ?T1_took_office . ?T1 :took_office ?T1_took_office . FILTER(?T1_took_office > 1961 || ?T1_took_office < 1959) . }",SELECT ?T1_minister WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/minister> ?T1_minister . ?T1 <http://valuenet/ontop/took_office> ?T1_took_office . ?T1 <http://valuenet/ontop/took_office> ?T1_took_office . FILTER(?T1_took_office > 1961 || ?T1_took_office < 1959) . }
Show all ministers who do not belong to Progress Party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :minister ?T1_minister . ?T1 :party_name ?T1_party_name . FILTER(?T1_party_name != 'Progress Party') . }",SELECT ?T1_minister WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/minister> ?T1_minister . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . FILTER(?T1_party_name != 'Progress Party') . }
Show all ministers and parties they belong to in descending order of the time they took office.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_minister ?T1_party_name WHERE { ?T1 a :party . ?T1 :minister ?T1_minister . ?T1 :party_name ?T1_party_name . ?T1 :took_office ?T1_took_office . } ORDER BY DESC (?T1_took_office)",SELECT ?T1_minister ?T1_party_name WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/minister> ?T1_minister . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . ?T1 <http://valuenet/ontop/took_office> ?T1_took_office . } ORDER BY DESC (?T1_took_office)
Return the minister who left office at the latest time.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_minister WHERE { ?T1 a :party . ?T1 :minister ?T1_minister . ?T1 :left_office ?T1_left_office . } ORDER BY DESC (?T1_left_office) LIMIT 1",SELECT ?T1_minister WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/minister> ?T1_minister . ?T1 <http://valuenet/ontop/left_office> ?T1_left_office . } ORDER BY DESC (?T1_left_office) LIMIT 1
List member names and their party names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_member_name ?T2_party_name WHERE { ?T1 a :member . ?T2 a :party . ?T1 :ref-party ?T2 . ?T1 :member_name ?T1_member_name . ?T2 :party_name ?T2_party_name . }",SELECT ?T1_member_name ?T2_party_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/ref-party> ?T2 . ?T1 <http://valuenet/ontop/member_name> ?T1_member_name . ?T2 <http://valuenet/ontop/party_name> ?T2_party_name . }
Show all party names and the number of members in each party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :member . ?T2 :ref-party ?T1 . ?T1 :party_name ?T1_party_name . } GROUP BY ?T1_party_name",SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/member> . ?T2 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . } GROUP BY ?T1_party_name
Show all party names and their region names.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_name ?T2_region_name WHERE { ?T1 a :party . ?T2 a :region . ?T1 :ref-region ?T2 . ?T1 :party_name ?T1_party_name . ?T2 :region_name ?T2_region_name . }",SELECT ?T1_party_name ?T2_region_name WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/ref-region> ?T2 . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . }
Show names of parties that does not have any members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_name WHERE { ?T1 a :party . ?T1 :party_name ?T1_party_name . ?T1 :party_id ?T1_party_id . FILTER(?T1_party_id not in (?T22_party_id)) . {SELECT ?T22_party_id WHERE { ?T22 a :member . ?T22 :party_id ?T22_party_id . } } }",SELECT ?T1_party_name WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . ?T1 <http://valuenet/ontop/party_id> ?T1_party_id . FILTER(?T1_party_id not in (?T22_party_id)) . {SELECT ?T22_party_id WHERE { ?T22 a <http://valuenet/ontop/member> . ?T22 <http://valuenet/ontop/party_id> ?T22_party_id . } } }
Show the member names which are in both the party with id 3 and the party with id 1.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_member_name WHERE { ?T1 a :member . ?T1 :member_name ?T1_member_name . ?T1 :party_id ?T1_party_id . FILTER(?T1_party_id = 3) . FILTER (?T1_member_name in (?T2_member_name)) . ?T2 a :member . ?T2 :member_name ?T2_member_name . ?T2 :party_id ?T2_party_id . FILTER(?T2_party_id = 1) . }",SELECT DISTINCT ?T1_member_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/member_name> ?T1_member_name . ?T1 <http://valuenet/ontop/party_id> ?T1_party_id . FILTER(?T1_party_id = 3) . FILTER (?T1_member_name in (?T2_member_name)) . ?T2 a <http://valuenet/ontop/member> . ?T2 <http://valuenet/ontop/member_name> ?T2_member_name . ?T2 <http://valuenet/ontop/party_id> ?T2_party_id . FILTER(?T2_party_id = 1) . }
Show member names that are not in the Progress Party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_member_name WHERE { ?T1 a :member . ?T2 a :party . ?T1 :ref-party ?T2 . ?T1 :member_name ?T1_member_name . ?T2 :party_name ?T2_party_name . FILTER(?T2_party_name != 'Progress Party') . }",SELECT ?T1_member_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/ref-party> ?T2 . ?T1 <http://valuenet/ontop/member_name> ?T1_member_name . ?T2 <http://valuenet/ontop/party_name> ?T2_party_name . FILTER(?T2_party_name != 'Progress Party') . }
Count the number of party events.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party_events . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party_events> . }
Show party names and the number of events for each party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :party_events . ?T2 :ref-party ?T1 . ?T1 :party_name ?T1_party_name . } GROUP BY ?T1_party_name",SELECT ?T1_party_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/party_events> . ?T2 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . } GROUP BY ?T1_party_name
Show all member names who are not in charge of any event.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_member_name as ?col1) WHERE { ?T1 a :member . ?T1 :member_name ?T1_member_name . }} MINUS {SELECT (?T2_member_name as ?col1) WHERE { ?T2 a :member . ?T2 :member_name ?T2_member_name . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_member_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/member_name> ?T1_member_name . }} MINUS {SELECT (?T2_member_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/member> . ?T2 <http://valuenet/ontop/member_name> ?T2_member_name . } } }
Return the names of parties that have two or more events.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_name WHERE { ?T1 a :party . ?T2 a :party_events . ?T2 :ref-party ?T1 . ?T1 :party_name ?T1_party_name . } GROUP BY ?T1_party_name HAVING(count( *) >= 2)",SELECT ?T1_party_name WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/party_events> . ?T2 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/party_name> ?T1_party_name . } GROUP BY ?T1_party_name HAVING(count( *) >= 2)
Return the name of the member who is in charge of the most events.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_member_name (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T2 a :party_events . ?T2 :ref-member_in_charge ?T1 . ?T1 :member_name ?T1_member_name . } GROUP BY ?T1_member_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_member_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/party_events> . ?T2 <http://valuenet/ontop/ref-member_in_charge> ?T1 . ?T1 <http://valuenet/ontop/member_name> ?T1_member_name . } GROUP BY ?T1_member_name ORDER BY DESC (?aggregation_all) LIMIT 1
find the event names that have more than 2 records.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_event_name WHERE { ?T1 a :party_events . ?T1 :event_name ?T1_event_name . } GROUP BY ?T1_event_name HAVING(count( *) > 2)",SELECT ?T1_event_name WHERE { ?T1 a <http://valuenet/ontop/party_events> . ?T1 <http://valuenet/ontop/event_name> ?T1_event_name . } GROUP BY ?T1_event_name HAVING(count( *) > 2)
Count the number of Annual Meeting events that took place in the region of the United Kingdom.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party . ?T2 a :region . ?T1 :ref-region ?T2 . ?T2 :region_name ?T2_region_name . ?T3 :event_name ?T3_event_name . ?T3 a :party_events . ?T3 :ref-party ?T1 . ?T2 :region_name ?T2_region_name . ?T3 :event_name ?T3_event_name . FILTER(?T2_region_name = 'United Kingdom' && ?T3_event_name = 'Annaual Meeting') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T2 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/ref-region> ?T2 . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . ?T3 <http://valuenet/ontop/event_name> ?T3_event_name . ?T3 a <http://valuenet/ontop/party_events> . ?T3 <http://valuenet/ontop/ref-party> ?T1 . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . ?T3 <http://valuenet/ontop/event_name> ?T3_event_name . FILTER(?T2_region_name = 'United Kingdom' && ?T3_event_name = 'Annaual Meeting') . }
