nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of parties.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :party . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/party> . }
List the themes of parties in ascending order of number of hosts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_theme WHERE { ?T1 a :party . ?T1 :party_theme ?T1_party_theme . ?T1 :number_of_hosts ?T1_number_of_hosts . } ORDER BY ASC (?T1_number_of_hosts)",SELECT ?T1_party_theme WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/party_theme> ?T1_party_theme . ?T1 <http://valuenet/ontop/number_of_hosts> ?T1_number_of_hosts . } ORDER BY ASC (?T1_number_of_hosts)
Give me the theme and location of each party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_theme ?T1_location WHERE { ?T1 a :party . ?T1 :party_theme ?T1_party_theme . ?T1 :location ?T1_location . }",SELECT ?T1_party_theme ?T1_location WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/party_theme> ?T1_party_theme . ?T1 <http://valuenet/ontop/location> ?T1_location . }
Show the first year and last year of parties with theme 'Spring' or 'Teqnology'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_year ?T1_last_year WHERE { ?T1 a :party . ?T1 :first_year ?T1_first_year . ?T1 :last_year ?T1_last_year . ?T1 :party_theme ?T1_party_theme . ?T1 :party_theme ?T1_party_theme . FILTER(?T1_party_theme = 'Spring' || ?T1_party_theme = 'Teqnology') . }",SELECT ?T1_first_year ?T1_last_year WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/first_year> ?T1_first_year . ?T1 <http://valuenet/ontop/last_year> ?T1_last_year . ?T1 <http://valuenet/ontop/party_theme> ?T1_party_theme . ?T1 <http://valuenet/ontop/party_theme> ?T1_party_theme . FILTER(?T1_party_theme = 'Spring' || ?T1_party_theme = 'Teqnology') . }
Compute the average number of hosts for parties.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_number_of_hosts) as ?aggregation_T1_number_of_hosts_141 ) WHERE { ?T1 a :party . ?T1 :number_of_hosts ?T1_number_of_hosts . }",SELECT (avg( ?T1_number_of_hosts) as ?aggregation_T1_number_of_hosts_141 ) WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/number_of_hosts> ?T1_number_of_hosts . }
Which party had the most hosts? Give me the party location.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :party . ?T1 :location ?T1_location . ?T1 :number_of_hosts ?T1_number_of_hosts . } ORDER BY DESC (?T1_number_of_hosts) LIMIT 1",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/party> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/number_of_hosts> ?T1_number_of_hosts . } ORDER BY DESC (?T1_number_of_hosts) LIMIT 1
Show different nationalities along with the number of hosts of each nationality.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :host . ?T1 :nationality ?T1_nationality . } GROUP BY ?T1_nationality",SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/host> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . } GROUP BY ?T1_nationality
Show the most common nationality of hosts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :host . ?T1 :nationality ?T1_nationality . } GROUP BY ?T1_nationality ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/host> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . } GROUP BY ?T1_nationality ORDER BY DESC (?aggregation_all) LIMIT 1
Show the nations that have both hosts older than 45 and hosts younger than 35.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_nationality WHERE { ?T1 a :host . ?T1 :nationality ?T1_nationality . ?T1 :age ?T1_age . FILTER(?T1_age > 45) . FILTER (?T1_nationality in (?T2_nationality)) . ?T2 a :host . ?T2 :nationality ?T2_nationality . ?T2 :age ?T2_age . FILTER(?T2_age < 35) . }",SELECT DISTINCT ?T1_nationality WHERE { ?T1 a <http://valuenet/ontop/host> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 45) . FILTER (?T1_nationality in (?T2_nationality)) . ?T2 a <http://valuenet/ontop/host> . ?T2 <http://valuenet/ontop/nationality> ?T2_nationality . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age < 35) . }
Show the themes of parties and the names of the party hosts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party_theme ?T2_name WHERE { ?T1 a :party . ?T13 a :party_host . ?T13 :ref-party ?T1 . ?T1 :party_theme ?T1_party_theme . ?T2 :name ?T2_name . ?T2 a :host . ?T13 :ref-host ?T2 . ?T1 :party_theme ?T1_party_theme . ?T2 :name ?T2_name . }",SELECT ?T1_party_theme ?T2_name WHERE { ?T1 a <http://valuenet/ontop/party> . ?T13 a <http://valuenet/ontop/party_host> . ?T13 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/party_theme> ?T1_party_theme . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/host> . ?T13 <http://valuenet/ontop/ref-host> ?T2 . ?T1 <http://valuenet/ontop/party_theme> ?T1_party_theme . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the locations of parties and the names of the party hosts in ascending order of the age of the host.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location ?T2_name WHERE { ?T1 a :party . ?T13 a :party_host . ?T13 :ref-party ?T1 . ?T1 :location ?T1_location . ?T2 :name ?T2_name . ?T2 :age ?T2_age . ?T2 a :host . ?T13 :ref-host ?T2 . ?T1 :location ?T1_location . ?T2 :name ?T2_name . ?T2 :age ?T2_age . } ORDER BY ASC (?T2_age)",SELECT ?T1_location ?T2_name WHERE { ?T1 a <http://valuenet/ontop/party> . ?T13 a <http://valuenet/ontop/party_host> . ?T13 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/age> ?T2_age . ?T2 a <http://valuenet/ontop/host> . ?T13 <http://valuenet/ontop/ref-host> ?T2 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/age> ?T2_age . } ORDER BY ASC (?T2_age)
Show the locations of parties with hosts older than 50.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :party . ?T13 a :party_host . ?T13 :ref-party ?T1 . ?T1 :location ?T1_location . ?T2 :age ?T2_age . ?T2 a :host . ?T13 :ref-host ?T2 . ?T1 :location ?T1_location . ?T2 :age ?T2_age . FILTER(?T2_age > 50) . }",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/party> . ?T13 a <http://valuenet/ontop/party_host> . ?T13 <http://valuenet/ontop/ref-party> ?T1 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/age> ?T2_age . ?T2 a <http://valuenet/ontop/host> . ?T13 <http://valuenet/ontop/ref-host> ?T2 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age > 50) . }
Show the host names for parties with number of hosts greater than 20.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :host . ?T13 a :party_host . ?T13 :ref-host ?T1 . ?T1 :name ?T1_name . ?T2 :number_of_hosts ?T2_number_of_hosts . ?T2 a :party . ?T13 :ref-party ?T2 . ?T1 :name ?T1_name . ?T2 :number_of_hosts ?T2_number_of_hosts . FILTER(?T2_number_of_hosts > 20) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/host> . ?T13 a <http://valuenet/ontop/party_host> . ?T13 <http://valuenet/ontop/ref-host> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/number_of_hosts> ?T2_number_of_hosts . ?T2 a <http://valuenet/ontop/party> . ?T13 <http://valuenet/ontop/ref-party> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/number_of_hosts> ?T2_number_of_hosts . FILTER(?T2_number_of_hosts > 20) . }
Show the name and the nationality of the oldest host.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_nationality WHERE { ?T1 a :host . ?T1 :name ?T1_name . ?T1 :nationality ?T1_nationality . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1",SELECT ?T1_name ?T1_nationality WHERE { ?T1 a <http://valuenet/ontop/host> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1
List the names of hosts who did not serve as a host of any party in our record.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :host . ?T1 :name ?T1_name . ?T1 :host_id ?T1_host_id . FILTER NOT EXISTS { ?T22 a :party_host . ?T22 :host_id ?T22_host_id . FILTER(?T1_host_id = ?T22_host_id) . } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/host> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/host_id> ?T1_host_id . FILTER NOT EXISTS { ?T22 a <http://valuenet/ontop/party_host> . ?T22 <http://valuenet/ontop/host_id> ?T22_host_id . FILTER(?T1_host_id = ?T22_host_id) . } }
