nl_question,sparql_partial_uri,sparql_complete_uri
List the hosts of performances in ascending order of attendance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_host WHERE { ?T1 a :performance . ?T1 :host ?T1_host . ?T1 :attendance ?T1_attendance . } ORDER BY ASC (?T1_attendance)",SELECT ?T1_host WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T1 <http://valuenet/ontop/host> ?T1_host . ?T1 <http://valuenet/ontop/attendance> ?T1_attendance . } ORDER BY ASC (?T1_attendance)
Show the attendances of the performances at location 'TD Garden' or 'Bell Centre',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_attendance WHERE { ?T1 a :performance . ?T1 :attendance ?T1_attendance . ?T1 :location ?T1_location . ?T1 :location ?T1_location . FILTER(?T1_location = 'TD Garden' || ?T1_location = 'Bell Centre') . }",SELECT ?T1_attendance WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T1 <http://valuenet/ontop/attendance> ?T1_attendance . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/location> ?T1_location . FILTER(?T1_location = 'TD Garden' || ?T1_location = 'Bell Centre') . }
Show different locations and the number of performances at each location.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T1 :location ?T1_location . } GROUP BY ?T1_location",SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location
Show the most common location of performances.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :performance . ?T1 :location ?T1_location . } GROUP BY ?T1_location ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location ORDER BY DESC (?aggregation_all) LIMIT 1
Show the locations that have at least two performances.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :performance . ?T1 :location ?T1_location . } GROUP BY ?T1_location HAVING(count( *) >= 2)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location HAVING(count( *) >= 2)
Show the locations that have both performances with more than 2000 attendees and performances with less than 1000 attendees.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_location WHERE { ?T1 a :performance . ?T1 :location ?T1_location . ?T1 :attendance ?T1_attendance . FILTER(?T1_attendance > 2000) . FILTER (?T1_location in (?T2_location)) . ?T2 a :performance . ?T2 :location ?T2_location . ?T2 :attendance ?T2_attendance . FILTER(?T2_attendance < 1000) . }",SELECT DISTINCT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/attendance> ?T1_attendance . FILTER(?T1_attendance > 2000) . FILTER (?T1_location in (?T2_location)) . ?T2 a <http://valuenet/ontop/performance> . ?T2 <http://valuenet/ontop/location> ?T2_location . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . FILTER(?T2_attendance < 1000) . }
Show the names of members and the location of the performances they attended.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_location WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :ref-member ?T1 . ?T1 :name ?T1_name . ?T2 :location ?T2_location . ?T2 a :performance . ?T13 :ref-performance ?T2 . ?T1 :name ?T1_name . ?T2 :location ?T2_location . }",SELECT ?T1_name ?T2_location WHERE { ?T1 a <http://valuenet/ontop/member> . ?T13 a <http://valuenet/ontop/member_attendance> . ?T13 <http://valuenet/ontop/ref-member> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/location> ?T2_location . ?T2 a <http://valuenet/ontop/performance> . ?T13 <http://valuenet/ontop/ref-performance> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/location> ?T2_location . }
Show the dates of performances with attending members whose roles are 'Violin'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date WHERE { ?T1 a :performance . ?T13 a :member_attendance . ?T13 :ref-performance ?T1 . ?T1 :date ?T1_date . ?T2 :role ?T2_role . ?T2 a :member . ?T13 :ref-member ?T2 . ?T1 :date ?T1_date . ?T2 :role ?T2_role . FILTER(?T2_role = 'Violin') . }",SELECT ?T1_date WHERE { ?T1 a <http://valuenet/ontop/performance> . ?T13 a <http://valuenet/ontop/member_attendance> . ?T13 <http://valuenet/ontop/ref-performance> ?T1 . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T2 <http://valuenet/ontop/role> ?T2_role . ?T2 a <http://valuenet/ontop/member> . ?T13 <http://valuenet/ontop/ref-member> ?T2 . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T2 <http://valuenet/ontop/role> ?T2_role . FILTER(?T2_role = 'Violin') . }
Show the names of members and the dates of performances they attended in descending order of attendance of the performances.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_date WHERE { ?T1 a :member . ?T13 a :member_attendance . ?T13 :ref-member ?T1 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . ?T2 :attendance ?T2_attendance . ?T2 a :performance . ?T13 :ref-performance ?T2 . ?T1 :name ?T1_name . ?T2 :date ?T2_date . ?T2 :attendance ?T2_attendance . } ORDER BY DESC (?T2_attendance)",SELECT ?T1_name ?T2_date WHERE { ?T1 a <http://valuenet/ontop/member> . ?T13 a <http://valuenet/ontop/member_attendance> . ?T13 <http://valuenet/ontop/ref-member> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . ?T2 a <http://valuenet/ontop/performance> . ?T13 <http://valuenet/ontop/ref-performance> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . } ORDER BY DESC (?T2_attendance)
List the names of members who did not attend any performance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :member_id ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) . {SELECT ?T22_member_id WHERE { ?T22 a :member_attendance . ?T22 :member_id ?T22_member_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/member_id> ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) . {SELECT ?T22_member_id WHERE { ?T22 a <http://valuenet/ontop/member_attendance> . ?T22 <http://valuenet/ontop/member_id> ?T22_member_id . } } }
