nl_question,sparql_partial_uri,sparql_complete_uri
List the date of perpetrators in descending order of the number of people killed.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date WHERE { ?T1 a :perpetrator . ?T1 :date ?T1_date . ?T1 :killed ?T1_killed . } ORDER BY DESC (?T1_killed)",SELECT ?T1_date WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/killed> ?T1_killed . } ORDER BY DESC (?T1_killed)
List the number of people injured by perpetrators in ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_injured WHERE { ?T1 a :perpetrator . ?T1 :injured ?T1_injured . ?T1 :injured ?T1_injured . } ORDER BY ASC (?T1_injured)",SELECT ?T1_injured WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T1 <http://valuenet/ontop/injured> ?T1_injured . ?T1 <http://valuenet/ontop/injured> ?T1_injured . } ORDER BY ASC (?T1_injured)
What is the location of the perpetrator with the largest kills.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :perpetrator . ?T1 :location ?T1_location . ?T1 :killed ?T1_killed . } ORDER BY DESC (?T1_killed) LIMIT 1",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/killed> ?T1_killed . } ORDER BY DESC (?T1_killed) LIMIT 1
What is the total kills of the perpetrators with height more than 1.84.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_killed) as ?aggregation_T1_killed_124 ) WHERE { ?T1 a :perpetrator . ?T2 a :people . ?T1 :ref-people ?T2 . ?T1 :killed ?T1_killed . ?T2 :height ?T2_height . FILTER(?T2_height > 1.84) . }",SELECT (sum( ?T1_killed) as ?aggregation_T1_killed_124 ) WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T2 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/ref-people> ?T2 . ?T1 <http://valuenet/ontop/killed> ?T1_killed . ?T2 <http://valuenet/ontop/height> ?T2_height . FILTER(?T2_height > 1.84) . }
What are the countries of perpetrators? Show each country and the corresponding number of perpetrators there.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :perpetrator . ?T1 :country ?T1_country . } GROUP BY ?T1_country",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country
List the names of perpetrators in descending order of the year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :perpetrator . ?T2 :ref-people ?T1 . ?T1 :name ?T1_name . ?T2 :year ?T2_year . } ORDER BY DESC (?T2_year)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/perpetrator> . ?T2 <http://valuenet/ontop/ref-people> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/year> ?T2_year . } ORDER BY DESC (?T2_year)
List the names of people that are not perpetrators.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :people_id ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) . {SELECT ?T22_people_id WHERE { ?T22 a :perpetrator . ?T22 :people_id ?T22_people_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/people_id> ?T1_people_id . FILTER(?T1_people_id not in (?T22_people_id)) . {SELECT ?T22_people_id WHERE { ?T22 a <http://valuenet/ontop/perpetrator> . ?T22 <http://valuenet/ontop/people_id> ?T22_people_id . } } }
Show the countries that have both perpetrators with injures more than 50 and perpetrators with injures smaller than 20.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :perpetrator . ?T1 :country ?T1_country . ?T1 :injured ?T1_injured . FILTER(?T1_injured > 50) . FILTER (?T1_country in (?T2_country)) . ?T2 a :perpetrator . ?T2 :country ?T2_country . ?T2 :injured ?T2_injured . FILTER(?T2_injured < 20) . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/injured> ?T1_injured . FILTER(?T1_injured > 50) . FILTER (?T1_country in (?T2_country)) . ?T2 a <http://valuenet/ontop/perpetrator> . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T2 <http://valuenet/ontop/injured> ?T2_injured . FILTER(?T2_injured < 20) . }
Show the date of the tallest perpetrator.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date WHERE { ?T1 a :perpetrator . ?T2 a :people . ?T1 :ref-people ?T2 . ?T1 :date ?T1_date . ?T2 :height ?T2_height . } ORDER BY DESC (?T2_height) LIMIT 1",SELECT ?T1_date WHERE { ?T1 a <http://valuenet/ontop/perpetrator> . ?T2 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/ref-people> ?T2 . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T2 <http://valuenet/ontop/height> ?T2_height . } ORDER BY DESC (?T2_height) LIMIT 1
