nl_question,sparql_partial_uri,sparql_complete_uri
the names of models that launched between 2002 and 2004.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_model_name WHERE { ?T1 a :chip_model . ?T1 :model_name ?T1_model_name . ?T1 :launch_year ?T1_launch_year . FILTER(?T1_launch_year >= 2002 && ?T1_launch_year <= 2004) . }",SELECT ?T1_model_name WHERE { ?T1 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/model_name> ?T1_model_name . ?T1 <http://valuenet/ontop/launch_year> ?T1_launch_year . FILTER(?T1_launch_year >= 2002 && ?T1_launch_year <= 2004) . }
Which model has the least amount of RAM? List the model name and the amount of RAM.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_model_name ?T1_ram_mib WHERE { ?T1 a :chip_model . ?T1 :model_name ?T1_model_name . ?T1 :ram_mib ?T1_ram_mib . ?T1 :ram_mib ?T1_ram_mib . } ORDER BY ASC (?T1_ram_mib) LIMIT 1",SELECT ?T1_model_name ?T1_ram_mib WHERE { ?T1 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/model_name> ?T1_model_name . ?T1 <http://valuenet/ontop/ram_mib> ?T1_ram_mib . ?T1 <http://valuenet/ontop/ram_mib> ?T1_ram_mib . } ORDER BY ASC (?T1_ram_mib) LIMIT 1
List the hardware model name and company name for all the phones that were launched in year 2002 or have RAM size greater than 32.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :chip_model . ?T1 :ref-chip_model ?T2 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T1 :company_name ?T1_company_name . ?T2 :launch_year ?T2_launch_year . ?T2 :ram_mib ?T2_ram_mib . FILTER(?T2_launch_year = 2002 || ?T2_ram_mib > 32) . }",SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/ref-chip_model> ?T2 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T2 <http://valuenet/ontop/launch_year> ?T2_launch_year . ?T2 <http://valuenet/ontop/ram_mib> ?T2_ram_mib . FILTER(?T2_launch_year = 2002 || ?T2_ram_mib > 32) . }
Find all phones that have word 'Full' in their accreditation types. List the Hardware Model name and Company name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T1 :company_name ?T1_company_name . ?T1 :accreditation_type ?T1_accreditation_type . FILTER(contains (?T1_accreditation_type, 'Full')) . }","SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T1 <http://valuenet/ontop/accreditation_type> ?T1_accreditation_type . FILTER(contains (?T1_accreditation_type, 'Full')) . }"
"Find the Char cells, Pixels and Hardware colours for the screen of the phone whose hardware model name is 'LG-P760'.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_char_cells ?T1_pixels ?T1_hardware_colours WHERE { ?T1 a :screen_mode . ?T2 a :phone . ?T2 :ref-screen_mode ?T1 . ?T1 :char_cells ?T1_char_cells . ?T1 :pixels ?T1_pixels . ?T1 :hardware_colours ?T1_hardware_colours . ?T2 :hardware_model_name ?T2_hardware_model_name . FILTER(?T2_hardware_model_name = 'LG-P760') . }",SELECT ?T1_char_cells ?T1_pixels ?T1_hardware_colours WHERE { ?T1 a <http://valuenet/ontop/screen_mode> . ?T2 a <http://valuenet/ontop/phone> . ?T2 <http://valuenet/ontop/ref-screen_mode> ?T1 . ?T1 <http://valuenet/ontop/char_cells> ?T1_char_cells . ?T1 <http://valuenet/ontop/pixels> ?T1_pixels . ?T1 <http://valuenet/ontop/hardware_colours> ?T1_hardware_colours . ?T2 <http://valuenet/ontop/hardware_model_name> ?T2_hardware_model_name . FILTER(?T2_hardware_model_name = 'LG-P760') . }
List the hardware model name and company name for the phone whose screen mode type is 'Graphics.',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :ref-screen_mode ?T2 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T1 :company_name ?T1_company_name . ?T2 :type ?T2_type . FILTER(?T2_type = 'Graphics') . }",SELECT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/screen_mode> . ?T1 <http://valuenet/ontop/ref-screen_mode> ?T2 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T2 <http://valuenet/ontop/type> ?T2_type . FILTER(?T2_type = 'Graphics') . }
List the name of the company that produced more than one phone model.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_company_name WHERE { ?T1 a :phone . ?T1 :company_name ?T1_company_name . } GROUP BY ?T1_company_name HAVING(count( *) > 1)",SELECT ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . } GROUP BY ?T1_company_name HAVING(count( *) > 1)
"List the maximum, minimum and average number of used kb in screen mode.","PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_used_kb) as ?aggregation_T1_used_kb_163 ) (min( ?T1_used_kb) as ?aggregation_T1_used_kb_74 ) (avg( ?T1_used_kb) as ?aggregation_T1_used_kb_41 ) WHERE { ?T1 a :screen_mode . ?T1 :used_kb ?T1_used_kb . ?T1 :used_kb ?T1_used_kb . ?T1 :used_kb ?T1_used_kb . }",SELECT (max( ?T1_used_kb) as ?aggregation_T1_used_kb_163 ) (min( ?T1_used_kb) as ?aggregation_T1_used_kb_74 ) (avg( ?T1_used_kb) as ?aggregation_T1_used_kb_41 ) WHERE { ?T1 a <http://valuenet/ontop/screen_mode> . ?T1 <http://valuenet/ontop/used_kb> ?T1_used_kb . ?T1 <http://valuenet/ontop/used_kb> ?T1_used_kb . ?T1 <http://valuenet/ontop/used_kb> ?T1_used_kb . }
List the name of the phone model launched in year 2002 and with the highest RAM size.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :chip_model . ?T1 :ref-chip_model ?T2 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T2 :ram_mib ?T2_ram_mib . ?T2 :launch_year ?T2_launch_year . FILTER(?T2_launch_year = 2002) . } ORDER BY DESC (?T2_ram_mib) LIMIT 1",SELECT ?T1_hardware_model_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/ref-chip_model> ?T2 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T2 <http://valuenet/ontop/ram_mib> ?T2_ram_mib . ?T2 <http://valuenet/ontop/launch_year> ?T2_launch_year . FILTER(?T2_launch_year = 2002) . } ORDER BY DESC (?T2_ram_mib) LIMIT 1
List the hardware model name for the phones that have screen mode type 'Text' or RAM size greater than 32.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :ref-screen_mode ?T2 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T2 :type ?T2_type . ?T3 :ram_mib ?T3_ram_mib . ?T3 a :chip_model . ?T1 :ref-chip_model ?T3 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T2 :type ?T2_type . ?T3 :ram_mib ?T3_ram_mib . FILTER(?T2_type = 'Text' || ?T3_ram_mib > 32) . }",SELECT ?T1_hardware_model_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/screen_mode> . ?T1 <http://valuenet/ontop/ref-screen_mode> ?T2 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T3 <http://valuenet/ontop/ram_mib> ?T3_ram_mib . ?T3 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/ref-chip_model> ?T3 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T3 <http://valuenet/ontop/ram_mib> ?T3_ram_mib . FILTER(?T2_type = 'Text' || ?T3_ram_mib > 32) . }
List the hardware model name for the phones that were produced by 'Nokia Corporation' or whose screen mode type is 'Graphics.',"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_hardware_model_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :ref-screen_mode ?T2 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T2 :type ?T2_type . ?T1 :company_name ?T1_company_name . FILTER(?T2_type = 'Graphics' || ?T1_company_name = 'Nokia Corporation') . }",SELECT DISTINCT ?T1_hardware_model_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/screen_mode> . ?T1 <http://valuenet/ontop/ref-screen_mode> ?T2 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . FILTER(?T2_type = 'Graphics' || ?T1_company_name = 'Nokia Corporation') . }
List the phone hardware model and company name for the phones whose screen usage in kb is between 10 and 15.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a :phone . ?T2 a :screen_mode . ?T1 :ref-screen_mode ?T2 . ?T1 :hardware_model_name ?T1_hardware_model_name . ?T1 :company_name ?T1_company_name . ?T2 :used_kb ?T2_used_kb . FILTER(?T2_used_kb >= 10 && ?T2_used_kb <= 15) . }",SELECT DISTINCT ?T1_hardware_model_name ?T1_company_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/screen_mode> . ?T1 <http://valuenet/ontop/ref-screen_mode> ?T2 . ?T1 <http://valuenet/ontop/hardware_model_name> ?T1_hardware_model_name . ?T1 <http://valuenet/ontop/company_name> ?T1_company_name . ?T2 <http://valuenet/ontop/used_kb> ?T2_used_kb . FILTER(?T2_used_kb >= 10 && ?T2_used_kb <= 15) . }
Find the number of phones for each accreditation type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_accreditation_type (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :accreditation_type ?T1_accreditation_type . } GROUP BY ?T1_accreditation_type",SELECT ?T1_accreditation_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/accreditation_type> ?T1_accreditation_type . } GROUP BY ?T1_accreditation_type
Find the accreditation level that more than 3 phones use.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_accreditation_level WHERE { ?T1 a :phone . ?T1 :accreditation_level ?T1_accreditation_level . } GROUP BY ?T1_accreditation_level HAVING(count( *) > 3)",SELECT ?T1_accreditation_level WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/accreditation_level> ?T1_accreditation_level . } GROUP BY ?T1_accreditation_level HAVING(count( *) > 3)
Find the details for all chip models.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :chip_model . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/chip_model> . }
Count the number of chip model that do not have wifi.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :chip_model . ?T1 :wifi ?T1_wifi . FILTER(?T1_wifi = 'No') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/wifi> ?T1_wifi . FILTER(?T1_wifi = 'No') . }
List all the model names sorted by their launch year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_model_name WHERE { ?T1 a :chip_model . ?T1 :model_name ?T1_model_name . ?T1 :launch_year ?T1_launch_year . } ORDER BY ASC (?T1_launch_year)",SELECT ?T1_model_name WHERE { ?T1 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/model_name> ?T1_model_name . ?T1 <http://valuenet/ontop/launch_year> ?T1_launch_year . } ORDER BY ASC (?T1_launch_year)
Find the average ram mib size of the chip models that are never used by any phone.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_ram_mib) as ?aggregation_T1_ram_mib_200 ) WHERE { ?T1 a :chip_model . ?T1 :ram_mib ?T1_ram_mib . ?T1 :model_name ?T1_model_name . FILTER(?T1_model_name not in (?T22_chip_model)) . {SELECT ?T22_chip_model WHERE { ?T22 a :phone . ?T22 :chip_model ?T22_chip_model . } } }",SELECT (avg( ?T1_ram_mib) as ?aggregation_T1_ram_mib_200 ) WHERE { ?T1 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/ram_mib> ?T1_ram_mib . ?T1 <http://valuenet/ontop/model_name> ?T1_model_name . FILTER(?T1_model_name not in (?T22_chip_model)) . {SELECT ?T22_chip_model WHERE { ?T22 a <http://valuenet/ontop/phone> . ?T22 <http://valuenet/ontop/chip_model> ?T22_chip_model . } } }
Find the names of the chip models that are not used by any phone with full accreditation type.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_model_name as ?col1) WHERE { ?T1 a :chip_model . ?T1 :model_name ?T1_model_name . }} MINUS {SELECT (?T2_chip_model as ?col1) WHERE { ?T2 a :phone . ?T2 :chip_model ?T2_chip_model . ?T2 :accreditation_type ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Full') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_model_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/chip_model> . ?T1 <http://valuenet/ontop/model_name> ?T1_model_name . }} MINUS {SELECT (?T2_chip_model as ?col1) WHERE { ?T2 a <http://valuenet/ontop/phone> . ?T2 <http://valuenet/ontop/chip_model> ?T2_chip_model . ?T2 <http://valuenet/ontop/accreditation_type> ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Full') . } } }
Find the pixels of the screen modes that are used by both phones with full accreditation types and phones with Provisional accreditation types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_pixels WHERE { ?T1 a :screen_mode . ?T2 a :phone . ?T2 :ref-screen_mode ?T1 . ?T1 :pixels ?T1_pixels . ?T2 :accreditation_type ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Provisional') . FILTER (?T1_pixels in (?T3_pixels)) . ?T3 a :screen_mode . ?T4 a :phone . ?T4 :ref-screen_mode ?T3 . ?T3 :pixels ?T3_pixels . ?T4 :accreditation_type ?T4_accreditation_type . FILTER(?T4_accreditation_type = 'Full') . }",SELECT DISTINCT ?T1_pixels WHERE { ?T1 a <http://valuenet/ontop/screen_mode> . ?T2 a <http://valuenet/ontop/phone> . ?T2 <http://valuenet/ontop/ref-screen_mode> ?T1 . ?T1 <http://valuenet/ontop/pixels> ?T1_pixels . ?T2 <http://valuenet/ontop/accreditation_type> ?T2_accreditation_type . FILTER(?T2_accreditation_type = 'Provisional') . FILTER (?T1_pixels in (?T3_pixels)) . ?T3 a <http://valuenet/ontop/screen_mode> . ?T4 a <http://valuenet/ontop/phone> . ?T4 <http://valuenet/ontop/ref-screen_mode> ?T3 . ?T3 <http://valuenet/ontop/pixels> ?T3_pixels . ?T4 <http://valuenet/ontop/accreditation_type> ?T4_accreditation_type . FILTER(?T4_accreditation_type = 'Full') . }
