nl_question,sparql_partial_uri,sparql_complete_uri
List the names of phones in ascending order of price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :phone . ?T1 :name ?T1_name . ?T1 :price ?T1_price . } ORDER BY ASC (?T1_price)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/price> ?T1_price . } ORDER BY ASC (?T1_price)
List the distinct carriers of phones with memories bigger than 32.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_carrier WHERE { ?T1 a :phone . ?T1 :carrier ?T1_carrier . ?T1 :memory_in_g ?T1_memory_in_g . FILTER(?T1_memory_in_g > 32) . }",SELECT DISTINCT ?T1_carrier WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/carrier> ?T1_carrier . ?T1 <http://valuenet/ontop/memory_in_g> ?T1_memory_in_g . FILTER(?T1_memory_in_g > 32) . }
Show the names of phones with carrier either 'Sprint' or 'TMobile'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :phone . ?T1 :name ?T1_name . ?T1 :carrier ?T1_carrier . ?T1 :carrier ?T1_carrier . FILTER(?T1_carrier = 'Sprint' || ?T1_carrier = 'TMobile') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/carrier> ?T1_carrier . ?T1 <http://valuenet/ontop/carrier> ?T1_carrier . FILTER(?T1_carrier = 'Sprint' || ?T1_carrier = 'TMobile') . }
Show different carriers of phones together with the number of phones with each carrier.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_carrier (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :carrier ?T1_carrier . } GROUP BY ?T1_carrier",SELECT ?T1_carrier (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/carrier> ?T1_carrier . } GROUP BY ?T1_carrier
Show the most frequently used carrier of the phones.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_carrier (count( *) as ?aggregation_all) WHERE { ?T1 a :phone . ?T1 :carrier ?T1_carrier . } GROUP BY ?T1_carrier ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_carrier (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/carrier> ?T1_carrier . } GROUP BY ?T1_carrier ORDER BY DESC (?aggregation_all) LIMIT 1
Show the carriers that have both phones with memory smaller than 32 and phones with memory bigger than 64.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_carrier WHERE { ?T1 a :phone . ?T1 :carrier ?T1_carrier . ?T1 :memory_in_g ?T1_memory_in_g . FILTER(?T1_memory_in_g < 32) . FILTER (?T1_carrier in (?T2_carrier)) . ?T2 a :phone . ?T2 :carrier ?T2_carrier . ?T2 :memory_in_g ?T2_memory_in_g . FILTER(?T2_memory_in_g > 64) . }",SELECT DISTINCT ?T1_carrier WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/carrier> ?T1_carrier . ?T1 <http://valuenet/ontop/memory_in_g> ?T1_memory_in_g . FILTER(?T1_memory_in_g < 32) . FILTER (?T1_carrier in (?T2_carrier)) . ?T2 a <http://valuenet/ontop/phone> . ?T2 <http://valuenet/ontop/carrier> ?T2_carrier . ?T2 <http://valuenet/ontop/memory_in_g> ?T2_memory_in_g . FILTER(?T2_memory_in_g > 64) . }
Show the names of phones and the districts of markets they are on.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_district WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :ref-phone ?T1 . ?T1 :name ?T1_name . ?T2 :district ?T2_district . ?T2 a :market . ?T13 :ref-market ?T2 . ?T1 :name ?T1_name . ?T2 :district ?T2_district . }",SELECT ?T1_name ?T2_district WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T13 a <http://valuenet/ontop/phone_market> . ?T13 <http://valuenet/ontop/ref-phone> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/district> ?T2_district . ?T2 a <http://valuenet/ontop/market> . ?T13 <http://valuenet/ontop/ref-market> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/district> ?T2_district . }
Show the names of phones that are on market with number of shops greater than 50.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :phone . ?T13 a :phone_market . ?T13 :ref-phone ?T1 . ?T1 :name ?T1_name . ?T2 :num_of_shops ?T2_num_of_shops . ?T2 a :market . ?T13 :ref-market ?T2 . ?T1 :name ?T1_name . ?T2 :num_of_shops ?T2_num_of_shops . FILTER(?T2_num_of_shops > 50) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T13 a <http://valuenet/ontop/phone_market> . ?T13 <http://valuenet/ontop/ref-phone> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_shops> ?T2_num_of_shops . ?T2 a <http://valuenet/ontop/market> . ?T13 <http://valuenet/ontop/ref-market> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_shops> ?T2_num_of_shops . FILTER(?T2_num_of_shops > 50) . }
"For each phone, show its names and total number of stocks.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (sum( ?T2_num_of_stock) as ?aggregation_T2_num_of_stock_99 ) WHERE { ?T1 a :phone . ?T2 a :phone_market . ?T2 :ref-phone ?T1 . ?T1 :name ?T1_name . ?T2 :num_of_stock ?T2_num_of_stock . } GROUP BY ?T1_name",SELECT ?T1_name (sum( ?T2_num_of_stock) as ?aggregation_T2_num_of_stock_99 ) WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T2 a <http://valuenet/ontop/phone_market> . ?T2 <http://valuenet/ontop/ref-phone> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/num_of_stock> ?T2_num_of_stock . } GROUP BY ?T1_name
List the names of phones that are not on any market.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :phone . ?T1 :name ?T1_name . ?T1 :phone_id ?T1_phone_id . FILTER(?T1_phone_id not in (?T22_phone_id)) . {SELECT ?T22_phone_id WHERE { ?T22 a :phone_market . ?T22 :phone_id ?T22_phone_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/phone> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/phone_id> ?T1_phone_id . FILTER(?T1_phone_id not in (?T22_phone_id)) . {SELECT ?T22_phone_id WHERE { ?T22 a <http://valuenet/ontop/phone_market> . ?T22 <http://valuenet/ontop/phone_id> ?T22_phone_id . } } }
