nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of products.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . }
Count the number of colors.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ref_colors> . }
Count the number of characteristics.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :characteristics . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/characteristics> . }
Return the names and typical buying prices for all products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name ?T1_typical_buying_price WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :typical_buying_price ?T1_typical_buying_price . }",SELECT ?T1_product_name ?T1_typical_buying_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/typical_buying_price> ?T1_typical_buying_price . }
List the description of all the colors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T1 :color_description ?T1_color_description . }",SELECT ?T1_color_description WHERE { ?T1 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/color_description> ?T1_color_description . }
Find the names of all the product characteristics.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T1 :characteristic_name ?T1_characteristic_name . }",SELECT DISTINCT ?T1_characteristic_name WHERE { ?T1 a <http://valuenet/ontop/characteristics> . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . }
Return the names of products in the category 'Spices'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') . }",SELECT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') . }
"List the names, color descriptions and product descriptions of products with category 'Herbs'.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name ?T2_color_description ?T1_product_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :ref-color_code ?T2 . ?T1 :product_name ?T1_product_name . ?T2 :color_description ?T2_color_description . ?T1 :product_description ?T1_product_description . ?T1 :product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') . }",SELECT ?T1_product_name ?T2_color_description ?T1_product_description WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/ref-color_code> ?T2 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . ?T1 <http://valuenet/ontop/product_description> ?T1_product_description . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') . }
Count the number of products in the category 'Seeds'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Seeds') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . FILTER(?T1_product_category_code = 'Seeds') . }
Find the number of products with category 'Spices' and typically sold above 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :product_category_code ?T1_product_category_code . ?T1 :typical_buying_price ?T1_typical_buying_price . FILTER(?T1_product_category_code = 'Spices' && ?T1_typical_buying_price > 1000) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . ?T1 <http://valuenet/ontop/typical_buying_price> ?T1_typical_buying_price . FILTER(?T1_product_category_code = 'Spices' && ?T1_typical_buying_price > 1000) . }
Return the category code and typical price of 'cumin'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_category_code ?T1_typical_buying_price WHERE { ?T1 a :products . ?T1 :product_category_code ?T1_product_category_code . ?T1 :typical_buying_price ?T1_typical_buying_price . ?T1 :product_name ?T1_product_name . FILTER(?T1_product_name = 'cumin') . }",SELECT ?T1_product_category_code ?T1_typical_buying_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . ?T1 <http://valuenet/ontop/typical_buying_price> ?T1_typical_buying_price . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . FILTER(?T1_product_name = 'cumin') . }
Give the name of the products that have a color description 'yellow'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :ref-color_code ?T2 . ?T1 :product_name ?T1_product_name . ?T2 :color_description ?T2_color_description . FILTER(?T2_color_description = 'yellow') . }",SELECT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/ref-color_code> ?T2 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . FILTER(?T2_color_description = 'yellow') . }
Find the category descriptions of the products whose descriptions include letter 't'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_category_description WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :ref-product_category_code ?T1 . ?T1 :product_category_description ?T1_product_category_description . ?T2 :product_description ?T2_product_description . FILTER(contains (?T2_product_description, 't')) . }","SELECT ?T1_product_category_description WHERE { ?T1 a <http://valuenet/ontop/ref_product_categories> . ?T2 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/ref-product_category_code> ?T1 . ?T1 <http://valuenet/ontop/product_category_description> ?T1_product_category_description . ?T2 <http://valuenet/ontop/product_description> ?T2_product_description . FILTER(contains (?T2_product_description, 't')) . }"
Give the color description for the product 'catnip'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_color_description WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :ref-color_code ?T1 . ?T1 :color_description ?T1_color_description . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'catnip') . }",SELECT ?T1_color_description WHERE { ?T1 a <http://valuenet/ontop/ref_colors> . ?T2 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/ref-color_code> ?T1 . ?T1 <http://valuenet/ontop/color_description> ?T1_color_description . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'catnip') . }
Return the color code and description for the product with the name 'chervil'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_color_code ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :ref-color_code ?T2 . ?T1 :color_code ?T1_color_code . ?T2 :color_description ?T2_color_description . ?T1 :product_name ?T1_product_name . FILTER(?T1_product_name = 'chervil') . }",SELECT ?T1_color_code ?T2_color_description WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/ref-color_code> ?T2 . ?T1 <http://valuenet/ontop/color_code> ?T1_color_code . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . FILTER(?T1_product_name = 'chervil') . }
Find the id and color description of the products with at least 2 characteristics.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_id ?T2_color_description WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :ref-color_code ?T2 . ?T1 :product_id ?T1_product_id . ?T2 :color_description ?T2_color_description . ?T3 a :product_characteristics . ?T3 :ref-product ?T1 . ?T1 :product_id ?T1_product_id . ?T2 :color_description ?T2_color_description . } GROUP BY ?T1_product_id ?T2_color_description HAVING(count( *) >= 2)",SELECT ?T1_product_id ?T2_color_description WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/ref-color_code> ?T2 . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . ?T3 a <http://valuenet/ontop/product_characteristics> . ?T3 <http://valuenet/ontop/ref-product> ?T1 . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . } GROUP BY ?T1_product_id ?T2_color_description HAVING(count( *) >= 2)
Return the names and typical buying and selling prices for products that have 'yellow' as their color description.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name ?T1_typical_buying_price ?T1_typical_selling_price WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :ref-color_code ?T2 . ?T1 :product_name ?T1_product_name . ?T1 :typical_buying_price ?T1_typical_buying_price . ?T1 :typical_selling_price ?T1_typical_selling_price . ?T2 :color_description ?T2_color_description . FILTER(?T2_color_description = 'yellow') . }",SELECT ?T1_product_name ?T1_typical_buying_price ?T1_typical_selling_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/ref-color_code> ?T2 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/typical_buying_price> ?T1_typical_buying_price . ?T1 <http://valuenet/ontop/typical_selling_price> ?T1_typical_selling_price . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . FILTER(?T2_color_description = 'yellow') . }
Count the number of characteristics the product 'sesame' has.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :product_characteristics . ?T2 a :products . ?T1 :ref-product ?T2 . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/product_characteristics> . ?T2 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/ref-product> ?T2 . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'sesame') . }
Count the number of different characteristic names the product 'cumin' has.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_61 ) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :ref-characteristic ?T1 . ?T1 :characteristic_name ?T1_characteristic_name . ?T2 :product_name ?T2_product_name . ?T2 a :products . ?T13 :ref-product ?T2 . ?T1 :characteristic_name ?T1_characteristic_name . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') . }",SELECT DISTINCT (count(DISTINCT ?T1_characteristic_name) as ?aggregation_T1_characteristic_name_61 ) WHERE { ?T1 a <http://valuenet/ontop/characteristics> . ?T13 a <http://valuenet/ontop/product_characteristics> . ?T13 <http://valuenet/ontop/ref-characteristic> ?T1 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T2 a <http://valuenet/ontop/products> . ?T13 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'sesame') . }
Return the characteristic names of the 'sesame' product.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_characteristic_name WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :ref-characteristic ?T1 . ?T1 :characteristic_name ?T1_characteristic_name . ?T2 :product_name ?T2_product_name . ?T2 a :products . ?T13 :ref-product ?T2 . ?T1 :characteristic_name ?T1_characteristic_name . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'sesame') . }",SELECT ?T1_characteristic_name WHERE { ?T1 a <http://valuenet/ontop/characteristics> . ?T13 a <http://valuenet/ontop/product_characteristics> . ?T13 <http://valuenet/ontop/ref-characteristic> ?T1 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T2 a <http://valuenet/ontop/products> . ?T13 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'sesame') . }
List all the characteristic names and data types of product 'cumin'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_characteristic_name ?T1_characteristic_data_type WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :ref-characteristic ?T1 . ?T1 :characteristic_name ?T1_characteristic_name . ?T1 :characteristic_data_type ?T1_characteristic_data_type . ?T2 :product_name ?T2_product_name . ?T2 a :products . ?T13 :ref-product ?T2 . ?T1 :characteristic_name ?T1_characteristic_name . ?T1 :characteristic_data_type ?T1_characteristic_data_type . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') . }",SELECT ?T1_characteristic_name ?T1_characteristic_data_type WHERE { ?T1 a <http://valuenet/ontop/characteristics> . ?T13 a <http://valuenet/ontop/product_characteristics> . ?T13 <http://valuenet/ontop/ref-characteristic> ?T1 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . ?T1 <http://valuenet/ontop/characteristic_data_type> ?T1_characteristic_data_type . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T2 a <http://valuenet/ontop/products> . ?T13 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . ?T1 <http://valuenet/ontop/characteristic_data_type> ?T1_characteristic_data_type . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'cumin') . }
Count the number of characteristics of the product named 'laurel'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . FILTER(?T1_product_name = 'laurel') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . FILTER(?T1_product_name = 'laurel') . }
Find the number of characteristics that the product 'flax' has.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . FILTER(?T1_product_name = 'flax') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . FILTER(?T1_product_name = 'flax') . }
Count the number of products with the 'hot' charactersitic.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a :product_characteristics . ?T2 a :characteristics . ?T13 :ref-characteristic ?T2 . ?T2 :characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'hot') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T13 a <http://valuenet/ontop/product_characteristics> . ?T2 a <http://valuenet/ontop/characteristics> . ?T13 <http://valuenet/ontop/ref-characteristic> ?T2 . ?T2 <http://valuenet/ontop/characteristic_name> ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'hot') . }
List the all the distinct names of the products with the characteristic name 'warm'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T13 a :product_characteristics . ?T13 :ref-product ?T1 . ?T1 :product_name ?T1_product_name . ?T2 :characteristic_name ?T2_characteristic_name . ?T2 a :characteristics . ?T13 :ref-characteristic ?T2 . ?T1 :product_name ?T1_product_name . ?T2 :characteristic_name ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'warm') . }",SELECT DISTINCT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T13 a <http://valuenet/ontop/product_characteristics> . ?T13 <http://valuenet/ontop/ref-product> ?T1 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T2 <http://valuenet/ontop/characteristic_name> ?T2_characteristic_name . ?T2 a <http://valuenet/ontop/characteristics> . ?T13 <http://valuenet/ontop/ref-characteristic> ?T2 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T2 <http://valuenet/ontop/characteristic_name> ?T2_characteristic_name . FILTER(?T2_characteristic_name = 'warm') . }
Find the number of the products that have their color described as 'red' and have a characteristic named 'slow'.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :ref_colors . ?T1 :ref-color_code ?T2 . ?T2 :color_description ?T2_color_description . ?T3 :characteristic_name ?T3_characteristic_name . ?T14 a :product_characteristics . ?T14 :ref-product ?T1 . ?T2 :color_description ?T2_color_description . ?T3 :characteristic_name ?T3_characteristic_name . ?T3 a :characteristics . ?T14 :ref-characteristic ?T3 . ?T2 :color_description ?T2_color_description . ?T3 :characteristic_name ?T3_characteristic_name . FILTER(?T2_color_description = 'red' && ?T3_characteristic_name = 'slow') . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/ref-color_code> ?T2 . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . ?T3 <http://valuenet/ontop/characteristic_name> ?T3_characteristic_name . ?T14 a <http://valuenet/ontop/product_characteristics> . ?T14 <http://valuenet/ontop/ref-product> ?T1 . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . ?T3 <http://valuenet/ontop/characteristic_name> ?T3_characteristic_name . ?T3 a <http://valuenet/ontop/characteristics> . ?T14 <http://valuenet/ontop/ref-characteristic> ?T3 . ?T2 <http://valuenet/ontop/color_description> ?T2_color_description . ?T3 <http://valuenet/ontop/characteristic_name> ?T3_characteristic_name . FILTER(?T2_color_description = 'red' && ?T3_characteristic_name = 'slow') . }
Return the unit of measure for 'Herb' products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T1 :unit_of_measure ?T1_unit_of_measure . ?T1 :product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') . }",SELECT ?T1_unit_of_measure WHERE { ?T1 a <http://valuenet/ontop/ref_product_categories> . ?T1 <http://valuenet/ontop/unit_of_measure> ?T1_unit_of_measure . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') . }
Find the product category description of the product category with code 'Spices'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_category_description WHERE { ?T1 a :ref_product_categories . ?T1 :product_category_description ?T1_product_category_description . ?T1 :product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') . }",SELECT ?T1_product_category_description WHERE { ?T1 a <http://valuenet/ontop/ref_product_categories> . ?T1 <http://valuenet/ontop/product_category_description> ?T1_product_category_description . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . FILTER(?T1_product_category_code = 'Spices') . }
Return the description and unit of measurement for products in the 'Herbs' category.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_category_description ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T1 :product_category_description ?T1_product_category_description . ?T1 :unit_of_measure ?T1_unit_of_measure . ?T1 :product_category_code ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') . }",SELECT ?T1_product_category_description ?T1_unit_of_measure WHERE { ?T1 a <http://valuenet/ontop/ref_product_categories> . ?T1 <http://valuenet/ontop/product_category_description> ?T1_product_category_description . ?T1 <http://valuenet/ontop/unit_of_measure> ?T1_unit_of_measure . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . FILTER(?T1_product_category_code = 'Herbs') . }
Give the unit of measure for the product with the name 'cumin'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_unit_of_measure WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :ref-product_category_code ?T1 . ?T1 :unit_of_measure ?T1_unit_of_measure . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'cumin') . }",SELECT ?T1_unit_of_measure WHERE { ?T1 a <http://valuenet/ontop/ref_product_categories> . ?T2 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/ref-product_category_code> ?T1 . ?T1 <http://valuenet/ontop/unit_of_measure> ?T1_unit_of_measure . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'cumin') . }
Find the unit of measurement and product category code of product named 'chervil'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_unit_of_measure ?T1_product_category_code WHERE { ?T1 a :ref_product_categories . ?T2 a :products . ?T2 :ref-product_category_code ?T1 . ?T1 :unit_of_measure ?T1_unit_of_measure . ?T1 :product_category_code ?T1_product_category_code . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'chervil') . }",SELECT ?T1_unit_of_measure ?T1_product_category_code WHERE { ?T1 a <http://valuenet/ontop/ref_product_categories> . ?T2 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/ref-product_category_code> ?T1 . ?T1 <http://valuenet/ontop/unit_of_measure> ?T1_unit_of_measure . ?T1 <http://valuenet/ontop/product_category_code> ?T1_product_category_code . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'chervil') . }
Return the color description that is most common across all products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_color_description (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . ?T2 a :products . ?T2 :ref-color_code ?T1 . ?T1 :color_description ?T1_color_description . } GROUP BY ?T1_color_description ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_color_description (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ref_colors> . ?T2 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/ref-color_code> ?T1 . ?T1 <http://valuenet/ontop/color_description> ?T1_color_description . } GROUP BY ?T1_color_description ORDER BY DESC (?aggregation_all) LIMIT 1
Return the name of the characteristic that is most common across all products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_characteristic_name (count( *) as ?aggregation_all) WHERE { ?T1 a :characteristics . ?T13 a :product_characteristics . ?T13 :ref-characteristic ?T1 . ?T1 :characteristic_name ?T1_characteristic_name . } GROUP BY ?T1_characteristic_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_characteristic_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/characteristics> . ?T13 a <http://valuenet/ontop/product_characteristics> . ?T13 <http://valuenet/ontop/ref-characteristic> ?T1 . ?T1 <http://valuenet/ontop/characteristic_name> ?T1_characteristic_name . } GROUP BY ?T1_characteristic_name ORDER BY DESC (?aggregation_all) LIMIT 1
Count the number of colors that are not used in any products.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_colors . ?T1 :color_code ?T1_color_code . FILTER(?T1_color_code not in (?T22_color_code)) . {SELECT ?T22_color_code WHERE { ?T22 a :products . ?T22 :color_code ?T22_color_code . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ref_colors> . ?T1 <http://valuenet/ontop/color_code> ?T1_color_code . FILTER(?T1_color_code not in (?T22_color_code)) . {SELECT ?T22_color_code WHERE { ?T22 a <http://valuenet/ontop/products> . ?T22 <http://valuenet/ontop/color_code> ?T22_color_code . } } }
