nl_question,sparql_partial_uri,sparql_complete_uri
Find the names of all the catalog entries.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . }",SELECT DISTINCT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . }
Find the list of attribute data types possessed by more than 3 attribute definitions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_attribute_data_type WHERE { ?T1 a :attribute_definitions . ?T1 :attribute_data_type ?T1_attribute_data_type . } GROUP BY ?T1_attribute_data_type HAVING(count( *) > 3)",SELECT ?T1_attribute_data_type WHERE { ?T1 a <http://valuenet/ontop/attribute_definitions> . ?T1 <http://valuenet/ontop/attribute_data_type> ?T1_attribute_data_type . } GROUP BY ?T1_attribute_data_type HAVING(count( *) > 3)
Find the attribute data type for the attribute named 'Green'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_attribute_data_type WHERE { ?T1 a :attribute_definitions . ?T1 :attribute_data_type ?T1_attribute_data_type . ?T1 :attribute_name ?T1_attribute_name . FILTER(?T1_attribute_name = 'Green') . }",SELECT ?T1_attribute_data_type WHERE { ?T1 a <http://valuenet/ontop/attribute_definitions> . ?T1 <http://valuenet/ontop/attribute_data_type> ?T1_attribute_data_type . ?T1 <http://valuenet/ontop/attribute_name> ?T1_attribute_name . FILTER(?T1_attribute_name = 'Green') . }
Find the name and level of catalog structure with level between 5 and 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_level_name ?T1_catalog_level_number WHERE { ?T1 a :catalog_structure . ?T1 :catalog_level_name ?T1_catalog_level_name . ?T1 :catalog_level_number ?T1_catalog_level_number . ?T1 :catalog_level_number ?T1_catalog_level_number . FILTER(?T1_catalog_level_number >= 5 && ?T1_catalog_level_number <= 10) . }",SELECT ?T1_catalog_level_name ?T1_catalog_level_number WHERE { ?T1 a <http://valuenet/ontop/catalog_structure> . ?T1 <http://valuenet/ontop/catalog_level_name> ?T1_catalog_level_name . ?T1 <http://valuenet/ontop/catalog_level_number> ?T1_catalog_level_number . ?T1 <http://valuenet/ontop/catalog_level_number> ?T1_catalog_level_number . FILTER(?T1_catalog_level_number >= 5 && ?T1_catalog_level_number <= 10) . }
Find all the catalog publishers whose name contains 'Murray',"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_catalog_publisher WHERE { ?T1 a :catalogs . ?T1 :catalog_publisher ?T1_catalog_publisher . ?T1 :catalog_publisher ?T1_catalog_publisher . FILTER(contains (?T1_catalog_publisher, 'Murray')) . }","SELECT DISTINCT ?T1_catalog_publisher WHERE { ?T1 a <http://valuenet/ontop/catalogs> . ?T1 <http://valuenet/ontop/catalog_publisher> ?T1_catalog_publisher . ?T1 <http://valuenet/ontop/catalog_publisher> ?T1_catalog_publisher . FILTER(contains (?T1_catalog_publisher, 'Murray')) . }"
Find the catalog publisher that has the most catalogs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a :catalogs . ?T1 :catalog_publisher ?T1_catalog_publisher . } GROUP BY ?T1_catalog_publisher ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_catalog_publisher (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/catalogs> . ?T1 <http://valuenet/ontop/catalog_publisher> ?T1_catalog_publisher . } GROUP BY ?T1_catalog_publisher ORDER BY DESC (?aggregation_all) LIMIT 1
Find the names and publication dates of all catalogs that have catalog level number greater than 5.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_name ?T1_date_of_publication WHERE { ?T1 a :catalogs . ?T2 a :catalog_structure . ?T2 :ref-catalog ?T1 . ?T1 :catalog_name ?T1_catalog_name . ?T1 :date_of_publication ?T1_date_of_publication . ?T2 :catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number > 5) . }",SELECT ?T1_catalog_name ?T1_date_of_publication WHERE { ?T1 a <http://valuenet/ontop/catalogs> . ?T2 a <http://valuenet/ontop/catalog_structure> . ?T2 <http://valuenet/ontop/ref-catalog> ?T1 . ?T1 <http://valuenet/ontop/catalog_name> ?T1_catalog_name . ?T1 <http://valuenet/ontop/date_of_publication> ?T1_date_of_publication . ?T2 <http://valuenet/ontop/catalog_level_number> ?T2_catalog_level_number . FILTER(?T2_catalog_level_number > 5) . }
What are the entry names of catalog with the attribute possessed by most entries.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :ref-catalog_entry ?T1 . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T2 :attribute_value ?T2_attribute_value . FILTER(?T2_attribute_value = (?T23_attribute_value)) . {SELECT ?T23_attribute_value (count( *) as ?aggregation_all) WHERE { ?T23 a :catalog_contents_additional_attributes . ?T23 :attribute_value ?T23_attribute_value . } GROUP BY ?T23_attribute_value ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T2 a <http://valuenet/ontop/catalog_contents_additional_attributes> . ?T2 <http://valuenet/ontop/ref-catalog_entry> ?T1 . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T2 <http://valuenet/ontop/attribute_value> ?T2_attribute_value . FILTER(?T2_attribute_value = (?T23_attribute_value)) . {SELECT ?T23_attribute_value (count( *) as ?aggregation_all) WHERE { ?T23 a <http://valuenet/ontop/catalog_contents_additional_attributes> . ?T23 <http://valuenet/ontop/attribute_value> ?T23_attribute_value . } GROUP BY ?T23_attribute_value ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Find the entry name of the catalog with the highest price (in USD).,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :price_in_dollars ?T1_price_in_dollars . } ORDER BY DESC (?T1_price_in_dollars) LIMIT 1",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/price_in_dollars> ?T1_price_in_dollars . } ORDER BY DESC (?T1_price_in_dollars) LIMIT 1
Find the level name of the catalog with the lowest price (in USD).,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_level_name WHERE { ?T1 a :catalog_structure . ?T2 a :catalog_contents . ?T2 :ref-catalog_level_number ?T1 . ?T1 :catalog_level_name ?T1_catalog_level_name . ?T2 :price_in_dollars ?T2_price_in_dollars . } ORDER BY ASC (?T2_price_in_dollars) LIMIT 1",SELECT ?T1_catalog_level_name WHERE { ?T1 a <http://valuenet/ontop/catalog_structure> . ?T2 a <http://valuenet/ontop/catalog_contents> . ?T2 <http://valuenet/ontop/ref-catalog_level_number> ?T1 . ?T1 <http://valuenet/ontop/catalog_level_name> ?T1_catalog_level_name . ?T2 <http://valuenet/ontop/price_in_dollars> ?T2_price_in_dollars . } ORDER BY ASC (?T2_price_in_dollars) LIMIT 1
Give me the average and minimum price (in Euro) of the products.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_137 ) (min( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_47 ) WHERE { ?T1 a :catalog_contents . ?T1 :price_in_euros ?T1_price_in_euros . ?T1 :price_in_euros ?T1_price_in_euros . }",SELECT (avg( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_137 ) (min( ?T1_price_in_euros) as ?aggregation_T1_price_in_euros_47 ) WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/price_in_euros> ?T1_price_in_euros . ?T1 <http://valuenet/ontop/price_in_euros> ?T1_price_in_euros . }
What is the product with the highest height? Give me the catalog entry name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :height ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/height> ?T1_height . } ORDER BY DESC (?T1_height) LIMIT 1
Find the name of the product that has the smallest capacity.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :capacity ?T1_capacity . } ORDER BY ASC (?T1_capacity) LIMIT 1",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . } ORDER BY ASC (?T1_capacity) LIMIT 1
Find the names of all the products whose stock number starts with '2'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :product_stock_number ?T1_product_stock_number . FILTER(contains (?T1_product_stock_number, '2')) . }","SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/product_stock_number> ?T1_product_stock_number . FILTER(contains (?T1_product_stock_number, '2')) . }"
Find the names of catalog entries with level number 8.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T2 a :catalog_contents_additional_attributes . ?T2 :ref-catalog_entry ?T1 . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T2 :catalog_level_number ?T2_catalog_level_number . FILTER(?T2_catalog_level_number = 8) . }",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T2 a <http://valuenet/ontop/catalog_contents_additional_attributes> . ?T2 <http://valuenet/ontop/ref-catalog_entry> ?T1 . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T2 <http://valuenet/ontop/catalog_level_number> ?T2_catalog_level_number . FILTER(?T2_catalog_level_number = 8) . }
Find the names of the products with length smaller than 3 or height greater than 5.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :length ?T1_length . ?T1 :width ?T1_width . FILTER(?T1_length < 3 || ?T1_width > 5) . }",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/length> ?T1_length . ?T1 <http://valuenet/ontop/width> ?T1_width . FILTER(?T1_length < 3 || ?T1_width > 5) . }
Find the name and capacity of products with price greater than 700 (in USD).,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name ?T1_capacity WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :capacity ?T1_capacity . ?T1 :price_in_dollars ?T1_price_in_dollars . FILTER(?T1_price_in_dollars > 700) . }",SELECT ?T1_catalog_entry_name ?T1_capacity WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . ?T1 <http://valuenet/ontop/price_in_dollars> ?T1_price_in_dollars . FILTER(?T1_price_in_dollars > 700) . }
Find the dates on which more than one revisions were made.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_latest_revision WHERE { ?T1 a :catalogs . ?T1 :date_of_latest_revision ?T1_date_of_latest_revision . } GROUP BY ?T1_date_of_latest_revision HAVING(count( *) > 1)",SELECT ?T1_date_of_latest_revision WHERE { ?T1 a <http://valuenet/ontop/catalogs> . ?T1 <http://valuenet/ontop/date_of_latest_revision> ?T1_date_of_latest_revision . } GROUP BY ?T1_date_of_latest_revision HAVING(count( *) > 1)
Find the total number of catalog contents.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :catalog_contents . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . }
Name all the products with next entry ID greater than 8.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_catalog_entry_name WHERE { ?T1 a :catalog_contents . ?T1 :catalog_entry_name ?T1_catalog_entry_name . ?T1 :next_entry_id ?T1_next_entry_id . FILTER(?T1_next_entry_id > 8) . }",SELECT ?T1_catalog_entry_name WHERE { ?T1 a <http://valuenet/ontop/catalog_contents> . ?T1 <http://valuenet/ontop/catalog_entry_name> ?T1_catalog_entry_name . ?T1 <http://valuenet/ontop/next_entry_id> ?T1_next_entry_id . FILTER(?T1_next_entry_id > 8) . }
