nl_question,sparql_partial_uri,sparql_complete_uri
"How many bookings did each customer make? List the customer id, first name, and the count.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_id ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :bookings . ?T2 :ref-customer ?T1 . ?T1 :customer_id ?T1_customer_id . ?T1 :first_name ?T1_first_name . } GROUP BY ?T1_customer_id ?T1_first_name",SELECT ?T1_customer_id ?T1_first_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/bookings> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . } GROUP BY ?T1_customer_id ?T1_first_name
What is the maximum total amount paid by a customer? List the customer id and amount.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_id (sum( ?T1_amount_paid) as ?aggregation_T1_amount_paid_90 ) WHERE { ?T1 a :payments . ?T1 :customer_id ?T1_customer_id . ?T1 :amount_paid ?T1_amount_paid . ?T1 :amount_paid ?T1_amount_paid . } GROUP BY ?T1_customer_id ORDER BY DESC (sum( ?T1_amount_paid)) LIMIT 1",SELECT ?T1_customer_id (sum( ?T1_amount_paid) as ?aggregation_T1_amount_paid_90 ) WHERE { ?T1 a <http://valuenet/ontop/payments> . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/amount_paid> ?T1_amount_paid . ?T1 <http://valuenet/ontop/amount_paid> ?T1_amount_paid . } GROUP BY ?T1_customer_id ORDER BY DESC (sum( ?T1_amount_paid)) LIMIT 1
"What are the first name, last name, and gender of all the good customers? Order by their last name.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_first_name ?T1_last_name ?T1_gender_mf WHERE { ?T1 a :customers . ?T1 :first_name ?T1_first_name . ?T1 :last_name ?T1_last_name . ?T1 :gender_mf ?T1_gender_mf . ?T1 :last_name ?T1_last_name . ?T1 :good_or_bad_customer ?T1_good_or_bad_customer . FILTER(?T1_good_or_bad_customer = 'good') . } ORDER BY ASC (?T1_last_name)",SELECT ?T1_first_name ?T1_last_name ?T1_gender_mf WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/first_name> ?T1_first_name . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/gender_mf> ?T1_gender_mf . ?T1 <http://valuenet/ontop/last_name> ?T1_last_name . ?T1 <http://valuenet/ontop/good_or_bad_customer> ?T1_good_or_bad_customer . FILTER(?T1_good_or_bad_customer = 'good') . } ORDER BY ASC (?T1_last_name)
What are the payment date of the payment with amount paid higher than 300 or with payment type is 'Check',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_payment_date WHERE { ?T1 a :payments . ?T1 :payment_date ?T1_payment_date . ?T1 :amount_paid ?T1_amount_paid . ?T1 :payment_type_code ?T1_payment_type_code . FILTER(?T1_amount_paid > 300 || ?T1_payment_type_code = 'Check') . }",SELECT ?T1_payment_date WHERE { ?T1 a <http://valuenet/ontop/payments> . ?T1 <http://valuenet/ontop/payment_date> ?T1_payment_date . ?T1 <http://valuenet/ontop/amount_paid> ?T1_amount_paid . ?T1 <http://valuenet/ontop/payment_type_code> ?T1_payment_type_code . FILTER(?T1_amount_paid > 300 || ?T1_payment_type_code = 'Check') . }
