nl_question,sparql_partial_uri,sparql_complete_uri
Find the names of channels that are not owned by CCTV.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :channel . ?T1 :name ?T1_name . ?T1 :owner ?T1_owner . FILTER(?T1_owner != 'CCTV') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/owner> ?T1_owner . FILTER(?T1_owner != 'CCTV') . }
List all channel names ordered by their rating in percent from big to small.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :channel . ?T1 :name ?T1_name . ?T1 :rating_in_percent ?T1_rating_in_percent . } ORDER BY DESC (?T1_rating_in_percent)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/rating_in_percent> ?T1_rating_in_percent . } ORDER BY DESC (?T1_rating_in_percent)
Show me the owner of the channel with the highest rating.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_owner WHERE { ?T1 a :channel . ?T1 :owner ?T1_owner . ?T1 :rating_in_percent ?T1_rating_in_percent . } ORDER BY DESC (?T1_rating_in_percent) LIMIT 1",SELECT ?T1_owner WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/owner> ?T1_owner . ?T1 <http://valuenet/ontop/rating_in_percent> ?T1_rating_in_percent . } ORDER BY DESC (?T1_rating_in_percent) LIMIT 1
Count the number of programs.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :program . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/program> . }
"list all the names of programs, ordering by launch time.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :program . ?T1 :name ?T1_name . ?T1 :launch ?T1_launch . } ORDER BY ASC (?T1_launch)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/program> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/launch> ?T1_launch . } ORDER BY ASC (?T1_launch)
"List the name, origin and owner of each program.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_origin ?T1_owner WHERE { ?T1 a :program . ?T1 :name ?T1_name . ?T1 :origin ?T1_origin . ?T1 :owner ?T1_owner . }",SELECT ?T1_name ?T1_origin ?T1_owner WHERE { ?T1 a <http://valuenet/ontop/program> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/origin> ?T1_origin . ?T1 <http://valuenet/ontop/owner> ?T1_owner . }
find the name of the program that was launched most recently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :program . ?T1 :name ?T1_name . ?T1 :launch ?T1_launch . } ORDER BY DESC (?T1_launch) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/program> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/launch> ?T1_launch . } ORDER BY DESC (?T1_launch) LIMIT 1
find the total percentage share of all channels owned by CCTV.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_share_in_percent) as ?aggregation_T1_share_in_percent_50 ) WHERE { ?T1 a :channel . ?T1 :share_in_percent ?T1_share_in_percent . ?T1 :owner ?T1_owner . FILTER(?T1_owner = 'CCTV') . }",SELECT (sum( ?T1_share_in_percent) as ?aggregation_T1_share_in_percent_50 ) WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/share_in_percent> ?T1_share_in_percent . ?T1 <http://valuenet/ontop/owner> ?T1_owner . FILTER(?T1_owner = 'CCTV') . }
Find the names of the channels that are broadcast in the morning.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :channel . ?T2 a :broadcast . ?T2 :ref-channel ?T1 . ?T1 :name ?T1_name . ?T2 :time_of_day ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T2 a <http://valuenet/ontop/broadcast> . ?T2 <http://valuenet/ontop/ref-channel> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/time_of_day> ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . }
Which channels broadcast both in the morning and at night? Give me the channel names.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :channel . ?T2 a :broadcast . ?T2 :ref-channel ?T1 . ?T1 :name ?T1_name . ?T2 :time_of_day ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . FILTER (?T1_name in (?T3_name)) . ?T3 a :channel . ?T4 a :broadcast . ?T4 :ref-channel ?T3 . ?T3 :name ?T3_name . ?T4 :time_of_day ?T4_time_of_day . FILTER(?T4_time_of_day = 'Night') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T2 a <http://valuenet/ontop/broadcast> . ?T2 <http://valuenet/ontop/ref-channel> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/time_of_day> ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/channel> . ?T4 a <http://valuenet/ontop/broadcast> . ?T4 <http://valuenet/ontop/ref-channel> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/time_of_day> ?T4_time_of_day . FILTER(?T4_time_of_day = 'Night') . }
Count the number of programs broadcast for each time section of a day.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_time_of_day WHERE { ?T1 a :broadcast . ?T1 :time_of_day ?T1_time_of_day . } GROUP BY ?T1_time_of_day",SELECT (count( *) as ?aggregation_all) ?T1_time_of_day WHERE { ?T1 a <http://valuenet/ontop/broadcast> . ?T1 <http://valuenet/ontop/time_of_day> ?T1_time_of_day . } GROUP BY ?T1_time_of_day
find the number of different programs that are broadcast during night time.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_program_id) as ?aggregation_T1_program_id_129 ) WHERE { ?T1 a :broadcast . ?T1 :program_id ?T1_program_id . ?T1 :time_of_day ?T1_time_of_day . FILTER(?T1_time_of_day = 'Night') . }",SELECT DISTINCT (count(DISTINCT ?T1_program_id) as ?aggregation_T1_program_id_129 ) WHERE { ?T1 a <http://valuenet/ontop/broadcast> . ?T1 <http://valuenet/ontop/program_id> ?T1_program_id . ?T1 <http://valuenet/ontop/time_of_day> ?T1_time_of_day . FILTER(?T1_time_of_day = 'Night') . }
Find the names of programs that are never broadcasted in the morning.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :program . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :program . ?T3 a :broadcast . ?T3 :ref-program ?T2 . ?T2 :name ?T2_name . ?T3 :time_of_day ?T3_time_of_day . FILTER(?T3_time_of_day = 'Morning') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/program> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/program> . ?T3 a <http://valuenet/ontop/broadcast> . ?T3 <http://valuenet/ontop/ref-program> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/time_of_day> ?T3_time_of_day . FILTER(?T3_time_of_day = 'Morning') . } } }
find the program owners that have some programs in both morning and night time.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_owner WHERE { ?T1 a :program . ?T2 a :broadcast . ?T2 :ref-program ?T1 . ?T1 :owner ?T1_owner . ?T2 :time_of_day ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . FILTER (?T1_owner in (?T3_owner)) . ?T3 a :program . ?T4 a :broadcast . ?T4 :ref-program ?T3 . ?T3 :owner ?T3_owner . ?T4 :time_of_day ?T4_time_of_day . FILTER(?T4_time_of_day = 'Night') . }",SELECT DISTINCT ?T1_owner WHERE { ?T1 a <http://valuenet/ontop/program> . ?T2 a <http://valuenet/ontop/broadcast> . ?T2 <http://valuenet/ontop/ref-program> ?T1 . ?T1 <http://valuenet/ontop/owner> ?T1_owner . ?T2 <http://valuenet/ontop/time_of_day> ?T2_time_of_day . FILTER(?T2_time_of_day = 'Morning') . FILTER (?T1_owner in (?T3_owner)) . ?T3 a <http://valuenet/ontop/program> . ?T4 a <http://valuenet/ontop/broadcast> . ?T4 <http://valuenet/ontop/ref-program> ?T3 . ?T3 <http://valuenet/ontop/owner> ?T3_owner . ?T4 <http://valuenet/ontop/time_of_day> ?T4_time_of_day . FILTER(?T4_time_of_day = 'Night') . }
List all program origins in the alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_origin WHERE { ?T1 a :program . ?T1 :origin ?T1_origin . ?T1 :origin ?T1_origin . } ORDER BY ASC (?T1_origin)",SELECT ?T1_origin WHERE { ?T1 a <http://valuenet/ontop/program> . ?T1 <http://valuenet/ontop/origin> ?T1_origin . ?T1 <http://valuenet/ontop/origin> ?T1_origin . } ORDER BY ASC (?T1_origin)
Count the number of distinct channel owners.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_owner) as ?aggregation_T1_owner_6 ) WHERE { ?T1 a :channel . ?T1 :owner ?T1_owner . }",SELECT DISTINCT (count(DISTINCT ?T1_owner) as ?aggregation_T1_owner_6 ) WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/owner> ?T1_owner . }
find the names of programs whose origin is not in Beijing.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :program . ?T1 :name ?T1_name . ?T1 :origin ?T1_origin . FILTER(?T1_origin != 'Beijing') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/program> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/origin> ?T1_origin . FILTER(?T1_origin != 'Beijing') . }
List the names of all the channels owned by either CCTV or HBS,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :channel . ?T1 :name ?T1_name . ?T1 :owner ?T1_owner . ?T1 :owner ?T1_owner . FILTER(?T1_owner = 'CCTV' || ?T1_owner = 'HBS') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/owner> ?T1_owner . ?T1 <http://valuenet/ontop/owner> ?T1_owner . FILTER(?T1_owner = 'CCTV' || ?T1_owner = 'HBS') . }
Find the total rating ratio for each channel owner.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_rating_in_percent) as ?aggregation_T1_rating_in_percent_63 ) ?T1_owner WHERE { ?T1 a :channel . ?T1 :rating_in_percent ?T1_rating_in_percent . ?T1 :owner ?T1_owner . } GROUP BY ?T1_owner",SELECT (sum( ?T1_rating_in_percent) as ?aggregation_T1_rating_in_percent_63 ) ?T1_owner WHERE { ?T1 a <http://valuenet/ontop/channel> . ?T1 <http://valuenet/ontop/rating_in_percent> ?T1_rating_in_percent . ?T1 <http://valuenet/ontop/owner> ?T1_owner . } GROUP BY ?T1_owner
Find the name of the program that is broadcast most frequently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :program . ?T2 a :broadcast . ?T2 :ref-program ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/program> . ?T2 a <http://valuenet/ontop/broadcast> . ?T2 <http://valuenet/ontop/ref-program> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
