nl_question,sparql_partial_uri,sparql_complete_uri
"Show the name, street address, and number of floors for all buildings ordered by the number of floors.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_street_address ?T1_floors WHERE { ?T1 a :building . ?T1 :name ?T1_name . ?T1 :street_address ?T1_street_address . ?T1 :floors ?T1_floors . ?T1 :floors ?T1_floors . } ORDER BY ASC (?T1_floors)",SELECT ?T1_name ?T1_street_address ?T1_floors WHERE { ?T1 a <http://valuenet/ontop/building> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/street_address> ?T1_street_address . ?T1 <http://valuenet/ontop/floors> ?T1_floors . ?T1 <http://valuenet/ontop/floors> ?T1_floors . } ORDER BY ASC (?T1_floors)
Show the number of buildings with a height above the average or a number of floors above the average.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :building . ?T1 :height_feet ?T1_height_feet . ?T1 :floors ?T1_floors . FILTER(?T1_height_feet > (?aggregation_T22_height_feet_107) || ?T1_floors > (?aggregation_T22_floors_26)) . {SELECT (avg( ?T22_height_feet) as ?aggregation_T22_height_feet_107 ) WHERE { ?T22 a :building . ?T22 :height_feet ?T22_height_feet . } } {SELECT (avg( ?T22_floors) as ?aggregation_T22_floors_26 ) WHERE { ?T22 a :building . ?T22 :floors ?T22_floors . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/building> . ?T1 <http://valuenet/ontop/height_feet> ?T1_height_feet . ?T1 <http://valuenet/ontop/floors> ?T1_floors . FILTER(?T1_height_feet > (?aggregation_T22_height_feet_107) || ?T1_floors > (?aggregation_T22_floors_26)) . {SELECT (avg( ?T22_height_feet) as ?aggregation_T22_height_feet_107 ) WHERE { ?T22 a <http://valuenet/ontop/building> . ?T22 <http://valuenet/ontop/height_feet> ?T22_height_feet . } } {SELECT (avg( ?T22_floors) as ?aggregation_T22_floors_26 ) WHERE { ?T22 a <http://valuenet/ontop/building> . ?T22 <http://valuenet/ontop/floors> ?T22_floors . } } }
List the names of buildings with at least 200 feet of height and with at least 20 floors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :building . ?T1 :name ?T1_name . ?T1 :height_feet ?T1_height_feet . ?T1 :floors ?T1_floors . FILTER(?T1_height_feet >= 200 && ?T1_floors >= 20) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/building> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/height_feet> ?T1_height_feet . ?T1 <http://valuenet/ontop/floors> ?T1_floors . FILTER(?T1_height_feet >= 200 && ?T1_floors >= 20) . }
Show the names and locations of institutions that are founded after 1990 and have the type 'Private'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_institution ?T1_location WHERE { ?T1 a :institution . ?T1 :institution ?T1_institution . ?T1 :location ?T1_location . ?T1 :founded ?T1_founded . ?T1 :type ?T1_type . FILTER(?T1_founded > 1990 && ?T1_type = 'Private') . }",SELECT ?T1_institution ?T1_location WHERE { ?T1 a <http://valuenet/ontop/institution> . ?T1 <http://valuenet/ontop/institution> ?T1_institution . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/founded> ?T1_founded . ?T1 <http://valuenet/ontop/type> ?T1_type . FILTER(?T1_founded > 1990 && ?T1_type = 'Private') . }
"Show institution types, along with the number of institutions and total enrollment for each type.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_49 ) WHERE { ?T1 a :institution . ?T1 :type ?T1_type . ?T1 :enrollment ?T1_enrollment . } GROUP BY ?T1_type",SELECT ?T1_type (count( *) as ?aggregation_all) (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_49 ) WHERE { ?T1 a <http://valuenet/ontop/institution> . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . } GROUP BY ?T1_type
Show the institution type with the largest number of institutions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :institution . ?T1 :type ?T1_type . } GROUP BY ?T1_type ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/institution> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type ORDER BY DESC (?aggregation_all) LIMIT 1
Show the institution type with an institution founded after 1990 and an institution with at least 1000 enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type WHERE { ?T1 a :institution . ?T1 :type ?T1_type . ?T1 :founded ?T1_founded . ?T1 :enrollment ?T1_enrollment . FILTER(?T1_founded > 1990 && ?T1_enrollment >= 1000) . }",SELECT ?T1_type WHERE { ?T1 a <http://valuenet/ontop/institution> . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/founded> ?T1_founded . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . FILTER(?T1_founded > 1990 && ?T1_enrollment >= 1000) . }
Show the name of buildings that do not have any institution.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :building . ?T1 :name ?T1_name . ?T1 :building_id ?T1_building_id . FILTER(?T1_building_id not in (?T22_building_id)) . {SELECT ?T22_building_id WHERE { ?T22 a :institution . ?T22 :building_id ?T22_building_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/building> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/building_id> ?T1_building_id . FILTER(?T1_building_id not in (?T22_building_id)) . {SELECT ?T22_building_id WHERE { ?T22 a <http://valuenet/ontop/institution> . ?T22 <http://valuenet/ontop/building_id> ?T22_building_id . } } }
Show the names of buildings except for those having an institution founded in 2003.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :building . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :building . ?T3 a :institution . ?T3 :ref-building ?T2 . ?T2 :name ?T2_name . ?T3 :founded ?T3_founded . FILTER(?T3_founded = 2003) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/building> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/building> . ?T3 a <http://valuenet/ontop/institution> . ?T3 <http://valuenet/ontop/ref-building> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/founded> ?T3_founded . FILTER(?T3_founded = 2003) . } } }
"For each building, show the name of the building and the number of institutions in it.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :building . ?T2 a :institution . ?T2 :ref-building ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/building> . ?T2 a <http://valuenet/ontop/institution> . ?T2 <http://valuenet/ontop/ref-building> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Show the names and heights of buildings with at least two institutions founded after 1880.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_height_feet WHERE { ?T1 a :building . ?T2 a :institution . ?T2 :ref-building ?T1 . ?T1 :name ?T1_name . ?T1 :height_feet ?T1_height_feet . ?T2 :founded ?T2_founded . FILTER(?T2_founded > 1880) . } GROUP BY ?T1_name ?T1_height_feet HAVING(count( *) >= 2)",SELECT ?T1_name ?T1_height_feet WHERE { ?T1 a <http://valuenet/ontop/building> . ?T2 a <http://valuenet/ontop/institution> . ?T2 <http://valuenet/ontop/ref-building> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/height_feet> ?T1_height_feet . ?T2 <http://valuenet/ontop/founded> ?T2_founded . FILTER(?T2_founded > 1880) . } GROUP BY ?T1_name ?T1_height_feet HAVING(count( *) >= 2)
Show all the distinct institution types.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_type WHERE { ?T1 a :institution . ?T1 :type ?T1_type . }",SELECT DISTINCT ?T1_type WHERE { ?T1 a <http://valuenet/ontop/institution> . ?T1 <http://valuenet/ontop/type> ?T1_type . }
Show institution names along with the number of proteins for each institution.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_institution (count( *) as ?aggregation_all) WHERE { ?T1 a :institution . ?T2 a :protein . ?T2 :ref-institution ?T1 . ?T1 :institution ?T1_institution . } GROUP BY ?T1_institution",SELECT ?T1_institution (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/institution> . ?T2 a <http://valuenet/ontop/protein> . ?T2 <http://valuenet/ontop/ref-institution> ?T1 . ?T1 <http://valuenet/ontop/institution> ?T1_institution . } GROUP BY ?T1_institution
Show the protein name and the institution name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_protein_name ?T2_institution WHERE { ?T1 a :protein . ?T2 a :institution . ?T1 :ref-institution ?T2 . ?T1 :protein_name ?T1_protein_name . ?T2 :institution ?T2_institution . }",SELECT ?T1_protein_name ?T2_institution WHERE { ?T1 a <http://valuenet/ontop/protein> . ?T2 a <http://valuenet/ontop/institution> . ?T1 <http://valuenet/ontop/ref-institution> ?T2 . ?T1 <http://valuenet/ontop/protein_name> ?T1_protein_name . ?T2 <http://valuenet/ontop/institution> ?T2_institution . }
