nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of tracks.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :track . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/track> . }
Show the name and location for all tracks.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location WHERE { ?T1 a :track . ?T1 :name ?T1_name . ?T1 :location ?T1_location . }",SELECT ?T1_name ?T1_location WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . }
"Show names and seatings, ordered by seating for all tracks opened after 2000.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_seating WHERE { ?T1 a :track . ?T1 :name ?T1_name . ?T1 :seating ?T1_seating . ?T1 :seating ?T1_seating . ?T1 :year_opened ?T1_year_opened . FILTER(?T1_year_opened > 2000) . } ORDER BY ASC (?T1_seating)",SELECT ?T1_name ?T1_seating WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/year_opened> ?T1_year_opened . FILTER(?T1_year_opened > 2000) . } ORDER BY ASC (?T1_seating)
"Return the name, location, and seating of the track that was opened in the most recent year.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location ?T1_seating WHERE { ?T1 a :track . ?T1 :name ?T1_name . ?T1 :location ?T1_location . ?T1 :seating ?T1_seating . ?T1 :year_opened ?T1_year_opened . } ORDER BY DESC (?T1_year_opened) LIMIT 1",SELECT ?T1_name ?T1_location ?T1_seating WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/year_opened> ?T1_year_opened . } ORDER BY DESC (?T1_year_opened) LIMIT 1
"What is the minimum, maximum, and average seating for all tracks.","PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_seating) as ?aggregation_T1_seating_13 ) (max( ?T1_seating) as ?aggregation_T1_seating_71 ) (avg( ?T1_seating) as ?aggregation_T1_seating_66 ) WHERE { ?T1 a :track . ?T1 :seating ?T1_seating . ?T1 :seating ?T1_seating . ?T1 :seating ?T1_seating . }",SELECT (min( ?T1_seating) as ?aggregation_T1_seating_13 ) (max( ?T1_seating) as ?aggregation_T1_seating_71 ) (avg( ?T1_seating) as ?aggregation_T1_seating_66 ) WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/seating> ?T1_seating . }
"Return the minimum, maximum, and average seating across all tracks.","PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_seating) as ?aggregation_T1_seating_89 ) (max( ?T1_seating) as ?aggregation_T1_seating_92 ) (avg( ?T1_seating) as ?aggregation_T1_seating_152 ) WHERE { ?T1 a :track . ?T1 :seating ?T1_seating . ?T1 :seating ?T1_seating . ?T1 :seating ?T1_seating . }",SELECT (min( ?T1_seating) as ?aggregation_T1_seating_89 ) (max( ?T1_seating) as ?aggregation_T1_seating_92 ) (avg( ?T1_seating) as ?aggregation_T1_seating_152 ) WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/seating> ?T1_seating . ?T1 <http://valuenet/ontop/seating> ?T1_seating . }
"Show the name, location, open year for all tracks with a seating higher than the average.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location ?T1_year_opened WHERE { ?T1 a :track . ?T1 :name ?T1_name . ?T1 :location ?T1_location . ?T1 :year_opened ?T1_year_opened . ?T1 :seating ?T1_seating . FILTER(?T1_seating > (?aggregation_T22_seating_24)) . {SELECT (avg( ?T22_seating) as ?aggregation_T22_seating_24 ) WHERE { ?T22 a :track . ?T22 :seating ?T22_seating . } } }",SELECT ?T1_name ?T1_location ?T1_year_opened WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/year_opened> ?T1_year_opened . ?T1 <http://valuenet/ontop/seating> ?T1_seating . FILTER(?T1_seating > (?aggregation_T22_seating_24)) . {SELECT (avg( ?T22_seating) as ?aggregation_T22_seating_24 ) WHERE { ?T22 a <http://valuenet/ontop/track> . ?T22 <http://valuenet/ontop/seating> ?T22_seating . } } }
Give the different locations of tracks.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_location WHERE { ?T1 a :track . ?T1 :location ?T1_location . }",SELECT DISTINCT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/location> ?T1_location . }
Count the number of races.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :race . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/race> . }
Return the different classes of races.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_class WHERE { ?T1 a :race . ?T1 :class ?T1_class . }",SELECT DISTINCT ?T1_class WHERE { ?T1 a <http://valuenet/ontop/race> . ?T1 <http://valuenet/ontop/class> ?T1_class . }
"Show name, class, and date for all races.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_class ?T1_date WHERE { ?T1 a :race . ?T1 :name ?T1_name . ?T1 :class ?T1_class . ?T1 :date ?T1_date . }",SELECT ?T1_name ?T1_class ?T1_date WHERE { ?T1 a <http://valuenet/ontop/race> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/class> ?T1_class . ?T1 <http://valuenet/ontop/date> ?T1_date . }
Show the race class and number of races in each class.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_class (count( *) as ?aggregation_all) WHERE { ?T1 a :race . ?T1 :class ?T1_class . } GROUP BY ?T1_class",SELECT ?T1_class (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/race> . ?T1 <http://valuenet/ontop/class> ?T1_class . } GROUP BY ?T1_class
What is the race class with most number of races.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_class (count( *) as ?aggregation_all) WHERE { ?T1 a :race . ?T1 :class ?T1_class . } GROUP BY ?T1_class ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_class (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/race> . ?T1 <http://valuenet/ontop/class> ?T1_class . } GROUP BY ?T1_class ORDER BY DESC (?aggregation_all) LIMIT 1
List the race class with at least two races.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_class WHERE { ?T1 a :race . ?T1 :class ?T1_class . } GROUP BY ?T1_class HAVING(count( *) >= 2)",SELECT ?T1_class WHERE { ?T1 a <http://valuenet/ontop/race> . ?T1 <http://valuenet/ontop/class> ?T1_class . } GROUP BY ?T1_class HAVING(count( *) >= 2)
What are the names for tracks without a race in class 'GT'.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :track . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :track . ?T3 a :race . ?T3 :ref-track ?T2 . ?T2 :name ?T2_name . ?T3 :class ?T3_class . FILTER(?T3_class = 'GT') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/track> . ?T3 a <http://valuenet/ontop/race> . ?T3 <http://valuenet/ontop/ref-track> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/class> ?T3_class . FILTER(?T3_class = 'GT') . } } }
Show all track names that have had no races.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :track . ?T1 :name ?T1_name . ?T1 :track_id ?T1_track_id . FILTER(?T1_track_id not in (?T22_track_id)) . {SELECT ?T22_track_id WHERE { ?T22 a :race . ?T22 :track_id ?T22_track_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/track_id> ?T1_track_id . FILTER(?T1_track_id not in (?T22_track_id)) . {SELECT ?T22_track_id WHERE { ?T22 a <http://valuenet/ontop/race> . ?T22 <http://valuenet/ontop/track_id> ?T22_track_id . } } }
Show year where a track with a seating at least 5000 opened and a track with seating no more than 4000 opened.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_year_opened WHERE { ?T1 a :track . ?T1 :year_opened ?T1_year_opened . ?T1 :seating ?T1_seating . FILTER(?T1_seating >= 4000 && ?T1_seating <= 5000) . }",SELECT ?T1_year_opened WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/year_opened> ?T1_year_opened . ?T1 <http://valuenet/ontop/seating> ?T1_seating . FILTER(?T1_seating >= 4000 && ?T1_seating <= 5000) . }
Show the name of track and the number of races in each track.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :race . ?T2 :ref-track ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/track> . ?T2 a <http://valuenet/ontop/race> . ?T2 <http://valuenet/ontop/ref-track> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Show the name of track with most number of races.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :track . ?T2 a :race . ?T2 :ref-track ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/track> . ?T2 a <http://valuenet/ontop/race> . ?T2 <http://valuenet/ontop/ref-track> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
Show the name and date for each race and its track name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_date ?T2_name WHERE { ?T1 a :race . ?T2 a :track . ?T1 :ref-track ?T2 . ?T1 :name ?T1_name . ?T1 :date ?T1_date . ?T2 :name ?T2_name . }",SELECT ?T1_name ?T1_date ?T2_name WHERE { ?T1 a <http://valuenet/ontop/race> . ?T2 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/ref-track> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the name and location of track with 1 race.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location WHERE { ?T1 a :track . ?T2 a :race . ?T2 :ref-track ?T1 . ?T1 :name ?T1_name . ?T1 :location ?T1_location . } GROUP BY ?T1_name ?T1_location HAVING(count( *) = 1)",SELECT ?T1_name ?T1_location WHERE { ?T1 a <http://valuenet/ontop/track> . ?T2 a <http://valuenet/ontop/race> . ?T2 <http://valuenet/ontop/ref-track> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_name ?T1_location HAVING(count( *) = 1)
Find the locations where have both tracks with more than 90000 seats and tracks with less than 70000 seats.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_location WHERE { ?T1 a :track . ?T1 :location ?T1_location . ?T1 :seating ?T1_seating . FILTER(?T1_seating > 90000) . FILTER (?T1_location in (?T2_location)) . ?T2 a :track . ?T2 :location ?T2_location . ?T2 :seating ?T2_seating . FILTER(?T2_seating < 70000) . }",SELECT DISTINCT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/track> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/seating> ?T1_seating . FILTER(?T1_seating > 90000) . FILTER (?T1_location in (?T2_location)) . ?T2 a <http://valuenet/ontop/track> . ?T2 <http://valuenet/ontop/location> ?T2_location . ?T2 <http://valuenet/ontop/seating> ?T2_seating . FILTER(?T2_seating < 70000) . }
