nl_question,sparql_partial_uri,sparql_complete_uri
List the builders of railways in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_builder WHERE { ?T1 a :railway . ?T1 :builder ?T1_builder . ?T1 :builder ?T1_builder . } ORDER BY ASC (?T1_builder)",SELECT ?T1_builder WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/builder> ?T1_builder . ?T1 <http://valuenet/ontop/builder> ?T1_builder . } ORDER BY ASC (?T1_builder)
List the wheels and locations of the railways.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_wheels ?T1_location WHERE { ?T1 a :railway . ?T1 :wheels ?T1_wheels . ?T1 :location ?T1_location . }",SELECT ?T1_wheels ?T1_location WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/wheels> ?T1_wheels . ?T1 <http://valuenet/ontop/location> ?T1_location . }
Show the names of trains and locations of railways they are in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_location WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :ref-railway ?T2 . ?T1 :name ?T1_name . ?T2 :location ?T2_location . }",SELECT ?T1_name ?T2_location WHERE { ?T1 a <http://valuenet/ontop/train> . ?T2 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/ref-railway> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/location> ?T2_location . }
Show the builder of railways associated with the trains named 'Andaman Exp'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_builder WHERE { ?T1 a :railway . ?T2 a :train . ?T2 :ref-railway ?T1 . ?T1 :builder ?T1_builder . ?T2 :name ?T2_name . FILTER(?T2_name = 'Andaman Exp') . }",SELECT ?T1_builder WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T2 a <http://valuenet/ontop/train> . ?T2 <http://valuenet/ontop/ref-railway> ?T1 . ?T1 <http://valuenet/ontop/builder> ?T1_builder . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Andaman Exp') . }
Show id and location of railways that are associated with more than one train.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_railway_id ?T2_location WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :ref-railway ?T2 . ?T1 :railway_id ?T1_railway_id . ?T2 :location ?T2_location . } GROUP BY ?T1_railway_id ?T2_location HAVING(count( *) > 1)",SELECT ?T1_railway_id ?T2_location WHERE { ?T1 a <http://valuenet/ontop/train> . ?T2 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/ref-railway> ?T2 . ?T1 <http://valuenet/ontop/railway_id> ?T1_railway_id . ?T2 <http://valuenet/ontop/location> ?T2_location . } GROUP BY ?T1_railway_id ?T2_location HAVING(count( *) > 1)
Show the id and builder of the railway that are associated with the most trains.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_railway_id (count( *) as ?aggregation_all) ?T2_builder WHERE { ?T1 a :train . ?T2 a :railway . ?T1 :ref-railway ?T2 . ?T1 :railway_id ?T1_railway_id . ?T2 :builder ?T2_builder . } GROUP BY ?T1_railway_id ?T2_builder ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_railway_id (count( *) as ?aggregation_all) ?T2_builder WHERE { ?T1 a <http://valuenet/ontop/train> . ?T2 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/ref-railway> ?T2 . ?T1 <http://valuenet/ontop/railway_id> ?T1_railway_id . ?T2 <http://valuenet/ontop/builder> ?T2_builder . } GROUP BY ?T1_railway_id ?T2_builder ORDER BY DESC (?aggregation_all) LIMIT 1
"Show different builders of railways, along with the corresponding number of railways using each builder.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_builder (count( *) as ?aggregation_all) WHERE { ?T1 a :railway . ?T1 :builder ?T1_builder . } GROUP BY ?T1_builder",SELECT ?T1_builder (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/builder> ?T1_builder . } GROUP BY ?T1_builder
Show the most common builder of railways.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_builder (count( *) as ?aggregation_all) WHERE { ?T1 a :railway . ?T1 :builder ?T1_builder . } GROUP BY ?T1_builder ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_builder (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/builder> ?T1_builder . } GROUP BY ?T1_builder ORDER BY DESC (?aggregation_all) LIMIT 1
Show different locations of railways along with the corresponding number of railways at each location.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a :railway . ?T1 :location ?T1_location . } GROUP BY ?T1_location",SELECT ?T1_location (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location
Show the locations that have more than one railways.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :railway . ?T1 :location ?T1_location . } GROUP BY ?T1_location HAVING(count( *) > 1)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location HAVING(count( *) > 1)
List the object number of railways that do not have any trains.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_objectnumber WHERE { ?T1 a :railway . ?T1 :objectnumber ?T1_objectnumber . ?T1 :railway_id ?T1_railway_id . FILTER(?T1_railway_id not in (?T22_railway_id)) . {SELECT ?T22_railway_id WHERE { ?T22 a :train . ?T22 :railway_id ?T22_railway_id . } } }",SELECT ?T1_objectnumber WHERE { ?T1 a <http://valuenet/ontop/railway> . ?T1 <http://valuenet/ontop/objectnumber> ?T1_objectnumber . ?T1 <http://valuenet/ontop/railway_id> ?T1_railway_id . FILTER(?T1_railway_id not in (?T22_railway_id)) . {SELECT ?T22_railway_id WHERE { ?T22 a <http://valuenet/ontop/train> . ?T22 <http://valuenet/ontop/railway_id> ?T22_railway_id . } } }
Show the countries that have both managers of age above 50 and managers of age below 46.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :manager . ?T1 :country ?T1_country . ?T1 :age ?T1_age . FILTER(?T1_age > 50) . FILTER (?T1_country in (?T2_country)) . ?T2 a :manager . ?T2 :country ?T2_country . ?T2 :age ?T2_age . FILTER(?T2_age < 46) . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/manager> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 50) . FILTER (?T1_country in (?T2_country)) . ?T2 a <http://valuenet/ontop/manager> . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age < 46) . }
Show the distinct countries of managers.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :manager . ?T1 :country ?T1_country . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/manager> . ?T1 <http://valuenet/ontop/country> ?T1_country . }
Show the working years of managers in descending order of their level.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_working_year_starts WHERE { ?T1 a :manager . ?T1 :working_year_starts ?T1_working_year_starts . ?T1 :level ?T1_level . } ORDER BY DESC (?T1_level)",SELECT ?T1_working_year_starts WHERE { ?T1 a <http://valuenet/ontop/manager> . ?T1 <http://valuenet/ontop/working_year_starts> ?T1_working_year_starts . ?T1 <http://valuenet/ontop/level> ?T1_level . } ORDER BY DESC (?T1_level)
Show the countries that have managers of age above 50 or below 46.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country WHERE { ?T1 a :manager . ?T1 :country ?T1_country . ?T1 :age ?T1_age . ?T1 :age ?T1_age . FILTER(?T1_age > 50 || ?T1_age < 46) . }",SELECT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/manager> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 50 || ?T1_age < 46) . }
