nl_question,sparql_partial_uri,sparql_complete_uri
List the names of players in ascending order of votes.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player_name WHERE { ?T1 a :player . ?T1 :player_name ?T1_player_name . ?T1 :votes ?T1_votes . } ORDER BY ASC (?T1_votes)",SELECT ?T1_player_name WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/player_name> ?T1_player_name . ?T1 <http://valuenet/ontop/votes> ?T1_votes . } ORDER BY ASC (?T1_votes)
List the name and residence for players whose occupation is not 'Researcher'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player_name ?T1_residence WHERE { ?T1 a :player . ?T1 :player_name ?T1_player_name . ?T1 :residence ?T1_residence . ?T1 :occupation ?T1_occupation . FILTER(?T1_occupation != 'Researcher') . }",SELECT ?T1_player_name ?T1_residence WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/player_name> ?T1_player_name . ?T1 <http://valuenet/ontop/residence> ?T1_residence . ?T1 <http://valuenet/ontop/occupation> ?T1_occupation . FILTER(?T1_occupation != 'Researcher') . }
Show the names of sponsors of players whose residence is either 'Brandon' or 'Birtle'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_sponsor_name WHERE { ?T1 a :player . ?T1 :sponsor_name ?T1_sponsor_name . ?T1 :residence ?T1_residence . ?T1 :residence ?T1_residence . FILTER(?T1_residence = 'Brandon' || ?T1_residence = 'Birtle') . }",SELECT ?T1_sponsor_name WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/sponsor_name> ?T1_sponsor_name . ?T1 <http://valuenet/ontop/residence> ?T1_residence . ?T1 <http://valuenet/ontop/residence> ?T1_residence . FILTER(?T1_residence = 'Brandon' || ?T1_residence = 'Birtle') . }
Show different occupations along with the number of players in each occupation.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_occupation (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :occupation ?T1_occupation . } GROUP BY ?T1_occupation",SELECT ?T1_occupation (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/occupation> ?T1_occupation . } GROUP BY ?T1_occupation
Please show the most common occupation of players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_occupation (count( *) as ?aggregation_all) WHERE { ?T1 a :player . ?T1 :occupation ?T1_occupation . } GROUP BY ?T1_occupation ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_occupation (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/occupation> ?T1_occupation . } GROUP BY ?T1_occupation ORDER BY DESC (?aggregation_all) LIMIT 1
Show the residences that have at least two players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_residence WHERE { ?T1 a :player . ?T1 :residence ?T1_residence . } GROUP BY ?T1_residence HAVING(count( *) >= 2)",SELECT ?T1_residence WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/residence> ?T1_residence . } GROUP BY ?T1_residence HAVING(count( *) >= 2)
Show the names and genders of players with a coach starting after 2011.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player_name ?T1_gender WHERE { ?T1 a :player . ?T2 a :player_coach . ?T2 :ref-player ?T1 . ?T1 :player_name ?T1_player_name . ?T1 :gender ?T1_gender . ?T2 :starting_year ?T2_starting_year . FILTER(?T2_starting_year > 2011) . }",SELECT ?T1_player_name ?T1_gender WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/player_coach> . ?T2 <http://valuenet/ontop/ref-player> ?T1 . ?T1 <http://valuenet/ontop/player_name> ?T1_player_name . ?T1 <http://valuenet/ontop/gender> ?T1_gender . ?T2 <http://valuenet/ontop/starting_year> ?T2_starting_year . FILTER(?T2_starting_year > 2011) . }
List the names of players that do not have coaches.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_player_name WHERE { ?T1 a :player . ?T1 :player_name ?T1_player_name . ?T1 :player_id ?T1_player_id . FILTER(?T1_player_id not in (?T22_player_id)) . {SELECT ?T22_player_id WHERE { ?T22 a :player_coach . ?T22 :player_id ?T22_player_id . } } }",SELECT ?T1_player_name WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/player_name> ?T1_player_name . ?T1 <http://valuenet/ontop/player_id> ?T1_player_id . FILTER(?T1_player_id not in (?T22_player_id)) . {SELECT ?T22_player_id WHERE { ?T22 a <http://valuenet/ontop/player_coach> . ?T22 <http://valuenet/ontop/player_id> ?T22_player_id . } } }
Show the residences that have both a player of gender 'M' and a player of gender 'F'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_residence WHERE { ?T1 a :player . ?T1 :residence ?T1_residence . ?T1 :gender ?T1_gender . FILTER(?T1_gender = 'M') . FILTER (?T1_residence in (?T2_residence)) . ?T2 a :player . ?T2 :residence ?T2_residence . ?T2 :gender ?T2_gender . FILTER(?T2_gender = 'F') . }",SELECT DISTINCT ?T1_residence WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/residence> ?T1_residence . ?T1 <http://valuenet/ontop/gender> ?T1_gender . FILTER(?T1_gender = 'M') . FILTER (?T1_residence in (?T2_residence)) . ?T2 a <http://valuenet/ontop/player> . ?T2 <http://valuenet/ontop/residence> ?T2_residence . ?T2 <http://valuenet/ontop/gender> ?T2_gender . FILTER(?T2_gender = 'F') . }
"How many coaches does each club has? List the club id, name and the number of coaches.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_club_id ?T1_club_name (count( *) as ?aggregation_all) WHERE { ?T1 a :club . ?T2 a :coach . ?T2 :ref-club ?T1 . ?T1 :club_id ?T1_club_id . ?T1 :club_name ?T1_club_name . } GROUP BY ?T1_club_id ?T1_club_name",SELECT ?T1_club_id ?T1_club_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/club> . ?T2 a <http://valuenet/ontop/coach> . ?T2 <http://valuenet/ontop/ref-club> ?T1 . ?T1 <http://valuenet/ontop/club_id> ?T1_club_id . ?T1 <http://valuenet/ontop/club_name> ?T1_club_name . } GROUP BY ?T1_club_id ?T1_club_name
