nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of schools.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :school . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/school> . }
List the locations of schools in ascending order of enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :school . ?T1 :location ?T1_location . ?T1 :enrollment ?T1_enrollment . } ORDER BY ASC (?T1_enrollment)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . } ORDER BY ASC (?T1_enrollment)
List the locations of schools in descending order of founded year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :school . ?T1 :location ?T1_location . ?T1 :founded ?T1_founded . } ORDER BY DESC (?T1_founded)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/founded> ?T1_founded . } ORDER BY DESC (?T1_founded)
List the enrollment for each school that does not have 'Catholic' as denomination.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_enrollment WHERE { ?T1 a :school . ?T1 :enrollment ?T1_enrollment . ?T1 :denomination ?T1_denomination . FILTER(?T1_denomination != 'Catholic') . }",SELECT ?T1_enrollment WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . ?T1 <http://valuenet/ontop/denomination> ?T1_denomination . FILTER(?T1_denomination != 'Catholic') . }
Take the average of the school enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_148 ) WHERE { ?T1 a :school . ?T1 :enrollment ?T1_enrollment . }",SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_148 ) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . }
Find the team of each player and sort them in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team WHERE { ?T1 a :player . ?T1 :team ?T1_team . ?T1 :team ?T1_team . } ORDER BY ASC (?T1_team)",SELECT ?T1_team WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/team> ?T1_team . ?T1 <http://valuenet/ontop/team> ?T1_team . } ORDER BY ASC (?T1_team)
Count the number of distinct player positions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_183 ) WHERE { ?T1 a :player . ?T1 :position ?T1_position . }",SELECT DISTINCT (count(DISTINCT ?T1_position) as ?aggregation_T1_position_183 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/position> ?T1_position . }
Find the team of the player of the highest age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team WHERE { ?T1 a :player . ?T1 :team ?T1_team . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1",SELECT ?T1_team WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/team> ?T1_team . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age) LIMIT 1
"For each player, show the team and the location of school they belong to.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team ?T2_location WHERE { ?T1 a :player . ?T2 a :school . ?T1 :ref-school ?T2 . ?T1 :team ?T1_team . ?T2 :location ?T2_location . }",SELECT ?T1_team ?T2_location WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/ref-school> ?T2 . ?T1 <http://valuenet/ontop/team> ?T1_team . ?T2 <http://valuenet/ontop/location> ?T2_location . }
Show the locations of schools that have more than 1 player.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :school . ?T2 a :player . ?T2 :ref-school ?T1 . ?T1 :location ?T1_location . } GROUP BY ?T1_location HAVING(count( *) > 1)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/player> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location HAVING(count( *) > 1)
Show the denomination of the school that has the most players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T2 a :player . ?T2 :ref-school ?T1 . ?T1 :denomination ?T1_denomination . } GROUP BY ?T1_denomination ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/player> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/denomination> ?T1_denomination . } GROUP BY ?T1_denomination ORDER BY DESC (?aggregation_all) LIMIT 1
Show locations and nicknames of schools.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location ?T2_nickname WHERE { ?T1 a :school . ?T2 a :school_details . ?T2 :ref-school ?T1 . ?T1 :location ?T1_location . ?T2 :nickname ?T2_nickname . }",SELECT ?T1_location ?T2_nickname WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/school_details> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T2 <http://valuenet/ontop/nickname> ?T2_nickname . }
Please show different denominations and the corresponding number of schools.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T1 :denomination ?T1_denomination . } GROUP BY ?T1_denomination",SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/denomination> ?T1_denomination . } GROUP BY ?T1_denomination
Please show different denominations and the corresponding number of schools in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T1 :denomination ?T1_denomination . } GROUP BY ?T1_denomination ORDER BY DESC (count( *) )",SELECT ?T1_denomination (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/denomination> ?T1_denomination . } GROUP BY ?T1_denomination ORDER BY DESC (count( *) )
List the school color of the school that has the largest enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_colors WHERE { ?T1 a :school . ?T1 :school_colors ?T1_school_colors . ?T1 :enrollment ?T1_enrollment . } ORDER BY DESC (?T1_enrollment) LIMIT 1",SELECT ?T1_school_colors WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/school_colors> ?T1_school_colors . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . } ORDER BY DESC (?T1_enrollment) LIMIT 1
List the locations of schools that do not have any player.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :school . ?T1 :location ?T1_location . ?T1 :school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) . {SELECT ?T22_school_id WHERE { ?T22 a :player . ?T22 :school_id ?T22_school_id . } } }",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/school_id> ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) . {SELECT ?T22_school_id WHERE { ?T22 a <http://valuenet/ontop/player> . ?T22 <http://valuenet/ontop/school_id> ?T22_school_id . } } }
Show the denomination shared by schools founded before 1890 and schools founded after 1900,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_denomination WHERE { ?T1 a :school . ?T1 :denomination ?T1_denomination . ?T1 :founded ?T1_founded . FILTER(?T1_founded < 1890) . FILTER (?T1_denomination in (?T2_denomination)) . ?T2 a :school . ?T2 :denomination ?T2_denomination . ?T2 :founded ?T2_founded . FILTER(?T2_founded > 1900) . }",SELECT DISTINCT ?T1_denomination WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/denomination> ?T1_denomination . ?T1 <http://valuenet/ontop/founded> ?T1_founded . FILTER(?T1_founded < 1890) . FILTER (?T1_denomination in (?T2_denomination)) . ?T2 a <http://valuenet/ontop/school> . ?T2 <http://valuenet/ontop/denomination> ?T2_denomination . ?T2 <http://valuenet/ontop/founded> ?T2_founded . FILTER(?T2_founded > 1900) . }
Show the nicknames of schools that are not in division 1.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nickname WHERE { ?T1 a :school_details . ?T1 :nickname ?T1_nickname . ?T1 :division ?T1_division . FILTER(?T1_division != 'Division 1') . }",SELECT ?T1_nickname WHERE { ?T1 a <http://valuenet/ontop/school_details> . ?T1 <http://valuenet/ontop/nickname> ?T1_nickname . ?T1 <http://valuenet/ontop/division> ?T1_division . FILTER(?T1_division != 'Division 1') . }
Show the denomination shared by more than one school.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_denomination WHERE { ?T1 a :school . ?T1 :denomination ?T1_denomination . } GROUP BY ?T1_denomination HAVING(count( *) > 1)",SELECT ?T1_denomination WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/denomination> ?T1_denomination . } GROUP BY ?T1_denomination HAVING(count( *) > 1)
