nl_question,sparql_partial_uri,sparql_complete_uri
"Show the name, home city, and age for all drivers.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_home_city ?T1_age WHERE { ?T1 a :driver . ?T1 :name ?T1_name . ?T1 :home_city ?T1_home_city . ?T1 :age ?T1_age . }",SELECT ?T1_name ?T1_home_city ?T1_age WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . ?T1 <http://valuenet/ontop/age> ?T1_age . }
Show the party and the number of drivers in each party.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a :driver . ?T1 :party ?T1_party . } GROUP BY ?T1_party",SELECT ?T1_party (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/party> ?T1_party . } GROUP BY ?T1_party
Show the name of drivers in descending order of age.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :driver . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age)
Show all different home cities.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_home_city WHERE { ?T1 a :driver . ?T1 :home_city ?T1_home_city . }",SELECT DISTINCT ?T1_home_city WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . }
Show the home city with the most number of drivers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_home_city (count( *) as ?aggregation_all) WHERE { ?T1 a :driver . ?T1 :home_city ?T1_home_city . } GROUP BY ?T1_home_city ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_home_city (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . } GROUP BY ?T1_home_city ORDER BY DESC (?aggregation_all) LIMIT 1
Show the party with drivers from Hartford and drivers older than 40.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_party WHERE { ?T1 a :driver . ?T1 :party ?T1_party . ?T1 :home_city ?T1_home_city . ?T1 :age ?T1_age . FILTER(?T1_home_city = 'Hartford' && ?T1_age > 40) . }",SELECT ?T1_party WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/party> ?T1_party . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_home_city = 'Hartford' && ?T1_age > 40) . }
Show home city where at least two drivers older than 40 are from.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_home_city WHERE { ?T1 a :driver . ?T1 :home_city ?T1_home_city . ?T1 :age ?T1_age . FILTER(?T1_age > 40) . } GROUP BY ?T1_home_city HAVING(count( *) >= 2)",SELECT ?T1_home_city WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age > 40) . } GROUP BY ?T1_home_city HAVING(count( *) >= 2)
Show all home cities except for those having a driver older than 40.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_home_city as ?col1) WHERE { ?T1 a :driver . ?T1 :home_city ?T1_home_city . }} MINUS {SELECT (?T2_home_city as ?col1) WHERE { ?T2 a :driver . ?T2 :home_city ?T2_home_city . ?T2 :age ?T2_age . FILTER(?T2_age > 40) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_home_city as ?col1) WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . }} MINUS {SELECT (?T2_home_city as ?col1) WHERE { ?T2 a <http://valuenet/ontop/driver> . ?T2 <http://valuenet/ontop/home_city> ?T2_home_city . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age > 40) . } } }
Show the names of the drivers without a school bus.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :driver . ?T1 :name ?T1_name . ?T1 :driver_id ?T1_driver_id . FILTER(?T1_driver_id not in (?T22_driver_id)) . {SELECT ?T22_driver_id WHERE { ?T22 a :school_bus . ?T22 :driver_id ?T22_driver_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/driver_id> ?T1_driver_id . FILTER(?T1_driver_id not in (?T22_driver_id)) . {SELECT ?T22_driver_id WHERE { ?T22 a <http://valuenet/ontop/school_bus> . ?T22 <http://valuenet/ontop/driver_id> ?T22_driver_id . } } }
Show the types of schools that have two schools.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type WHERE { ?T1 a :school . ?T1 :type ?T1_type . } GROUP BY ?T1_type HAVING(count( *) = 2)",SELECT ?T1_type WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type HAVING(count( *) = 2)
Show the school name and driver name for all school buses.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school ?T2_name WHERE { ?T1 a :school . ?T13 a :school_bus . ?T13 :ref-school ?T1 . ?T1 :school ?T1_school . ?T2 :name ?T2_name . ?T2 a :driver . ?T13 :ref-driver ?T2 . ?T1 :school ?T1_school . ?T2 :name ?T2_name . }",SELECT ?T1_school ?T2_name WHERE { ?T1 a <http://valuenet/ontop/school> . ?T13 a <http://valuenet/ontop/school_bus> . ?T13 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/school> ?T1_school . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/driver> . ?T13 <http://valuenet/ontop/ref-driver> ?T2 . ?T1 <http://valuenet/ontop/school> ?T1_school . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show the school name and type for schools without a school bus.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school ?T1_type WHERE { ?T1 a :school . ?T1 :school ?T1_school . ?T1 :type ?T1_type . ?T1 :school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) . {SELECT ?T22_school_id WHERE { ?T22 a :school_bus . ?T22 :school_id ?T22_school_id . } } }",SELECT ?T1_school ?T1_type WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/school> ?T1_school . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/school_id> ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) . {SELECT ?T22_school_id WHERE { ?T22 a <http://valuenet/ontop/school_bus> . ?T22 <http://valuenet/ontop/school_id> ?T22_school_id . } } }
Show the type of school and the number of buses for each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :school . ?T2 a :school_bus . ?T2 :ref-school ?T1 . ?T1 :type ?T1_type . } GROUP BY ?T1_type",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/school_bus> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type
List names for drivers from Hartford city and younger than 40.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :driver . ?T1 :name ?T1_name . ?T1 :home_city ?T1_home_city . ?T1 :age ?T1_age . FILTER(?T1_home_city = 'Hartford' && ?T1_age < 40) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/home_city> ?T1_home_city . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_home_city = 'Hartford' && ?T1_age < 40) . }
find the name of driver who is driving the school bus with the longest working history.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :driver . ?T2 a :school_bus . ?T2 :ref-driver ?T1 . ?T1 :name ?T1_name . ?T2 :years_working ?T2_years_working . } ORDER BY DESC (?T2_years_working) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/driver> . ?T2 a <http://valuenet/ontop/school_bus> . ?T2 <http://valuenet/ontop/ref-driver> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/years_working> ?T2_years_working . } ORDER BY DESC (?T2_years_working) LIMIT 1
