nl_question,sparql_partial_uri,sparql_complete_uri
Show all school names in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name WHERE { ?T1 a :school . ?T1 :school_name ?T1_school_name . ?T1 :school_name ?T1_school_name . } ORDER BY ASC (?T1_school_name)",SELECT ?T1_school_name WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . } ORDER BY ASC (?T1_school_name)
"List the name, location, mascot for all schools.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name ?T1_location ?T1_mascot WHERE { ?T1 a :school . ?T1 :school_name ?T1_school_name . ?T1 :location ?T1_location . ?T1 :mascot ?T1_mascot . }",SELECT ?T1_school_name ?T1_location ?T1_mascot WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T1 <http://valuenet/ontop/location> ?T1_location . ?T1 <http://valuenet/ontop/mascot> ?T1_mascot . }
List the name of the school with the smallest enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name WHERE { ?T1 a :school . ?T1 :school_name ?T1_school_name . ?T1 :enrollment ?T1_enrollment . } ORDER BY ASC (?T1_enrollment) LIMIT 1",SELECT ?T1_school_name WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . } ORDER BY ASC (?T1_enrollment) LIMIT 1
"Show the average, maximum, minimum enrollment of all schools.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_188 ) (max( ?T1_enrollment) as ?aggregation_T1_enrollment_66 ) (min( ?T1_enrollment) as ?aggregation_T1_enrollment_144 ) WHERE { ?T1 a :school . ?T1 :enrollment ?T1_enrollment . ?T1 :enrollment ?T1_enrollment . ?T1 :enrollment ?T1_enrollment . }",SELECT (avg( ?T1_enrollment) as ?aggregation_T1_enrollment_188 ) (max( ?T1_enrollment) as ?aggregation_T1_enrollment_66 ) (min( ?T1_enrollment) as ?aggregation_T1_enrollment_144 ) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . }
Show each county along with the number of schools and total enrollment in each county.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_county (count( *) as ?aggregation_all) (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_93 ) WHERE { ?T1 a :school . ?T1 :county ?T1_county . ?T1 :enrollment ?T1_enrollment . } GROUP BY ?T1_county",SELECT ?T1_county (count( *) as ?aggregation_all) (sum( ?T1_enrollment) as ?aggregation_T1_enrollment_93 ) WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/county> ?T1_county . ?T1 <http://valuenet/ontop/enrollment> ?T1_enrollment . } GROUP BY ?T1_county
List each donator name and the amount of endowment in descending order of the amount of endowment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_donator_name (sum( ?T1_amount) as ?aggregation_T1_amount_155 ) WHERE { ?T1 a :endowment . ?T1 :donator_name ?T1_donator_name . ?T1 :amount ?T1_amount . ?T1 :amount ?T1_amount . } GROUP BY ?T1_donator_name ORDER BY DESC (sum( ?T1_amount))",SELECT ?T1_donator_name (sum( ?T1_amount) as ?aggregation_T1_amount_155 ) WHERE { ?T1 a <http://valuenet/ontop/endowment> . ?T1 <http://valuenet/ontop/donator_name> ?T1_donator_name . ?T1 <http://valuenet/ontop/amount> ?T1_amount . ?T1 <http://valuenet/ontop/amount> ?T1_amount . } GROUP BY ?T1_donator_name ORDER BY DESC (sum( ?T1_amount))
List the names of the schools without any endowment.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name WHERE { ?T1 a :school . ?T1 :school_name ?T1_school_name . ?T1 :school_id ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) . {SELECT ?T22_school_id WHERE { ?T22 a :endowment . ?T22 :school_id ?T22_school_id . } } }",SELECT ?T1_school_name WHERE { ?T1 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T1 <http://valuenet/ontop/school_id> ?T1_school_id . FILTER(?T1_school_id not in (?T22_school_id)) . {SELECT ?T22_school_id WHERE { ?T22 a <http://valuenet/ontop/endowment> . ?T22 <http://valuenet/ontop/school_id> ?T22_school_id . } } }
List all the names of schools with an endowment amount smaller than or equal to 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name WHERE { ?T1 a :school . ?T2 a :endowment . ?T2 :ref-school ?T1 . ?T1 :school_name ?T1_school_name . ?T2 :amount ?T2_amount . } GROUP BY ?T1_school_name HAVING(sum( ?T2_amount) <= 10)",SELECT ?T1_school_name WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/endowment> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T2 <http://valuenet/ontop/amount> ?T2_amount . } GROUP BY ?T1_school_name HAVING(sum( ?T2_amount) <= 10)
Show the names of donors who donated to both school 'Glenn' and 'Triton.',"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_donator_name WHERE { ?T1 a :endowment . ?T2 a :school . ?T1 :ref-school ?T2 . ?T1 :donator_name ?T1_donator_name . ?T2 :school_name ?T2_school_name . FILTER(?T2_school_name = 'Glenn') . FILTER (?T1_donator_name in (?T3_donator_name)) . ?T3 a :endowment . ?T4 a :school . ?T3 :ref-school ?T4 . ?T3 :donator_name ?T3_donator_name . ?T4 :school_name ?T4_school_name . FILTER(?T4_school_name = 'Triton') . }",SELECT DISTINCT ?T1_donator_name WHERE { ?T1 a <http://valuenet/ontop/endowment> . ?T2 a <http://valuenet/ontop/school> . ?T1 <http://valuenet/ontop/ref-school> ?T2 . ?T1 <http://valuenet/ontop/donator_name> ?T1_donator_name . ?T2 <http://valuenet/ontop/school_name> ?T2_school_name . FILTER(?T2_school_name = 'Glenn') . FILTER (?T1_donator_name in (?T3_donator_name)) . ?T3 a <http://valuenet/ontop/endowment> . ?T4 a <http://valuenet/ontop/school> . ?T3 <http://valuenet/ontop/ref-school> ?T4 . ?T3 <http://valuenet/ontop/donator_name> ?T3_donator_name . ?T4 <http://valuenet/ontop/school_name> ?T4_school_name . FILTER(?T4_school_name = 'Triton') . }
Show the names of all the donors except those whose donation amount less than 9.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_donator_name as ?col1) WHERE { ?T1 a :endowment . ?T1 :donator_name ?T1_donator_name . }} MINUS {SELECT (?T2_donator_name as ?col1) WHERE { ?T2 a :endowment . ?T2 :donator_name ?T2_donator_name . ?T2 :amount ?T2_amount . FILTER(?T2_amount < 9) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_donator_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/endowment> . ?T1 <http://valuenet/ontop/donator_name> ?T1_donator_name . }} MINUS {SELECT (?T2_donator_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/endowment> . ?T2 <http://valuenet/ontop/donator_name> ?T2_donator_name . ?T2 <http://valuenet/ontop/amount> ?T2_amount . FILTER(?T2_amount < 9) . } } }
List the amount and donor name for the largest amount of donation.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_amount ?T1_donator_name WHERE { ?T1 a :endowment . ?T1 :amount ?T1_amount . ?T1 :donator_name ?T1_donator_name . ?T1 :amount ?T1_amount . } ORDER BY DESC (?T1_amount) LIMIT 1",SELECT ?T1_amount ?T1_donator_name WHERE { ?T1 a <http://valuenet/ontop/endowment> . ?T1 <http://valuenet/ontop/amount> ?T1_amount . ?T1 <http://valuenet/ontop/donator_name> ?T1_donator_name . ?T1 <http://valuenet/ontop/amount> ?T1_amount . } ORDER BY DESC (?T1_amount) LIMIT 1
Count the number of budgets in year 2001 or before whose budgeted amount is greater than 3000,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :budget . ?T1 :budgeted ?T1_budgeted . ?T1 :year ?T1_year . FILTER(?T1_budgeted > 3000 && ?T1_year <= 2001) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/budget> . ?T1 <http://valuenet/ontop/budgeted> ?T1_budgeted . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_budgeted > 3000 && ?T1_year <= 2001) . }
"Show each school name, its budgeted amount, and invested amount in year 2002 or after.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name ?T2_budgeted ?T2_invested WHERE { ?T1 a :school . ?T2 a :budget . ?T2 :ref-school ?T1 . ?T1 :school_name ?T1_school_name . ?T2 :budgeted ?T2_budgeted . ?T2 :invested ?T2_invested . ?T2 :year ?T2_year . FILTER(?T2_year >= 2002) . }",SELECT ?T1_school_name ?T2_budgeted ?T2_invested WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/budget> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T2 <http://valuenet/ontop/budgeted> ?T2_budgeted . ?T2 <http://valuenet/ontop/invested> ?T2_invested . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year >= 2002) . }
Show all donor names.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_donator_name WHERE { ?T1 a :endowment . ?T1 :donator_name ?T1_donator_name . }",SELECT DISTINCT ?T1_donator_name WHERE { ?T1 a <http://valuenet/ontop/endowment> . ?T1 <http://valuenet/ontop/donator_name> ?T1_donator_name . }
Find the number of schools that have more than one donator whose donation amount is less than 8.5.,"PREFIX : <http://valuenet/ontop/>
SELECT (count (*) as ?agg) WHERE {SELECT * WHERE {?t1 a :endowment . ?t1 :amount ?t1_amount . ?t1 :endowment_id ?t1_endowment_id . ?t1 :school_id ?t1_school_id. FILTER (?t1_amount > 8.5) }} GROUP BY ?t1_endowment_id ?t1_school_id HAVING (?agg >1)",SELECT (count (*) as ?agg) WHERE {SELECT * WHERE {?t1 a <http://valuenet/ontop/endowment> . ?t1 <http://valuenet/ontop/amount> ?t1_amount . ?t1 <http://valuenet/ontop/endowment_id> ?t1_endowment_id . ?t1 <http://valuenet/ontop/school_id> ?t1_school_id. FILTER (?t1_amount > 8.5) }} GROUP BY ?t1_endowment_id ?t1_school_id HAVING (?agg >1)
"List the name, IHSAA Football Class, and Mascot of the schools that have more than 6000 of budgeted amount or were founded before 2003, in the order of percent of total invested budget and total budgeted budget.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_school_name ?T1_mascot ?T1_ihsaa_football_class WHERE { ?T1 a :school . ?T2 a :budget . ?T2 :ref-school ?T1 . ?T1 :school_name ?T1_school_name . ?T1 :mascot ?T1_mascot . ?T1 :ihsaa_football_class ?T1_ihsaa_football_class . ?T2 :total_budget_percent_invested ?T2_total_budget_percent_invested . ?T2 :budgeted ?T2_budgeted . ?T2 :year ?T2_year . FILTER(?T2_budgeted > 6000 || ?T2_year < 2003) . } ORDER BY ASC (?T2_total_budget_percent_invested)",SELECT ?T1_school_name ?T1_mascot ?T1_ihsaa_football_class WHERE { ?T1 a <http://valuenet/ontop/school> . ?T2 a <http://valuenet/ontop/budget> . ?T2 <http://valuenet/ontop/ref-school> ?T1 . ?T1 <http://valuenet/ontop/school_name> ?T1_school_name . ?T1 <http://valuenet/ontop/mascot> ?T1_mascot . ?T1 <http://valuenet/ontop/ihsaa_football_class> ?T1_ihsaa_football_class . ?T2 <http://valuenet/ontop/total_budget_percent_invested> ?T2_total_budget_percent_invested . ?T2 <http://valuenet/ontop/budgeted> ?T2_budgeted . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_budgeted > 6000 || ?T2_year < 2003) . } ORDER BY ASC (?T2_total_budget_percent_invested)
