nl_question,sparql_partial_uri,sparql_complete_uri
Find the total number of scientists.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :scientists . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/scientists> . }
Find the total hours of all projects.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_174 ) WHERE { ?T1 a :projects . ?T1 :hours ?T1_hours . }",SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_174 ) WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/hours> ?T1_hours . }
Count the number of different scientists assigned to any project.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_scientist) as ?aggregation_T1_scientist_155 ) WHERE { ?T1 a :assignedto . ?T1 :scientist ?T1_scientist . }",SELECT DISTINCT (count(DISTINCT ?T1_scientist) as ?aggregation_T1_scientist_155 ) WHERE { ?T1 a <http://valuenet/ontop/assignedto> . ?T1 <http://valuenet/ontop/scientist> ?T1_scientist . }
Find the number of distinct projects.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_136 ) WHERE { ?T1 a :projects . ?T1 :name ?T1_name . }",SELECT DISTINCT (count(DISTINCT ?T1_name) as ?aggregation_T1_name_136 ) WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
Find the average hours of all projects.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_hours) as ?aggregation_T1_hours_100 ) WHERE { ?T1 a :projects . ?T1 :hours ?T1_hours . }",SELECT (avg( ?T1_hours) as ?aggregation_T1_hours_100 ) WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/hours> ?T1_hours . }
Find the name of project that continues for the longest time.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :name ?T1_name . ?T1 :hours ?T1_hours . } ORDER BY DESC (?T1_hours) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hours> ?T1_hours . } ORDER BY DESC (?T1_hours) LIMIT 1
List the name of all projects that are operated longer than the average working hours of all projects.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :name ?T1_name . ?T1 :hours ?T1_hours . FILTER(?T1_hours > (?aggregation_T22_hours_22)) . {SELECT (avg( ?T22_hours) as ?aggregation_T22_hours_22 ) WHERE { ?T22 a :projects . ?T22 :hours ?T22_hours . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hours> ?T1_hours . FILTER(?T1_hours > (?aggregation_T22_hours_22)) . {SELECT (avg( ?T22_hours) as ?aggregation_T22_hours_22 ) WHERE { ?T22 a <http://valuenet/ontop/projects> . ?T22 <http://valuenet/ontop/hours> ?T22_hours . } } }
Find the name and hours of project that has the most number of scientists.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_hours WHERE { ?T1 a :projects . ?T2 a :assignedto . ?T2 :ref-project ?T1 . ?T1 :name ?T1_name . ?T1 :hours ?T1_hours . } GROUP BY ?T1_name ?T1_hours ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_hours WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T2 a <http://valuenet/ontop/assignedto> . ?T2 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hours> ?T1_hours . } GROUP BY ?T1_name ?T1_hours ORDER BY DESC (?aggregation_all) LIMIT 1
Find the name of the project for which a scientist whose name contains ‘Smith’ is assigned to.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :projects . ?T13 a :assignedto . ?T13 :ref-project ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :scientists . ?T13 :ref-scientist ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(contains (?T2_name, 'Smith')) . }","SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T13 a <http://valuenet/ontop/assignedto> . ?T13 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/scientists> . ?T13 <http://valuenet/ontop/ref-scientist> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(contains (?T2_name, 'Smith')) . }"
Find the total hours of the projects that scientists named Michael Rogers or Carol Smith are assigned to.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_141 ) WHERE { ?T1 a :projects . ?T13 a :assignedto . ?T13 :ref-project ?T1 . ?T1 :hours ?T1_hours . ?T2 :name ?T2_name . ?T2 :name ?T2_name . ?T2 a :scientists . ?T13 :ref-scientist ?T2 . ?T1 :hours ?T1_hours . ?T2 :name ?T2_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Michael Rogers' || ?T2_name = 'Carol Smith') . }",SELECT (sum( ?T1_hours) as ?aggregation_T1_hours_141 ) WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T13 a <http://valuenet/ontop/assignedto> . ?T13 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/hours> ?T1_hours . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/scientists> . ?T13 <http://valuenet/ontop/ref-scientist> ?T2 . ?T1 <http://valuenet/ontop/hours> ?T1_hours . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Michael Rogers' || ?T2_name = 'Carol Smith') . }
Find the name of projects that require between 100 and 300 hours of work.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :name ?T1_name . ?T1 :hours ?T1_hours . FILTER(?T1_hours >= 100 && ?T1_hours <= 300) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hours> ?T1_hours . FILTER(?T1_hours >= 100 && ?T1_hours <= 300) . }
Find the name of the scientist who worked on both a project named 'Matter of Time' and a project named 'A Puzzling Parallax'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :scientists . ?T13 a :assignedto . ?T13 :ref-scientist ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 a :projects . ?T13 :ref-project ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Matter of Time') . FILTER (?T1_name in (?T3_name)) . ?T3 a :scientists . ?T15 a :assignedto . ?T15 :ref-scientist ?T3 . ?T3 :name ?T3_name . ?T4 :name ?T4_name . ?T4 a :projects . ?T15 :ref-project ?T4 . ?T3 :name ?T3_name . ?T4 :name ?T4_name . FILTER(?T4_name = 'A Puzzling Parallax') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/scientists> . ?T13 a <http://valuenet/ontop/assignedto> . ?T13 <http://valuenet/ontop/ref-scientist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/projects> . ?T13 <http://valuenet/ontop/ref-project> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Matter of Time') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/scientists> . ?T15 a <http://valuenet/ontop/assignedto> . ?T15 <http://valuenet/ontop/ref-scientist> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/name> ?T4_name . ?T4 a <http://valuenet/ontop/projects> . ?T15 <http://valuenet/ontop/ref-project> ?T4 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/name> ?T4_name . FILTER(?T4_name = 'A Puzzling Parallax') . }
List the names of all scientists sorted in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/scientists> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Find the number of scientists involved for each project name.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :assignedto . ?T2 a :projects . ?T1 :ref-project ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/assignedto> . ?T2 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/ref-project> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Find the number of scientists involved for the projects that require more than 300 hours.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :assignedto . ?T2 a :projects . ?T1 :ref-project ?T2 . ?T2 :name ?T2_name . ?T2 :hours ?T2_hours . FILTER(?T2_hours > 300) . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/assignedto> . ?T2 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/ref-project> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/hours> ?T2_hours . FILTER(?T2_hours > 300) . } GROUP BY ?T2_name
Find the number of projects which each scientist is working on and scientist's name.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :assignedto . ?T2 a :scientists . ?T1 :ref-scientist ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/assignedto> . ?T2 a <http://valuenet/ontop/scientists> . ?T1 <http://valuenet/ontop/ref-scientist> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Find the SSN and name of scientists who are assigned to the project with the longest hours.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_ssn ?T1_name WHERE { ?T1 a :scientists . ?T13 a :assignedto . ?T13 :ref-scientist ?T1 . ?T1 :ssn ?T1_ssn . ?T1 :name ?T1_name . ?T2 :hours ?T2_hours . ?T2 a :projects . ?T13 :ref-project ?T2 . ?T1 :ssn ?T1_ssn . ?T1 :name ?T1_name . ?T2 :hours ?T2_hours . FILTER(?T2_hours = (?aggregation_T23_hours_93)) . {SELECT (max( ?T23_hours) as ?aggregation_T23_hours_93 ) WHERE { ?T23 a :projects . ?T23 :hours ?T23_hours . } } }",SELECT ?T1_ssn ?T1_name WHERE { ?T1 a <http://valuenet/ontop/scientists> . ?T13 a <http://valuenet/ontop/assignedto> . ?T13 <http://valuenet/ontop/ref-scientist> ?T1 . ?T1 <http://valuenet/ontop/ssn> ?T1_ssn . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/hours> ?T2_hours . ?T2 a <http://valuenet/ontop/projects> . ?T13 <http://valuenet/ontop/ref-project> ?T2 . ?T1 <http://valuenet/ontop/ssn> ?T1_ssn . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/hours> ?T2_hours . FILTER(?T2_hours = (?aggregation_T23_hours_93)) . {SELECT (max( ?T23_hours) as ?aggregation_T23_hours_93 ) WHERE { ?T23 a <http://valuenet/ontop/projects> . ?T23 <http://valuenet/ontop/hours> ?T23_hours . } } }
Find the name of scientists who are assigned to some project.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :name ?T1_name . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/scientists> . ?T1 <http://valuenet/ontop/name> ?T1_name . }
Select the project names which are not assigned yet.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :projects . ?T1 :name ?T1_name . ?T1 :code ?T1_code . FILTER(?T1_code not in (?T22_project)) . {SELECT ?T22_project WHERE { ?T22 a :assignedto . ?T22 :project ?T22_project . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/code> ?T1_code . FILTER(?T1_code not in (?T22_project)) . {SELECT ?T22_project WHERE { ?T22 a <http://valuenet/ontop/assignedto> . ?T22 <http://valuenet/ontop/project> ?T22_project . } } }
Find the name of scientists who are not assigned to any project.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :scientists . ?T1 :name ?T1_name . ?T1 :ssn ?T1_ssn . FILTER(?T1_ssn not in (?T22_scientist)) . {SELECT ?T22_scientist WHERE { ?T22 a :assignedto . ?T22 :scientist ?T22_scientist . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/scientists> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/ssn> ?T1_ssn . FILTER(?T1_ssn not in (?T22_scientist)) . {SELECT ?T22_scientist WHERE { ?T22 a <http://valuenet/ontop/assignedto> . ?T22 <http://valuenet/ontop/scientist> ?T22_scientist . } } }
"List all the scientists' names, their projects' names, and the hours worked by that scientist on each project, in alphabetical order of project name, and then scientist name.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name ?T2_hours WHERE { ?T1 a :scientists . ?T13 a :assignedto . ?T13 :ref-scientist ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 :hours ?T2_hours . ?T2 :name ?T2_name . ?T2 a :projects . ?T13 :ref-project ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T2 :hours ?T2_hours . ?T2 :name ?T2_name . } ORDER BY ASC (?T2_name)",SELECT ?T1_name ?T2_name ?T2_hours WHERE { ?T1 a <http://valuenet/ontop/scientists> . ?T13 a <http://valuenet/ontop/assignedto> . ?T13 <http://valuenet/ontop/ref-scientist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/hours> ?T2_hours . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 a <http://valuenet/ontop/projects> . ?T13 <http://valuenet/ontop/ref-project> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/hours> ?T2_hours . ?T2 <http://valuenet/ontop/name> ?T2_name . } ORDER BY ASC (?T2_name)
Find name of the project that needs the least amount of time to finish and the name of scientists who worked on it.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :projects . ?T13 a :assignedto . ?T13 :ref-project ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T1 :hours ?T1_hours . ?T2 a :scientists . ?T13 :ref-scientist ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T1 :hours ?T1_hours . FILTER(?T1_hours = (?aggregation_T23_hours_0)) . {SELECT (min( ?T23_hours) as ?aggregation_T23_hours_0 ) WHERE { ?T23 a :projects . ?T23 :hours ?T23_hours . } } }",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T13 a <http://valuenet/ontop/assignedto> . ?T13 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T1 <http://valuenet/ontop/hours> ?T1_hours . ?T2 a <http://valuenet/ontop/scientists> . ?T13 <http://valuenet/ontop/ref-scientist> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T1 <http://valuenet/ontop/hours> ?T1_hours . FILTER(?T1_hours = (?aggregation_T23_hours_0)) . {SELECT (min( ?T23_hours) as ?aggregation_T23_hours_0 ) WHERE { ?T23 a <http://valuenet/ontop/projects> . ?T23 <http://valuenet/ontop/hours> ?T23_hours . } } }
