nl_question,sparql_partial_uri,sparql_complete_uri
List the name of ships in ascending order of tonnage.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :tonnage ?T1_tonnage . } ORDER BY ASC (?T1_tonnage)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/tonnage> ?T1_tonnage . } ORDER BY ASC (?T1_tonnage)
List the name of ships whose nationality is not 'United States'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :nationality ?T1_nationality . FILTER(?T1_nationality != 'United States') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . FILTER(?T1_nationality != 'United States') . }
Show the name of ships whose nationality is either United States or United Kingdom.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :nationality ?T1_nationality . ?T1 :nationality ?T1_nationality . FILTER(?T1_nationality = 'United States' || ?T1_nationality = 'United Kingdom') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . FILTER(?T1_nationality = 'United States' || ?T1_nationality = 'United Kingdom') . }
Show different types of ships and the number of ships of each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :type ?T1_type . } GROUP BY ?T1_type",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type
Please show the most common type of ships.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :type ?T1_type . } GROUP BY ?T1_type ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type ORDER BY DESC (?aggregation_all) LIMIT 1
List the nations that have more than two ships.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nationality WHERE { ?T1 a :ship . ?T1 :nationality ?T1_nationality . } GROUP BY ?T1_nationality HAVING(count( *) > 2)",SELECT ?T1_nationality WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . } GROUP BY ?T1_nationality HAVING(count( *) > 2)
Show different types of ships and the average tonnage of ships of each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (avg( ?T1_tonnage) as ?aggregation_T1_tonnage_77 ) WHERE { ?T1 a :ship . ?T1 :type ?T1_type . ?T1 :tonnage ?T1_tonnage . } GROUP BY ?T1_type",SELECT ?T1_type (avg( ?T1_tonnage) as ?aggregation_T1_tonnage_77 ) WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/tonnage> ?T1_tonnage . } GROUP BY ?T1_type
"Show codes and fates of missions, and names of ships involved.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_code ?T1_fate ?T2_name WHERE { ?T1 a :mission . ?T2 a :ship . ?T1 :ref-ship ?T2 . ?T1 :code ?T1_code . ?T1 :fate ?T1_fate . ?T2 :name ?T2_name . }",SELECT ?T1_code ?T1_fate ?T2_name WHERE { ?T1 a <http://valuenet/ontop/mission> . ?T2 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/ref-ship> ?T2 . ?T1 <http://valuenet/ontop/code> ?T1_code . ?T1 <http://valuenet/ontop/fate> ?T1_fate . ?T2 <http://valuenet/ontop/name> ?T2_name . }
Show names of ships involved in a mission launched after 1928.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :mission . ?T2 :ref-ship ?T1 . ?T1 :name ?T1_name . ?T2 :launched_year ?T2_launched_year . FILTER(?T2_launched_year > 1928) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T2 a <http://valuenet/ontop/mission> . ?T2 <http://valuenet/ontop/ref-ship> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/launched_year> ?T2_launched_year . FILTER(?T2_launched_year > 1928) . }
Show the distinct fate of missions that involve ships with nationality 'United States',"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_fate WHERE { ?T1 a :mission . ?T2 a :ship . ?T1 :ref-ship ?T2 . ?T1 :fate ?T1_fate . ?T2 :nationality ?T2_nationality . FILTER(?T2_nationality = 'United States') . }",SELECT DISTINCT ?T1_fate WHERE { ?T1 a <http://valuenet/ontop/mission> . ?T2 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/ref-ship> ?T2 . ?T1 <http://valuenet/ontop/fate> ?T1_fate . ?T2 <http://valuenet/ontop/nationality> ?T2_nationality . FILTER(?T2_nationality = 'United States') . }
List the name of ships that are not involved in any mission,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :ship_id ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_ship_id)) . {SELECT ?T22_ship_id WHERE { ?T22 a :mission . ?T22 :ship_id ?T22_ship_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/ship_id> ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_ship_id)) . {SELECT ?T22_ship_id WHERE { ?T22 a <http://valuenet/ontop/mission> . ?T22 <http://valuenet/ontop/ship_id> ?T22_ship_id . } } }
Show the types of ships that have both ships with tonnage larger than 6000 and ships with tonnage smaller than 4000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_type WHERE { ?T1 a :ship . ?T1 :type ?T1_type . ?T1 :tonnage ?T1_tonnage . FILTER(?T1_tonnage > 6000) . FILTER (?T1_type in (?T2_type)) . ?T2 a :ship . ?T2 :type ?T2_type . ?T2 :tonnage ?T2_tonnage . FILTER(?T2_tonnage < 4000) . }",SELECT DISTINCT ?T1_type WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/tonnage> ?T1_tonnage . FILTER(?T1_tonnage > 6000) . FILTER (?T1_type in (?T2_type)) . ?T2 a <http://valuenet/ontop/ship> . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T2 <http://valuenet/ontop/tonnage> ?T2_tonnage . FILTER(?T2_tonnage < 4000) . }
