nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of different ranks of captain.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_rank) as ?aggregation_T1_rank_145 ) WHERE { ?T1 a :captain . ?T1 :rank ?T1_rank . }",SELECT DISTINCT (count(DISTINCT ?T1_rank) as ?aggregation_T1_rank_145 ) WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . }
Count the number of captains that have each rank.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_rank WHERE { ?T1 a :captain . ?T1 :rank ?T1_rank . } GROUP BY ?T1_rank",SELECT (count( *) as ?aggregation_all) ?T1_rank WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . } GROUP BY ?T1_rank
Count the number of captains younger than 50 of each rank.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_rank WHERE { ?T1 a :captain . ?T1 :rank ?T1_rank . ?T1 :age ?T1_age . FILTER(?T1_age < 50) . } GROUP BY ?T1_rank",SELECT (count( *) as ?aggregation_all) ?T1_rank WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age < 50) . } GROUP BY ?T1_rank
Sort all captain names by their ages from old to young.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :captain . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY DESC (?T1_age)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY DESC (?T1_age)
"Find the name, class and rank of all captains.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_class ?T1_rank WHERE { ?T1 a :captain . ?T1 :name ?T1_name . ?T1 :class ?T1_class . ?T1 :rank ?T1_rank . }",SELECT ?T1_name ?T1_class ?T1_rank WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/class> ?T1_class . ?T1 <http://valuenet/ontop/rank> ?T1_rank . }
Return the rank for which there are the fewest captains.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a :captain . ?T1 :rank ?T1_rank . } GROUP BY ?T1_rank ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_rank (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . } GROUP BY ?T1_rank ORDER BY DESC (?aggregation_all) LIMIT 1
Give the classes that have more than two captains.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_class WHERE { ?T1 a :captain . ?T1 :class ?T1_class . } GROUP BY ?T1_class HAVING(count( *) > 2)",SELECT ?T1_class WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/class> ?T1_class . } GROUP BY ?T1_class HAVING(count( *) > 2)
Find the name of captains whose rank are either Midshipman or Lieutenant.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :captain . ?T1 :name ?T1_name . ?T1 :rank ?T1_rank . ?T1 :rank ?T1_rank . FILTER(?T1_rank = 'Midshipman' || ?T1_rank = 'Lieutenant') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/rank> ?T1_rank . FILTER(?T1_rank = 'Midshipman' || ?T1_rank = 'Lieutenant') . }
Return the average and minimum age of captains in each class.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_168 ) (min( ?T1_age) as ?aggregation_T1_age_165 ) ?T1_class WHERE { ?T1 a :captain . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :class ?T1_class . } GROUP BY ?T1_class",SELECT (avg( ?T1_age) as ?aggregation_T1_age_168 ) (min( ?T1_age) as ?aggregation_T1_age_165 ) ?T1_class WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/class> ?T1_class . } GROUP BY ?T1_class
Find the captain rank that has some captains in both Cutter and Armed schooner classes.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_rank WHERE { ?T1 a :captain . ?T1 :rank ?T1_rank . ?T1 :class ?T1_class . FILTER(?T1_class = 'Cutter') . FILTER (?T1_rank in (?T2_rank)) . ?T2 a :captain . ?T2 :rank ?T2_rank . ?T2 :class ?T2_class . FILTER(?T2_class = 'Armed schooner') . }",SELECT DISTINCT ?T1_rank WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . ?T1 <http://valuenet/ontop/class> ?T1_class . FILTER(?T1_class = 'Cutter') . FILTER (?T1_rank in (?T2_rank)) . ?T2 a <http://valuenet/ontop/captain> . ?T2 <http://valuenet/ontop/rank> ?T2_rank . ?T2 <http://valuenet/ontop/class> ?T2_class . FILTER(?T2_class = 'Armed schooner') . }
Find the captain rank that has no captain in Third-rate ship of the line class.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_rank as ?col1) WHERE { ?T1 a :captain . ?T1 :rank ?T1_rank . }} MINUS {SELECT (?T2_rank as ?col1) WHERE { ?T2 a :captain . ?T2 :rank ?T2_rank . ?T2 :class ?T2_class . FILTER(?T2_class = 'Third-rate ship of the line') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_rank as ?col1) WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/rank> ?T1_rank . }} MINUS {SELECT (?T2_rank as ?col1) WHERE { ?T2 a <http://valuenet/ontop/captain> . ?T2 <http://valuenet/ontop/rank> ?T2_rank . ?T2 <http://valuenet/ontop/class> ?T2_class . FILTER(?T2_class = 'Third-rate ship of the line') . } } }
Return the name of the youngest captain.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :captain . ?T1 :name ?T1_name . ?T1 :age ?T1_age . } ORDER BY ASC (?T1_age) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/captain> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . } ORDER BY ASC (?T1_age) LIMIT 1
Count the number of ships.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ship> . }
"Find the name, type, and flag of the ship that is built in the most recent year.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_type ?T1_flag WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :type ?T1_type . ?T1 :flag ?T1_flag . ?T1 :built_year ?T1_built_year . } ORDER BY DESC (?T1_built_year) LIMIT 1",SELECT ?T1_name ?T1_type ?T1_flag WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/flag> ?T1_flag . ?T1 <http://valuenet/ontop/built_year> ?T1_built_year . } ORDER BY DESC (?T1_built_year) LIMIT 1
"Group by ships by flag, and return number of ships that have each flag.","PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_flag WHERE { ?T1 a :ship . ?T1 :flag ?T1_flag . } GROUP BY ?T1_flag",SELECT (count( *) as ?aggregation_all) ?T1_flag WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/flag> ?T1_flag . } GROUP BY ?T1_flag
Return the flag that is most common among all ships.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_flag (count( *) as ?aggregation_all) WHERE { ?T1 a :ship . ?T1 :flag ?T1_flag . } GROUP BY ?T1_flag ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_flag (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/flag> ?T1_flag . } GROUP BY ?T1_flag ORDER BY DESC (?aggregation_all) LIMIT 1
List all ship names in the order of built year and class.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :built_year ?T1_built_year . } ORDER BY ASC (?T1_built_year)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/built_year> ?T1_built_year . } ORDER BY ASC (?T1_built_year)
Find the ship type that are used by both ships with Panama and Malta flags.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_type WHERE { ?T1 a :ship . ?T1 :type ?T1_type . ?T1 :flag ?T1_flag . FILTER(?T1_flag = 'Panama') . FILTER (?T1_type in (?T2_type)) . ?T2 a :ship . ?T2 :type ?T2_type . ?T2 :flag ?T2_flag . FILTER(?T2_flag = 'Malta') . }",SELECT DISTINCT ?T1_type WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/type> ?T1_type . ?T1 <http://valuenet/ontop/flag> ?T1_flag . FILTER(?T1_flag = 'Panama') . FILTER (?T1_type in (?T2_type)) . ?T2 a <http://valuenet/ontop/ship> . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T2 <http://valuenet/ontop/flag> ?T2_flag . FILTER(?T2_flag = 'Malta') . }
Find the name of the ships that have more than one captain.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :ref-ship ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T2 a <http://valuenet/ontop/captain> . ?T2 <http://valuenet/ontop/ref-ship> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)
Find the name of the ship that is steered by the youngest captain.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :ref-ship ?T1 . ?T1 :name ?T1_name . ?T2 :age ?T2_age . } ORDER BY ASC (?T2_age) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T2 a <http://valuenet/ontop/captain> . ?T2 <http://valuenet/ontop/ref-ship> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/age> ?T2_age . } ORDER BY ASC (?T2_age) LIMIT 1
Find the name and flag of ships that are not steered by any captain with Midshipman rank.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_flag WHERE { ?T1 a :ship . ?T1 :name ?T1_name . ?T1 :flag ?T1_flag . ?T1 :ship_id ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_rank)) . {SELECT ?T22_ship_id WHERE { ?T22 a :captain . ?T22 :ship_id ?T22_ship_id . ?T22 :rank ?T22_rank . FILTER(?T22_rank = 'Midshipman') . } } }",SELECT ?T1_name ?T1_flag WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/flag> ?T1_flag . ?T1 <http://valuenet/ontop/ship_id> ?T1_ship_id . FILTER(?T1_ship_id not in (?T22_rank)) . {SELECT ?T22_ship_id WHERE { ?T22 a <http://valuenet/ontop/captain> . ?T22 <http://valuenet/ontop/ship_id> ?T22_ship_id . ?T22 <http://valuenet/ontop/rank> ?T22_rank . FILTER(?T22_rank = 'Midshipman') . } } }
Find the name of the ships that are steered by both a captain with Midshipman rank and a captain with Lieutenant rank.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :ship . ?T2 a :captain . ?T2 :ref-ship ?T1 . ?T1 :name ?T1_name . ?T2 :rank ?T2_rank . FILTER(?T2_rank = 'Midshipman') . FILTER (?T1_name in (?T3_name)) . ?T3 a :ship . ?T4 a :captain . ?T4 :ref-ship ?T3 . ?T3 :name ?T3_name . ?T4 :rank ?T4_rank . FILTER(?T4_rank = 'Lieutenant') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/ship> . ?T2 a <http://valuenet/ontop/captain> . ?T2 <http://valuenet/ontop/ref-ship> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/rank> ?T2_rank . FILTER(?T2_rank = 'Midshipman') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/ship> . ?T4 a <http://valuenet/ontop/captain> . ?T4 <http://valuenet/ontop/ref-ship> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/rank> ?T4_rank . FILTER(?T4_rank = 'Lieutenant') . }
