nl_question,sparql_partial_uri,sparql_complete_uri
"Show name, address road, and city for all branches sorted by open year.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_address_road ?T1_city WHERE { ?T1 a :branch . ?T1 :name ?T1_name . ?T1 :address_road ?T1_address_road . ?T1 :city ?T1_city . ?T1 :open_year ?T1_open_year . } ORDER BY ASC (?T1_open_year)",SELECT ?T1_name ?T1_address_road ?T1_city WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/address_road> ?T1_address_road . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . } ORDER BY ASC (?T1_open_year)
Show all distinct city where branches with at least 100 memberships are located.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_city WHERE { ?T1 a :branch . ?T1 :city ?T1_city . ?T1 :membership_amount ?T1_membership_amount . FILTER(?T1_membership_amount >= 100) . }",SELECT DISTINCT ?T1_city WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/membership_amount> ?T1_membership_amount . FILTER(?T1_membership_amount >= 100) . }
List all open years when at least two shops are opened.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_open_year WHERE { ?T1 a :branch . ?T1 :open_year ?T1_open_year . } GROUP BY ?T1_open_year HAVING(count( *) >= 2)",SELECT ?T1_open_year WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . } GROUP BY ?T1_open_year HAVING(count( *) >= 2)
Show minimum and maximum amount of memberships for all branches opened in 2011 or located at city London.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_membership_amount) as ?aggregation_T1_membership_amount_185 ) (max( ?T1_membership_amount) as ?aggregation_T1_membership_amount_19 ) WHERE { ?T1 a :branch . ?T1 :membership_amount ?T1_membership_amount . ?T1 :membership_amount ?T1_membership_amount . ?T1 :open_year ?T1_open_year . ?T1 :city ?T1_city . FILTER(?T1_open_year = 2011 || ?T1_city = 'London') . }",SELECT (min( ?T1_membership_amount) as ?aggregation_T1_membership_amount_185 ) (max( ?T1_membership_amount) as ?aggregation_T1_membership_amount_19 ) WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/membership_amount> ?T1_membership_amount . ?T1 <http://valuenet/ontop/membership_amount> ?T1_membership_amount . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . ?T1 <http://valuenet/ontop/city> ?T1_city . FILTER(?T1_open_year = 2011 || ?T1_city = 'London') . }
Show the city and the number of branches opened before 2010 for each city.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a :branch . ?T1 :city ?T1_city . ?T1 :open_year ?T1_open_year . FILTER(?T1_open_year < 2010) . } GROUP BY ?T1_city",SELECT ?T1_city (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . FILTER(?T1_open_year < 2010) . } GROUP BY ?T1_city
"Show card number, name, and hometown for all members in a descending order of level.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_card_number ?T1_name ?T1_hometown WHERE { ?T1 a :member . ?T1 :card_number ?T1_card_number . ?T1 :name ?T1_name . ?T1 :hometown ?T1_hometown . ?T1 :level ?T1_level . } ORDER BY DESC (?T1_level)",SELECT ?T1_card_number ?T1_name ?T1_hometown WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/card_number> ?T1_card_number . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . ?T1 <http://valuenet/ontop/level> ?T1_level . } ORDER BY DESC (?T1_level)
Show the membership level with most number of members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_level (count( *) as ?aggregation_all) WHERE { ?T1 a :member . ?T1 :level ?T1_level . } GROUP BY ?T1_level ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_level (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/level> ?T1_level . } GROUP BY ?T1_level ORDER BY DESC (?aggregation_all) LIMIT 1
Show all member names and registered branch names sorted by register year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_name WHERE { ?T1 a :member . ?T14 a :purchase . ?T14 :ref-member ?T1 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :register_year ?T3_register_year . ?T2 a :branch . ?T14 :ref-branch ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :register_year ?T3_register_year . ?T3 a :membership_register_branch . ?T3 :ref-branch ?T2 . ?T1 :name ?T1_name . ?T2 :name ?T2_name . ?T3 :register_year ?T3_register_year . } ORDER BY ASC (?T3_register_year)",SELECT ?T1_name ?T2_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T14 a <http://valuenet/ontop/purchase> . ?T14 <http://valuenet/ontop/ref-member> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/register_year> ?T3_register_year . ?T2 a <http://valuenet/ontop/branch> . ?T14 <http://valuenet/ontop/ref-branch> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/register_year> ?T3_register_year . ?T3 a <http://valuenet/ontop/membership_register_branch> . ?T3 <http://valuenet/ontop/ref-branch> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/register_year> ?T3_register_year . } ORDER BY ASC (?T3_register_year)
Show all branch names with the number of members in each branch registered after 2015.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :branch . ?T2 a :membership_register_branch . ?T2 :ref-branch ?T1 . ?T1 :name ?T1_name . ?T2 :register_year ?T2_register_year . FILTER(?T2_register_year > 2015) . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T2 a <http://valuenet/ontop/membership_register_branch> . ?T2 <http://valuenet/ontop/ref-branch> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/register_year> ?T2_register_year . FILTER(?T2_register_year > 2015) . } GROUP BY ?T1_name
Show member names without any registered branch.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :member . ?T1 :name ?T1_name . ?T1 :member_id ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) . {SELECT ?T22_member_id WHERE { ?T22 a :membership_register_branch . ?T22 :member_id ?T22_member_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/member_id> ?T1_member_id . FILTER(?T1_member_id not in (?T22_member_id)) . {SELECT ?T22_member_id WHERE { ?T22 a <http://valuenet/ontop/membership_register_branch> . ?T22 <http://valuenet/ontop/member_id> ?T22_member_id . } } }
List the branch name and city without any registered members.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_city WHERE { ?T1 a :branch . ?T1 :name ?T1_name . ?T1 :city ?T1_city . ?T1 :branch_id ?T1_branch_id . FILTER(?T1_branch_id not in (?T22_branch_id)) . {SELECT ?T22_branch_id WHERE { ?T22 a :membership_register_branch . ?T22 :branch_id ?T22_branch_id . } } }",SELECT ?T1_name ?T1_city WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/branch_id> ?T1_branch_id . FILTER(?T1_branch_id not in (?T22_branch_id)) . {SELECT ?T22_branch_id WHERE { ?T22 a <http://valuenet/ontop/membership_register_branch> . ?T22 <http://valuenet/ontop/branch_id> ?T22_branch_id . } } }
Show the member name and hometown who registered a branch in 2016.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_hometown WHERE { ?T1 a :member . ?T2 a :membership_register_branch . ?T2 :ref-member ?T1 . ?T1 :name ?T1_name . ?T1 :hometown ?T1_hometown . ?T2 :register_year ?T2_register_year . FILTER(?T2_register_year = 2016) . }",SELECT ?T1_name ?T1_hometown WHERE { ?T1 a <http://valuenet/ontop/member> . ?T2 a <http://valuenet/ontop/membership_register_branch> . ?T2 <http://valuenet/ontop/ref-member> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . ?T2 <http://valuenet/ontop/register_year> ?T2_register_year . FILTER(?T2_register_year = 2016) . }
Show all city with a branch opened in 2001 and a branch with more than 100 membership.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_city WHERE { ?T1 a :branch . ?T1 :city ?T1_city . ?T1 :open_year ?T1_open_year . ?T1 :membership_amount ?T1_membership_amount . FILTER(?T1_open_year = 2001 && ?T1_membership_amount > 100) . }",SELECT ?T1_city WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/city> ?T1_city . ?T1 <http://valuenet/ontop/open_year> ?T1_open_year . ?T1 <http://valuenet/ontop/membership_amount> ?T1_membership_amount . FILTER(?T1_open_year = 2001 && ?T1_membership_amount > 100) . }
Show all cities without a branch having more than 100 memberships.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a :branch . ?T1 :city ?T1_city . }} MINUS {SELECT (?T2_city as ?col1) WHERE { ?T2 a :branch . ?T2 :city ?T2_city . ?T2 :membership_amount ?T2_membership_amount . FILTER(?T2_membership_amount > 100) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_city as ?col1) WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T1 <http://valuenet/ontop/city> ?T1_city . }} MINUS {SELECT (?T2_city as ?col1) WHERE { ?T2 a <http://valuenet/ontop/branch> . ?T2 <http://valuenet/ontop/city> ?T2_city . ?T2 <http://valuenet/ontop/membership_amount> ?T2_membership_amount . FILTER(?T2_membership_amount > 100) . } } }
"Find the name of branches where have some members whose hometown is in Louisville, Kentucky and some in Hiram, Georgia.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :branch . ?T13 a :purchase . ?T13 :ref-branch ?T1 . ?T1 :name ?T1_name . ?T2 :hometown ?T2_hometown . ?T2 a :member . ?T13 :ref-member ?T2 . ?T1 :name ?T1_name . ?T2 :hometown ?T2_hometown . FILTER(?T2_hometown = 'Louisville , Kentucky') . FILTER (?T1_name in (?T3_name)) . ?T3 a :branch . ?T15 a :purchase . ?T15 :ref-branch ?T3 . ?T3 :name ?T3_name . ?T4 :hometown ?T4_hometown . ?T4 a :member . ?T15 :ref-member ?T4 . ?T3 :name ?T3_name . ?T4 :hometown ?T4_hometown . FILTER(?T4_hometown = 'Hiram , Georgia') . }","SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/branch> . ?T13 a <http://valuenet/ontop/purchase> . ?T13 <http://valuenet/ontop/ref-branch> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/hometown> ?T2_hometown . ?T2 a <http://valuenet/ontop/member> . ?T13 <http://valuenet/ontop/ref-member> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/hometown> ?T2_hometown . FILTER(?T2_hometown = 'Louisville , Kentucky') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/branch> . ?T15 a <http://valuenet/ontop/purchase> . ?T15 <http://valuenet/ontop/ref-branch> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/hometown> ?T4_hometown . ?T4 a <http://valuenet/ontop/member> . ?T15 <http://valuenet/ontop/ref-member> ?T4 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/hometown> ?T4_hometown . FILTER(?T4_hometown = 'Hiram , Georgia') . }"
list the card number of all members whose hometown address includes word 'Kentucky'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_card_number WHERE { ?T1 a :member . ?T1 :card_number ?T1_card_number . ?T1 :hometown ?T1_hometown . FILTER(contains (?T1_hometown, 'Kentucky')) . }","SELECT ?T1_card_number WHERE { ?T1 a <http://valuenet/ontop/member> . ?T1 <http://valuenet/ontop/card_number> ?T1_card_number . ?T1 <http://valuenet/ontop/hometown> ?T1_hometown . FILTER(contains (?T1_hometown, 'Kentucky')) . }"
