nl_question,sparql_partial_uri,sparql_complete_uri
Find the total savings balance of all accounts except the account with name ‘Brown’.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_80 ) WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :ref-cust ?T2 . ?T1 :balance ?T1_balance . ?T2 :name ?T2_name . FILTER(?T2_name != 'Brown') . }",SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_80 ) WHERE { ?T1 a <http://valuenet/ontop/savings> . ?T2 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T2 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name != 'Brown') . }
Count the number of accounts.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :accounts . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/accounts> . }
Find the total balance across checking accounts.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_157 ) WHERE { ?T1 a :checking . ?T1 :balance ?T1_balance . }",SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_157 ) WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T1 <http://valuenet/ontop/balance> ?T1_balance . }
Find the average checking balance.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_balance) as ?aggregation_T1_balance_114 ) WHERE { ?T1 a :checking . ?T1 :balance ?T1_balance . }",SELECT (avg( ?T1_balance) as ?aggregation_T1_balance_114 ) WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T1 <http://valuenet/ontop/balance> ?T1_balance . }
Find the number of accounts with a savings balance that is higher than the average savings balance.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :savings . ?T1 :balance ?T1_balance . FILTER(?T1_balance > (?aggregation_T22_balance_128)) . {SELECT (avg( ?T22_balance) as ?aggregation_T22_balance_128 ) WHERE { ?T22 a :savings . ?T22 :balance ?T22_balance . } } }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/savings> . ?T1 <http://valuenet/ontop/balance> ?T1_balance . FILTER(?T1_balance > (?aggregation_T22_balance_128)) . {SELECT (avg( ?T22_balance) as ?aggregation_T22_balance_128 ) WHERE { ?T22 a <http://valuenet/ontop/savings> . ?T22 <http://valuenet/ontop/balance> ?T22_balance . } } }
Find the name and id of accounts whose checking balance is below the maximum checking balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_custid ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :ref-cust ?T1 . ?T1 :custid ?T1_custid . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_58)) . {SELECT (max( ?T23_balance) as ?aggregation_T23_balance_58 ) WHERE { ?T23 a :checking . ?T23 :balance ?T23_balance . } } }",SELECT ?T1_custid ?T1_name WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T2 a <http://valuenet/ontop/checking> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/custid> ?T1_custid . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_58)) . {SELECT (max( ?T23_balance) as ?aggregation_T23_balance_58 ) WHERE { ?T23 a <http://valuenet/ontop/checking> . ?T23 <http://valuenet/ontop/balance> ?T23_balance . } } }
Find the balance of the checking account belonging to an owner whose name contains 'ee'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_balance WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :ref-cust ?T2 . ?T1 :balance ?T1_balance . ?T2 :name ?T2_name . FILTER(contains (?T2_name, 'ee')) . }","SELECT ?T1_balance WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T2 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T2 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(contains (?T2_name, 'ee')) . }"
Find the checking balance and saving balance in the Brown’s account.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_balance ?T2_balance WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :ref-cust ?T3 . ?T1 :balance ?T1_balance . ?T2 :balance ?T2_balance . ?T3 :name ?T3_name . ?T2 a :savings . ?T2 :ref-cust ?T3 . ?T1 :balance ?T1_balance . ?T2 :balance ?T2_balance . ?T3 :name ?T3_name . FILTER(?T3_name = 'Brown') . }",SELECT ?T1_balance ?T2_balance WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T3 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T3 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T2 a <http://valuenet/ontop/savings> . ?T2 <http://valuenet/ontop/ref-cust> ?T3 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/name> ?T3_name . FILTER(?T3_name = 'Brown') . }
"Find the names of accounts whose checking balance is above the average checking balance, but savings balance is below the average savings balance.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . FILTER(?T2_balance > (?aggregation_T23_balance_32)) . FILTER (?T1_name in (?T4_name)) . ?T3 a :accounts . ?T4 a :savings . ?T4 :ref-cust ?T3 . ?T3 :name ?T3_name . ?T4 :balance ?T4_balance . FILTER(?T4_balance < (?aggregation_T25_balance_92)) . { ?T23 a :checking . ?T23 :balance ?T23_balance . } }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T2 a <http://valuenet/ontop/savings> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . FILTER(?T2_balance > (?aggregation_T23_balance_32)) . FILTER (?T1_name in (?T4_name)) . ?T3 a <http://valuenet/ontop/accounts> . ?T4 a <http://valuenet/ontop/savings> . ?T4 <http://valuenet/ontop/ref-cust> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/balance> ?T4_balance . FILTER(?T4_balance < (?aggregation_T25_balance_92)) . { ?T23 a <http://valuenet/ontop/checking> . ?T23 <http://valuenet/ontop/balance> ?T23_balance . } }
Find the checking balance of the accounts whose savings balance is higher than the average savings balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_balance WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :ref-cust ?T2 . ?T1 :balance ?T1_balance . ?T2 :name ?T2_name . FILTER(?T2_name in (?aggregation_T45_balance_110)) . {SELECT ?T23_name WHERE { ?T23 a :accounts . ?T24 a :savings . ?T24 :ref-cust ?T23 . ?T23 :name ?T23_name . ?T24 :balance ?T24_balance . FILTER(?T24_balance > (?aggregation_T45_balance_110)) . {SELECT (avg( ?T45_balance) as ?aggregation_T45_balance_110 ) WHERE { ?T45 a :savings . ?T45 :balance ?T45_balance . } } } } }",SELECT ?T1_balance WHERE { ?T1 a <http://valuenet/ontop/savings> . ?T2 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T2 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name in (?aggregation_T45_balance_110)) . {SELECT ?T23_name WHERE { ?T23 a <http://valuenet/ontop/accounts> . ?T24 a <http://valuenet/ontop/savings> . ?T24 <http://valuenet/ontop/ref-cust> ?T23 . ?T23 <http://valuenet/ontop/name> ?T23_name . ?T24 <http://valuenet/ontop/balance> ?T24_balance . FILTER(?T24_balance > (?aggregation_T45_balance_110)) . {SELECT (avg( ?T45_balance) as ?aggregation_T45_balance_110 ) WHERE { ?T45 a <http://valuenet/ontop/savings> . ?T45 <http://valuenet/ontop/balance> ?T45_balance . } } } } }
List all customers’ names in the alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :accounts . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY ASC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY ASC (?T1_name)
Find the name of account that has the lowest total checking and saving balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . ?T3 :balance ?T3_balance . ?T3 a :savings . ?T3 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . ?T3 :balance ?T3_balance . } ORDER BY ASC (?T2_balance + ?T3_balance) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T2 a <http://valuenet/ontop/checking> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/balance> ?T3_balance . ?T3 a <http://valuenet/ontop/savings> . ?T3 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/balance> ?T3_balance . } ORDER BY ASC (?T2_balance + ?T3_balance) LIMIT 1
Find the name and checking balance of the account with the lowest savings balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_balance WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . ?T3 :balance ?T3_balance . ?T3 a :savings . ?T3 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . ?T3 :balance ?T3_balance . } ORDER BY ASC (?T3_balance) LIMIT 1",SELECT ?T1_name ?T2_balance WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T2 a <http://valuenet/ontop/checking> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/balance> ?T3_balance . ?T3 a <http://valuenet/ontop/savings> . ?T3 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/balance> ?T3_balance . } ORDER BY ASC (?T3_balance) LIMIT 1
Find the number of checking accounts for each account name.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :ref-cust ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (count( *) as ?aggregation_all) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T2 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Find the total saving balance for each account name.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_167 ) ?T2_name WHERE { ?T1 a :savings . ?T2 a :accounts . ?T1 :ref-cust ?T2 . ?T1 :balance ?T1_balance . ?T2 :name ?T2_name . } GROUP BY ?T2_name",SELECT (sum( ?T1_balance) as ?aggregation_T1_balance_167 ) ?T2_name WHERE { ?T1 a <http://valuenet/ontop/savings> . ?T2 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T2 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name
Find the name of accounts whose checking balance is below the average checking balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :accounts . ?T2 a :checking . ?T2 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_73)) . {SELECT (avg( ?T23_balance) as ?aggregation_T23_balance_73 ) WHERE { ?T23 a :checking . ?T23 :balance ?T23_balance . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T2 a <http://valuenet/ontop/checking> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . FILTER(?T2_balance < (?aggregation_T23_balance_73)) . {SELECT (avg( ?T23_balance) as ?aggregation_T23_balance_73 ) WHERE { ?T23 a <http://valuenet/ontop/checking> . ?T23 <http://valuenet/ontop/balance> ?T23_balance . } } }
Find the saving balance of the account with the highest checking balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_balance WHERE { ?T1 a :savings . ?T13 a :accounts . ?T1 :ref-cust ?T13 . ?T1 :balance ?T1_balance . ?T2 :balance ?T2_balance . ?T2 a :checking . ?T2 :ref-cust ?T13 . ?T1 :balance ?T1_balance . ?T2 :balance ?T2_balance . } ORDER BY DESC (?T2_balance) LIMIT 1",SELECT ?T1_balance WHERE { ?T1 a <http://valuenet/ontop/savings> . ?T13 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T13 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T2 a <http://valuenet/ontop/checking> . ?T2 <http://valuenet/ontop/ref-cust> ?T13 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . } ORDER BY DESC (?T2_balance) LIMIT 1
Find the name and checking balance of the account with the lowest saving balance.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_balance ?T2_name WHERE { ?T1 a :checking . ?T2 a :accounts . ?T1 :ref-cust ?T2 . ?T1 :balance ?T1_balance . ?T2 :name ?T2_name . ?T3 :balance ?T3_balance . ?T3 a :savings . ?T3 :ref-cust ?T2 . ?T1 :balance ?T1_balance . ?T2 :name ?T2_name . ?T3 :balance ?T3_balance . } ORDER BY ASC (?T3_balance) LIMIT 1",SELECT ?T1_balance ?T2_name WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T2 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T2 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/balance> ?T3_balance . ?T3 a <http://valuenet/ontop/savings> . ?T3 <http://valuenet/ontop/ref-cust> ?T2 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/balance> ?T3_balance . } ORDER BY ASC (?T3_balance) LIMIT 1
"Find the name, checking balance and saving balance of all accounts in the bank.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_balance ?T2_balance ?T3_name WHERE { ?T1 a :checking . ?T3 a :accounts . ?T1 :ref-cust ?T3 . ?T1 :balance ?T1_balance . ?T2 :balance ?T2_balance . ?T3 :name ?T3_name . ?T2 a :savings . ?T2 :ref-cust ?T3 . ?T1 :balance ?T1_balance . ?T2 :balance ?T2_balance . ?T3 :name ?T3_name . }",SELECT ?T1_balance ?T2_balance ?T3_name WHERE { ?T1 a <http://valuenet/ontop/checking> . ?T3 a <http://valuenet/ontop/accounts> . ?T1 <http://valuenet/ontop/ref-cust> ?T3 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T2 a <http://valuenet/ontop/savings> . ?T2 <http://valuenet/ontop/ref-cust> ?T3 . ?T1 <http://valuenet/ontop/balance> ?T1_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T3 <http://valuenet/ontop/name> ?T3_name . }
Find the name and savings balance of the top 3 accounts with the highest saving balance sorted by savings balance in descending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_balance WHERE { ?T1 a :accounts . ?T2 a :savings . ?T2 :ref-cust ?T1 . ?T1 :name ?T1_name . ?T2 :balance ?T2_balance . ?T2 :balance ?T2_balance . } ORDER BY DESC (?T2_balance) LIMIT 1",SELECT ?T1_name ?T2_balance WHERE { ?T1 a <http://valuenet/ontop/accounts> . ?T2 a <http://valuenet/ontop/savings> . ?T2 <http://valuenet/ontop/ref-cust> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/balance> ?T2_balance . ?T2 <http://valuenet/ontop/balance> ?T2_balance . } ORDER BY DESC (?T2_balance) LIMIT 1
