nl_question,sparql_partial_uri,sparql_complete_uri
Find the name and training hours of players whose hours are below 1500.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname ?T1_hs WHERE { ?T1 a :player . ?T1 :pname ?T1_pname . ?T1 :hs ?T1_hs . ?T1 :hs ?T1_hs . FILTER(?T1_hs < 1500) . }",SELECT ?T1_pname ?T1_hs WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T1 <http://valuenet/ontop/hs> ?T1_hs . FILTER(?T1_hs < 1500) . }
"Find the max, average and min training hours of all players.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_60 ) (max( ?T1_hs) as ?aggregation_T1_hs_124 ) (min( ?T1_hs) as ?aggregation_T1_hs_63 ) WHERE { ?T1 a :player . ?T1 :hs ?T1_hs . ?T1 :hs ?T1_hs . ?T1 :hs ?T1_hs . }",SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_60 ) (max( ?T1_hs) as ?aggregation_T1_hs_124 ) (min( ?T1_hs) as ?aggregation_T1_hs_63 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T1 <http://valuenet/ontop/hs> ?T1_hs . }
Find the players whose names contain letter 'a'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_pname WHERE { ?T1 a :player . ?T1 :pname ?T1_pname . ?T1 :pname ?T1_pname . FILTER(contains (?T1_pname, 'a')) . }","SELECT DISTINCT ?T1_pname WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T1 <http://valuenet/ontop/pname> ?T1_pname . FILTER(contains (?T1_pname, 'a')) . }"
"Find the name, enrollment of the colleges whose size is bigger than 10000 and location is in state LA.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cname ?T1_enr WHERE { ?T1 a :college . ?T1 :cname ?T1_cname . ?T1 :enr ?T1_enr . ?T1 :enr ?T1_enr . ?T1 :state ?T1_state . FILTER(?T1_enr > 10000 && ?T1_state = 'LA') . }",SELECT ?T1_cname ?T1_enr WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/enr> ?T1_enr . ?T1 <http://valuenet/ontop/enr> ?T1_enr . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_enr > 10000 && ?T1_state = 'LA') . }
List all information about college sorted by enrollment number in the ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :college . ?T1 :enr ?T1_enr . } ORDER BY ASC (?T1_enr)",SELECT * WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/enr> ?T1_enr . } ORDER BY ASC (?T1_enr)
List the name of the colleges whose enrollment is greater 18000 sorted by the college's name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cname WHERE { ?T1 a :college . ?T1 :cname ?T1_cname . ?T1 :cname ?T1_cname . ?T1 :enr ?T1_enr . FILTER(?T1_enr > 18000) . } ORDER BY ASC (?T1_cname)",SELECT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/enr> ?T1_enr . FILTER(?T1_enr > 18000) . } ORDER BY ASC (?T1_cname)
Find the name of players whose card is yes in the descending order of training hours.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname WHERE { ?T1 a :player . ?T1 :pname ?T1_pname . ?T1 :hs ?T1_hs . ?T1 :ycard ?T1_ycard . FILTER(?T1_ycard = 'yes') . } ORDER BY DESC (?T1_hs)",SELECT ?T1_pname WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T1 <http://valuenet/ontop/ycard> ?T1_ycard . FILTER(?T1_ycard = 'yes') . } ORDER BY DESC (?T1_hs)
Find the name of different colleges involved in the tryout in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_cname WHERE { ?T1 a :tryout . ?T1 :cname ?T1_cname . ?T1 :cname ?T1_cname . } ORDER BY ASC (?T1_cname)",SELECT DISTINCT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/tryout> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/cname> ?T1_cname . } ORDER BY ASC (?T1_cname)
Find the number of students who participate in the tryout for each college ordered by descending count.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_cname WHERE { ?T1 a :tryout . ?T1 :cname ?T1_cname . } GROUP BY ?T1_cname ORDER BY DESC (count( *) )",SELECT (count( *) as ?aggregation_all) ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/tryout> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . } GROUP BY ?T1_cname ORDER BY DESC (count( *) )
Find the states where have some college students in tryout.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T1 :state ?T1_state . }",SELECT DISTINCT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/state> ?T1_state . }
Find the states where have some college students in tryout and their decisions are yes.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :ref-cname ?T1 . ?T1 :state ?T1_state . ?T2 :decision ?T2_decision . FILTER(?T2_decision = 'yes') . }",SELECT DISTINCT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/college> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-cname> ?T1 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T2 <http://valuenet/ontop/decision> ?T2_decision . FILTER(?T2_decision = 'yes') . }
Find the name and college of students whose decisions are yes in the tryout.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname ?T2_cname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :ref-p ?T1 . ?T1 :pname ?T1_pname . ?T2 :cname ?T2_cname . ?T2 :decision ?T2_decision . FILTER(?T2_decision = 'yes') . }",SELECT ?T1_pname ?T2_cname WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-p> ?T1 . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T2 <http://valuenet/ontop/cname> ?T2_cname . ?T2 <http://valuenet/ontop/decision> ?T2_decision . FILTER(?T2_decision = 'yes') . }
Find the name of all students who were in the tryout sorted in alphabetic order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname WHERE { ?T1 a :player . ?T1 :pname ?T1_pname . ?T1 :pname ?T1_pname . } ORDER BY ASC (?T1_pname)",SELECT ?T1_pname WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T1 <http://valuenet/ontop/pname> ?T1_pname . } ORDER BY ASC (?T1_pname)
Find the name and hours of the students whose tryout decision is yes.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname ?T1_hs WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :ref-p ?T1 . ?T1 :pname ?T1_pname . ?T1 :hs ?T1_hs . ?T2 :decision ?T2_decision . FILTER(?T2_decision = 'yes') . }",SELECT ?T1_pname ?T1_hs WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-p> ?T1 . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T2 <http://valuenet/ontop/decision> ?T2_decision . FILTER(?T2_decision = 'yes') . }
Find the states of the colleges that have students in the tryout who played in striker position.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :ref-cname ?T1 . ?T1 :state ?T1_state . ?T2 :ppos ?T2_ppos . FILTER(?T2_ppos = 'striker') . }",SELECT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/college> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-cname> ?T1 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T2 <http://valuenet/ontop/ppos> ?T2_ppos . FILTER(?T2_ppos = 'striker') . }
Find the names of the students who are in the position of striker and got a yes tryout decision.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :ref-p ?T1 . ?T1 :pname ?T1_pname . ?T2 :decision ?T2_decision . ?T2 :ppos ?T2_ppos . FILTER(?T2_decision = 'yes' && ?T2_ppos = 'striker') . }",SELECT ?T1_pname WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-p> ?T1 . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T2 <http://valuenet/ontop/decision> ?T2_decision . ?T2 <http://valuenet/ontop/ppos> ?T2_ppos . FILTER(?T2_decision = 'yes' && ?T2_ppos = 'striker') . }
Find the state of the college which player Charles is attending.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_state WHERE { ?T1 a :college . ?T13 a :tryout . ?T13 :ref-cname ?T1 . ?T1 :state ?T1_state . ?T2 :pname ?T2_pname . ?T2 a :player . ?T13 :ref-p ?T2 . ?T1 :state ?T1_state . ?T2 :pname ?T2_pname . FILTER(?T2_pname = 'Charles') . }",SELECT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/college> . ?T13 a <http://valuenet/ontop/tryout> . ?T13 <http://valuenet/ontop/ref-cname> ?T1 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T2 <http://valuenet/ontop/pname> ?T2_pname . ?T2 a <http://valuenet/ontop/player> . ?T13 <http://valuenet/ontop/ref-p> ?T2 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T2 <http://valuenet/ontop/pname> ?T2_pname . FILTER(?T2_pname = 'Charles') . }
Find the average and maximum hours for the students whose tryout decision is yes.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_184 ) (max( ?T1_hs) as ?aggregation_T1_hs_132 ) WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :ref-p ?T1 . ?T1 :hs ?T1_hs . ?T1 :hs ?T1_hs . ?T2 :decision ?T2_decision . FILTER(?T2_decision = 'yes') . }",SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_184 ) (max( ?T1_hs) as ?aggregation_T1_hs_132 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-p> ?T1 . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T2 <http://valuenet/ontop/decision> ?T2_decision . FILTER(?T2_decision = 'yes') . }
Find the average hours for the students whose tryout decision is no.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_39 ) WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :ref-p ?T1 . ?T1 :hs ?T1_hs . ?T2 :decision ?T2_decision . FILTER(?T2_decision = 'no') . }",SELECT (avg( ?T1_hs) as ?aggregation_T1_hs_39 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-p> ?T1 . ?T1 <http://valuenet/ontop/hs> ?T1_hs . ?T2 <http://valuenet/ontop/decision> ?T2_decision . FILTER(?T2_decision = 'no') . }
Which college has any student who is a goalie and succeeded in the tryout.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cname WHERE { ?T1 a :tryout . ?T1 :cname ?T1_cname . ?T1 :decision ?T1_decision . ?T1 :ppos ?T1_ppos . FILTER(?T1_decision = 'yes' && ?T1_ppos = 'goalie') . }",SELECT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/tryout> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/decision> ?T1_decision . ?T1 <http://valuenet/ontop/ppos> ?T1_ppos . FILTER(?T1_decision = 'yes' && ?T1_ppos = 'goalie') . }
Find the name of the tryout players who are from the college with largest size.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_pname WHERE { ?T1 a :player . ?T2 a :tryout . ?T2 :ref-p ?T1 . ?T1 :pname ?T1_pname . ?T2 :cname ?T2_cname . FILTER(?T2_cname = (?T23_enr)) . {SELECT ?T23_cname WHERE { ?T23 a :college . ?T23 :cname ?T23_cname . ?T23 :enr ?T23_enr . } ORDER BY DESC (?T23_enr) LIMIT 1 } }",SELECT ?T1_pname WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-p> ?T1 . ?T1 <http://valuenet/ontop/pname> ?T1_pname . ?T2 <http://valuenet/ontop/cname> ?T2_cname . FILTER(?T2_cname = (?T23_enr)) . {SELECT ?T23_cname WHERE { ?T23 a <http://valuenet/ontop/college> . ?T23 <http://valuenet/ontop/cname> ?T23_cname . ?T23 <http://valuenet/ontop/enr> ?T23_enr . } ORDER BY DESC (?T23_enr) LIMIT 1 } }
What is the state and enrollment of the colleges where have any students who got accepted in the tryout decision.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_state ?T1_enr WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :ref-cname ?T1 . ?T1 :state ?T1_state . ?T1 :enr ?T1_enr . ?T2 :decision ?T2_decision . FILTER(?T2_decision = 'yes') . }",SELECT DISTINCT ?T1_state ?T1_enr WHERE { ?T1 a <http://valuenet/ontop/college> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-cname> ?T1 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/enr> ?T1_enr . ?T2 <http://valuenet/ontop/decision> ?T2_decision . FILTER(?T2_decision = 'yes') . }
Find the names of either colleges in LA with greater than 15000 size or in state AZ with less than 13000 enrollment.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a :college . ?T1 :cname ?T1_cname . ?T1 :enr ?T1_enr . ?T1 :state ?T1_state . FILTER(?T1_enr < 13000 && ?T1_state = 'AZ') . }} UNION {SELECT (?T1_cname as ?col1) WHERE { ?T1 a :college . ?T1 :cname ?T1_cname . ?T1 :enr ?T1_enr . ?T1 :state ?T1_state . FILTER(?T1_enr > 15000 && ?T1_state = 'LA') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/enr> ?T1_enr . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_enr < 13000 && ?T1_state = 'AZ') . }} UNION {SELECT (?T1_cname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/enr> ?T1_enr . ?T1 <http://valuenet/ontop/state> ?T1_state . FILTER(?T1_enr > 15000 && ?T1_state = 'LA') . } } }
Find the names of schools that have some students playing in goalie and mid positions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_cname WHERE { ?T1 a :tryout . ?T1 :cname ?T1_cname . ?T1 :ppos ?T1_ppos . FILTER(?T1_ppos = 'goalie') . FILTER (?T1_cname in (?T2_cname)) . ?T2 a :tryout . ?T2 :cname ?T2_cname . ?T2 :ppos ?T2_ppos . FILTER(?T2_ppos = 'mid') . }",SELECT DISTINCT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/tryout> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/ppos> ?T1_ppos . FILTER(?T1_ppos = 'goalie') . FILTER (?T1_cname in (?T2_cname)) . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/cname> ?T2_cname . ?T2 <http://valuenet/ontop/ppos> ?T2_ppos . FILTER(?T2_ppos = 'mid') . }
Find the names of states that have some college students playing in goalie and mid positions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :ref-cname ?T1 . ?T1 :state ?T1_state . ?T2 :ppos ?T2_ppos . FILTER(?T2_ppos = 'goalie') . FILTER (?T1_state in (?T3_state)) . ?T3 a :college . ?T4 a :tryout . ?T4 :ref-cname ?T3 . ?T3 :state ?T3_state . ?T4 :ppos ?T4_ppos . FILTER(?T4_ppos = 'mid') . }",SELECT DISTINCT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/college> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-cname> ?T1 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T2 <http://valuenet/ontop/ppos> ?T2_ppos . FILTER(?T2_ppos = 'goalie') . FILTER (?T1_state in (?T3_state)) . ?T3 a <http://valuenet/ontop/college> . ?T4 a <http://valuenet/ontop/tryout> . ?T4 <http://valuenet/ontop/ref-cname> ?T3 . ?T3 <http://valuenet/ontop/state> ?T3_state . ?T4 <http://valuenet/ontop/ppos> ?T4_ppos . FILTER(?T4_ppos = 'mid') . }
Find the names of schools that have some players in the mid position but not in the goalie position.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a :tryout . ?T1 :cname ?T1_cname . ?T1 :ppos ?T1_ppos . FILTER(?T1_ppos = 'mid') . }} MINUS {SELECT (?T2_cname as ?col1) WHERE { ?T2 a :tryout . ?T2 :cname ?T2_cname . ?T2 :ppos ?T2_ppos . FILTER(?T2_ppos = 'goalie') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_cname as ?col1) WHERE { ?T1 a <http://valuenet/ontop/tryout> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/ppos> ?T1_ppos . FILTER(?T1_ppos = 'mid') . }} MINUS {SELECT (?T2_cname as ?col1) WHERE { ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/cname> ?T2_cname . ?T2 <http://valuenet/ontop/ppos> ?T2_ppos . FILTER(?T2_ppos = 'goalie') . } } }
Find the names of states that have some college students playing in the mid position but not in the goalie position.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_state as ?col1) WHERE { ?T1 a :college . ?T2 a :tryout . ?T2 :ref-cname ?T1 . ?T1 :state ?T1_state . ?T2 :ppos ?T2_ppos . FILTER(?T2_ppos = 'mid') . }} MINUS {SELECT (?T3_state as ?col1) WHERE { ?T3 a :college . ?T4 a :tryout . ?T4 :ref-cname ?T3 . ?T3 :state ?T3_state . ?T4 :ppos ?T4_ppos . FILTER(?T4_ppos = 'goalie') . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_state as ?col1) WHERE { ?T1 a <http://valuenet/ontop/college> . ?T2 a <http://valuenet/ontop/tryout> . ?T2 <http://valuenet/ontop/ref-cname> ?T1 . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T2 <http://valuenet/ontop/ppos> ?T2_ppos . FILTER(?T2_ppos = 'mid') . }} MINUS {SELECT (?T3_state as ?col1) WHERE { ?T3 a <http://valuenet/ontop/college> . ?T4 a <http://valuenet/ontop/tryout> . ?T4 <http://valuenet/ontop/ref-cname> ?T3 . ?T3 <http://valuenet/ontop/state> ?T3_state . ?T4 <http://valuenet/ontop/ppos> ?T4_ppos . FILTER(?T4_ppos = 'goalie') . } } }
Find the states where have the colleges whose enrollments are less than the largest size.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_state WHERE { ?T1 a :college . ?T1 :state ?T1_state . ?T1 :enr ?T1_enr . FILTER(?T1_enr < (?aggregation_T22_enr_175)) . {SELECT (max( ?T22_enr) as ?aggregation_T22_enr_175 ) WHERE { ?T22 a :college . ?T22 :enr ?T22_enr . } } }",SELECT DISTINCT ?T1_state WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/state> ?T1_state . ?T1 <http://valuenet/ontop/enr> ?T1_enr . FILTER(?T1_enr < (?aggregation_T22_enr_175)) . {SELECT (max( ?T22_enr) as ?aggregation_T22_enr_175 ) WHERE { ?T22 a <http://valuenet/ontop/college> . ?T22 <http://valuenet/ontop/enr> ?T22_enr . } } }
Find names of colleges with enrollment greater than that of some (at least one) college in the FL state.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_cname WHERE { ?T1 a :college . ?T1 :cname ?T1_cname . ?T1 :enr ?T1_enr . FILTER(?T1_enr > (?T22_state)) . {SELECT (min( ?T22_enr) as ?aggregation_T22_enr_69 ) WHERE { ?T22 a :college . ?T22 :enr ?T22_enr . ?T22 :state ?T22_state . FILTER(?T22_state = 'FL') . } } }",SELECT DISTINCT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/enr> ?T1_enr . FILTER(?T1_enr > (?T22_state)) . {SELECT (min( ?T22_enr) as ?aggregation_T22_enr_69 ) WHERE { ?T22 a <http://valuenet/ontop/college> . ?T22 <http://valuenet/ontop/enr> ?T22_enr . ?T22 <http://valuenet/ontop/state> ?T22_state . FILTER(?T22_state = 'FL') . } } }
Find names of all colleges whose enrollment is greater than that of all colleges in the FL state.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_cname WHERE { ?T1 a :college . ?T1 :cname ?T1_cname . ?T1 :enr ?T1_enr . FILTER(?T1_enr > (?T22_state)) . {SELECT (max( ?T22_enr) as ?aggregation_T22_enr_193 ) WHERE { ?T22 a :college . ?T22 :enr ?T22_enr . ?T22 :state ?T22_state . FILTER(?T22_state = 'FL') . } } }",SELECT ?T1_cname WHERE { ?T1 a <http://valuenet/ontop/college> . ?T1 <http://valuenet/ontop/cname> ?T1_cname . ?T1 <http://valuenet/ontop/enr> ?T1_enr . FILTER(?T1_enr > (?T22_state)) . {SELECT (max( ?T22_enr) as ?aggregation_T22_enr_193 ) WHERE { ?T22 a <http://valuenet/ontop/college> . ?T22 <http://valuenet/ontop/enr> ?T22_enr . ?T22 <http://valuenet/ontop/state> ?T22_state . FILTER(?T22_state = 'FL') . } } }
