nl_question,sparql_partial_uri,sparql_complete_uri
List the name of products in ascending order of price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :product_price ?T1_product_price . } ORDER BY ASC (?T1_product_price)",SELECT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . } ORDER BY ASC (?T1_product_price)
Show the prices of the products named 'Dining' or 'Trading Policy'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_price WHERE { ?T1 a :products . ?T1 :product_price ?T1_product_price . ?T1 :product_name ?T1_product_name . ?T1 :product_name ?T1_product_name . FILTER(?T1_product_name = 'Dining' || ?T1_product_name = 'Trading Policy') . }",SELECT ?T1_product_price WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . FILTER(?T1_product_name = 'Dining' || ?T1_product_name = 'Trading Policy') . }
Show different type codes of products and the number of products with each type code.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . } GROUP BY ?T1_product_type_code",SELECT ?T1_product_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . } GROUP BY ?T1_product_type_code
Show the most common type code across products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . } GROUP BY ?T1_product_type_code ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_product_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . } GROUP BY ?T1_product_type_code ORDER BY DESC (?aggregation_all) LIMIT 1
Show the product type codes that have at least two products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . } GROUP BY ?T1_product_type_code HAVING(count( *) >= 2)",SELECT ?T1_product_type_code WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . } GROUP BY ?T1_product_type_code HAVING(count( *) >= 2)
Show the product type codes that have both products with price higher than 4500 and products with price lower than 3000.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_product_type_code WHERE { ?T1 a :products . ?T1 :product_type_code ?T1_product_type_code . ?T1 :product_price ?T1_product_price . FILTER(?T1_product_price > 4500) . FILTER (?T1_product_type_code in (?T2_product_type_code)) . ?T2 a :products . ?T2 :product_type_code ?T2_product_type_code . ?T2 :product_price ?T2_product_price . FILTER(?T2_product_price < 3000) . }",SELECT DISTINCT ?T1_product_type_code WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_type_code> ?T1_product_type_code . ?T1 <http://valuenet/ontop/product_price> ?T1_product_price . FILTER(?T1_product_price > 4500) . FILTER (?T1_product_type_code in (?T2_product_type_code)) . ?T2 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/product_type_code> ?T2_product_type_code . ?T2 <http://valuenet/ontop/product_price> ?T2_product_price . FILTER(?T2_product_price < 3000) . }
Show the names of products and the number of events they are in.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :ref-product ?T1 . ?T1 :product_name ?T1_product_name . } GROUP BY ?T1_product_name",SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/products_in_events> . ?T2 <http://valuenet/ontop/ref-product> ?T1 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . } GROUP BY ?T1_product_name
Show the names of products that are in at least two events.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name WHERE { ?T1 a :products . ?T2 a :products_in_events . ?T2 :ref-product ?T1 . ?T1 :product_name ?T1_product_name . } GROUP BY ?T1_product_name HAVING(count( *) >= 2)",SELECT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T2 a <http://valuenet/ontop/products_in_events> . ?T2 <http://valuenet/ontop/ref-product> ?T1 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . } GROUP BY ?T1_product_name HAVING(count( *) >= 2)
List the names of products that are not in any event.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :product_id ?T1_product_id . FILTER(?T1_product_id not in (?T22_product_id)) . {SELECT ?T22_product_id WHERE { ?T22 a :products_in_events . ?T22 :product_id ?T22_product_id . } } }",SELECT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . FILTER(?T1_product_id not in (?T22_product_id)) . {SELECT ?T22_product_id WHERE { ?T22 a <http://valuenet/ontop/products_in_events> . ?T22 <http://valuenet/ontop/product_id> ?T22_product_id . } } }
