nl_question,sparql_partial_uri,sparql_complete_uri
List the distinct region of clubs in ascending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_region WHERE { ?T1 a :club . ?T1 :region ?T1_region . ?T1 :region ?T1_region . } ORDER BY ASC (?T1_region)",SELECT DISTINCT ?T1_region WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/region> ?T1_region . ?T1 <http://valuenet/ontop/region> ?T1_region . } ORDER BY ASC (?T1_region)
What are the maximum and minimum number of silver medals for clubs.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_silver) as ?aggregation_T1_silver_157 ) (min( ?T1_silver) as ?aggregation_T1_silver_76 ) WHERE { ?T1 a :club_rank . ?T1 :silver ?T1_silver . ?T1 :silver ?T1_silver . }",SELECT (max( ?T1_silver) as ?aggregation_T1_silver_157 ) (min( ?T1_silver) as ?aggregation_T1_silver_76 ) WHERE { ?T1 a <http://valuenet/ontop/club_rank> . ?T1 <http://valuenet/ontop/silver> ?T1_silver . ?T1 <http://valuenet/ontop/silver> ?T1_silver . }
List all club names in ascending order of start year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :name ?T1_name . ?T1 :start_year ?T1_start_year . } ORDER BY ASC (?T1_start_year)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/start_year> ?T1_start_year . } ORDER BY ASC (?T1_start_year)
List all club names in descending alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :name ?T1_name . ?T1 :name ?T1_name . } ORDER BY DESC (?T1_name)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . } ORDER BY DESC (?T1_name)
Please show the names and the players of clubs.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_player_id WHERE { ?T1 a :club . ?T2 a :player . ?T2 :ref-club ?T1 . ?T1 :name ?T1_name . ?T2 :player_id ?T2_player_id . }",SELECT ?T1_name ?T2_player_id WHERE { ?T1 a <http://valuenet/ontop/club> . ?T2 a <http://valuenet/ontop/player> . ?T2 <http://valuenet/ontop/ref-club> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/player_id> ?T2_player_id . }
Show the names of clubs that have players with position 'Right Wing'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :club . ?T2 a :player . ?T2 :ref-club ?T1 . ?T1 :name ?T1_name . ?T2 :position ?T2_position . FILTER(?T2_position = 'Right Wing') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/club> . ?T2 a <http://valuenet/ontop/player> . ?T2 <http://valuenet/ontop/ref-club> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/position> ?T2_position . FILTER(?T2_position = 'Right Wing') . }
What is the average points of players from club with name 'AIB'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_points) as ?aggregation_T1_points_187 ) WHERE { ?T1 a :player . ?T2 a :club . ?T1 :ref-club ?T2 . ?T1 :points ?T1_points . ?T2 :name ?T2_name . FILTER(?T2_name = 'AIB') . }",SELECT (avg( ?T1_points) as ?aggregation_T1_points_187 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T2 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/ref-club> ?T2 . ?T1 <http://valuenet/ontop/points> ?T1_points . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'AIB') . }
List the position of players and the average number of points of players of each position.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_position (avg( ?T1_points) as ?aggregation_T1_points_196 ) WHERE { ?T1 a :player . ?T1 :position ?T1_position . ?T1 :points ?T1_points . } GROUP BY ?T1_position",SELECT ?T1_position (avg( ?T1_points) as ?aggregation_T1_points_196 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T1 <http://valuenet/ontop/points> ?T1_points . } GROUP BY ?T1_position
List the position of players with average number of points scored by players of that position bigger than 20.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_position WHERE { ?T1 a :player . ?T1 :position ?T1_position . ?T1 :points ?T1_points . } GROUP BY ?T1_position HAVING(avg( ?T1_points) >= 20)",SELECT ?T1_position WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T1 <http://valuenet/ontop/points> ?T1_points . } GROUP BY ?T1_position HAVING(avg( ?T1_points) >= 20)
List the types of competition and the number of competitions of each type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a :competition . ?T1 :competition_type ?T1_competition_type . } GROUP BY ?T1_competition_type",SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/competition> . ?T1 <http://valuenet/ontop/competition_type> ?T1_competition_type . } GROUP BY ?T1_competition_type
List the most common type of competition.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a :competition . ?T1 :competition_type ?T1_competition_type . } GROUP BY ?T1_competition_type ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_competition_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/competition> . ?T1 <http://valuenet/ontop/competition_type> ?T1_competition_type . } GROUP BY ?T1_competition_type ORDER BY DESC (?aggregation_all) LIMIT 1
List the types of competition that have at most five competitions of that type.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_competition_type WHERE { ?T1 a :competition . ?T1 :competition_type ?T1_competition_type . } GROUP BY ?T1_competition_type HAVING(count( *) <= 5)",SELECT ?T1_competition_type WHERE { ?T1 a <http://valuenet/ontop/competition> . ?T1 <http://valuenet/ontop/competition_type> ?T1_competition_type . } GROUP BY ?T1_competition_type HAVING(count( *) <= 5)
List the names of clubs that do not have any players.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :club . ?T1 :name ?T1_name . ?T1 :club_id ?T1_club_id . FILTER(?T1_club_id not in (?T22_club_id)) . {SELECT ?T22_club_id WHERE { ?T22 a :player . ?T22 :club_id ?T22_club_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/club> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/club_id> ?T1_club_id . FILTER(?T1_club_id not in (?T22_club_id)) . {SELECT ?T22_club_id WHERE { ?T22 a <http://valuenet/ontop/player> . ?T22 <http://valuenet/ontop/club_id> ?T22_club_id . } } }
What are the positions with both players having more than 20 points and less than 10 points.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_position WHERE { ?T1 a :player . ?T1 :position ?T1_position . ?T1 :points ?T1_points . FILTER(?T1_points > 20) . FILTER (?T1_position in (?T2_position)) . ?T2 a :player . ?T2 :position ?T2_position . ?T2 :points ?T2_points . FILTER(?T2_points < 10) . }",SELECT DISTINCT ?T1_position WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T1 <http://valuenet/ontop/points> ?T1_points . FILTER(?T1_points > 20) . FILTER (?T1_position in (?T2_position)) . ?T2 a <http://valuenet/ontop/player> . ?T2 <http://valuenet/ontop/position> ?T2_position . ?T2 <http://valuenet/ontop/points> ?T2_points . FILTER(?T2_points < 10) . }
Show total points of all players.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_points) as ?aggregation_T1_points_110 ) WHERE { ?T1 a :player . ?T1 :points ?T1_points . }",SELECT (sum( ?T1_points) as ?aggregation_T1_points_110 ) WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/points> ?T1_points . }
what are the name of players who get more than the average points.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :player . ?T1 :name ?T1_name . ?T1 :points ?T1_points . FILTER(?T1_points > (?aggregation_T22_points_56)) . {SELECT (avg( ?T22_points) as ?aggregation_T22_points_56 ) WHERE { ?T22 a :player . ?T22 :points ?T22_points . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/points> ?T1_points . FILTER(?T1_points > (?aggregation_T22_points_56)) . {SELECT (avg( ?T22_points) as ?aggregation_T22_points_56 ) WHERE { ?T22 a <http://valuenet/ontop/player> . ?T22 <http://valuenet/ontop/points> ?T22_points . } } }
find the number of players whose points are lower than 30 in each position.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a :player . ?T1 :position ?T1_position . ?T1 :points ?T1_points . FILTER(?T1_points < 30) . } GROUP BY ?T1_position",SELECT (count( *) as ?aggregation_all) ?T1_position WHERE { ?T1 a <http://valuenet/ontop/player> . ?T1 <http://valuenet/ontop/position> ?T1_position . ?T1 <http://valuenet/ontop/points> ?T1_points . FILTER(?T1_points < 30) . } GROUP BY ?T1_position
which countries did participated in both Friendly and Tournament type competitions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :competition . ?T1 :country ?T1_country . ?T1 :competition_type ?T1_competition_type . FILTER(?T1_competition_type = 'Friendly') . FILTER (?T1_country in (?T2_country)) . ?T2 a :competition . ?T2 :country ?T2_country . ?T2 :competition_type ?T2_competition_type . FILTER(?T2_competition_type = 'Tournament') . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/competition> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/competition_type> ?T1_competition_type . FILTER(?T1_competition_type = 'Friendly') . FILTER (?T1_country in (?T2_country)) . ?T2 a <http://valuenet/ontop/competition> . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T2 <http://valuenet/ontop/competition_type> ?T2_competition_type . FILTER(?T2_competition_type = 'Tournament') . }
Find the countries that have never participated in any competition with Friendly type.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?T1_country WHERE { { SELECT (?T1_country as ?col1) WHERE { ?T1 a :competition . ?T1 :country ?T1_country . }} MINUS {SELECT (?T2_country as ?col1) WHERE { ?T2 a :competition . ?T2 :country ?T2_country . ?T2 :competition_type ?T2_competition_type . FILTER(?T2_competition_type = 'Friendly') . } } }",SELECT distinct?T1_country WHERE { { SELECT (?T1_country as ?col1) WHERE { ?T1 a <http://valuenet/ontop/competition> . ?T1 <http://valuenet/ontop/country> ?T1_country . }} MINUS {SELECT (?T2_country as ?col1) WHERE { ?T2 a <http://valuenet/ontop/competition> . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T2 <http://valuenet/ontop/competition_type> ?T2_competition_type . FILTER(?T2_competition_type = 'Friendly') . } } }
