nl_question,sparql_partial_uri,sparql_complete_uri
list the local authorities and services provided by all stations.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_local_authority ?T1_services WHERE { ?T1 a :station . ?T1 :local_authority ?T1_local_authority . ?T1 :services ?T1_services . }",SELECT ?T1_local_authority ?T1_services WHERE { ?T1 a <http://valuenet/ontop/station> . ?T1 <http://valuenet/ontop/local_authority> ?T1_local_authority . ?T1 <http://valuenet/ontop/services> ?T1_services . }
show all train numbers and names ordered by their time from early to late.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_train_number ?T1_name WHERE { ?T1 a :train . ?T1 :train_number ?T1_train_number . ?T1 :name ?T1_name . ?T1 :time ?T1_time . } ORDER BY ASC (?T1_time)",SELECT ?T1_train_number ?T1_name WHERE { ?T1 a <http://valuenet/ontop/train> . ?T1 <http://valuenet/ontop/train_number> ?T1_train_number . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/time> ?T1_time . } ORDER BY ASC (?T1_time)
"Give me the times and numbers of all trains that go to Chennai, ordered by time.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_time ?T1_train_number WHERE { ?T1 a :train . ?T1 :time ?T1_time . ?T1 :train_number ?T1_train_number . ?T1 :time ?T1_time . ?T1 :destination ?T1_destination . FILTER(?T1_destination = 'Chennai') . } ORDER BY ASC (?T1_time)",SELECT ?T1_time ?T1_train_number WHERE { ?T1 a <http://valuenet/ontop/train> . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T1 <http://valuenet/ontop/train_number> ?T1_train_number . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T1 <http://valuenet/ontop/destination> ?T1_destination . FILTER(?T1_destination = 'Chennai') . } ORDER BY ASC (?T1_time)
Find the number and time of the train that goes from Chennai to Guruvayur.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_train_number ?T1_time WHERE { ?T1 a :train . ?T1 :train_number ?T1_train_number . ?T1 :time ?T1_time . ?T1 :origin ?T1_origin . ?T1 :destination ?T1_destination . FILTER(?T1_origin = 'Chennai' && ?T1_destination = 'Guruvayur') . }",SELECT ?T1_train_number ?T1_time WHERE { ?T1 a <http://valuenet/ontop/train> . ?T1 <http://valuenet/ontop/train_number> ?T1_train_number . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T1 <http://valuenet/ontop/origin> ?T1_origin . ?T1 <http://valuenet/ontop/destination> ?T1_destination . FILTER(?T1_origin = 'Chennai' && ?T1_destination = 'Guruvayur') . }
Find the number of trains starting from each origin.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_origin (count( *) as ?aggregation_all) WHERE { ?T1 a :train . ?T1 :origin ?T1_origin . } GROUP BY ?T1_origin",SELECT ?T1_origin (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/train> . ?T1 <http://valuenet/ontop/origin> ?T1_origin . } GROUP BY ?T1_origin
Find the name of the train whose route runs through greatest number of stations.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :train . ?T2 a :route . ?T2 :ref-train ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/train> . ?T2 a <http://valuenet/ontop/route> . ?T2 <http://valuenet/ontop/ref-train> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
"Find the number of trains for each station, as well as the station network name and services.","PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_network_name ?T2_services WHERE { ?T1 a :route . ?T2 a :station . ?T1 :ref-station ?T2 . ?T2 :network_name ?T2_network_name . ?T2 :services ?T2_services . } GROUP BY ?T2_network_name ?T2_services",SELECT (count( *) as ?aggregation_all) ?T2_network_name ?T2_services WHERE { ?T1 a <http://valuenet/ontop/route> . ?T2 a <http://valuenet/ontop/station> . ?T1 <http://valuenet/ontop/ref-station> ?T2 . ?T2 <http://valuenet/ontop/network_name> ?T2_network_name . ?T2 <http://valuenet/ontop/services> ?T2_services . } GROUP BY ?T2_network_name ?T2_services
Give me the maximum low temperature and average precipitation at the Amersham station.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_low_temperature) as ?aggregation_T1_low_temperature_78 ) (avg( ?T1_precipitation) as ?aggregation_T1_precipitation_86 ) WHERE { ?T1 a :weekly_weather . ?T2 a :station . ?T1 :ref-station ?T2 . ?T1 :low_temperature ?T1_low_temperature . ?T1 :precipitation ?T1_precipitation . ?T2 :network_name ?T2_network_name . FILTER(?T2_network_name = 'Amersham') . }",SELECT (max( ?T1_low_temperature) as ?aggregation_T1_low_temperature_78 ) (avg( ?T1_precipitation) as ?aggregation_T1_precipitation_86 ) WHERE { ?T1 a <http://valuenet/ontop/weekly_weather> . ?T2 a <http://valuenet/ontop/station> . ?T1 <http://valuenet/ontop/ref-station> ?T2 . ?T1 <http://valuenet/ontop/low_temperature> ?T1_low_temperature . ?T1 <http://valuenet/ontop/precipitation> ?T1_precipitation . ?T2 <http://valuenet/ontop/network_name> ?T2_network_name . FILTER(?T2_network_name = 'Amersham') . }
Find names and times of trains that run through stations for the local authority Chiltern.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_time WHERE { ?T1 a :train . ?T13 a :route . ?T13 :ref-train ?T1 . ?T1 :name ?T1_name . ?T1 :time ?T1_time . ?T2 :local_authority ?T2_local_authority . ?T2 a :station . ?T13 :ref-station ?T2 . ?T1 :name ?T1_name . ?T1 :time ?T1_time . ?T2 :local_authority ?T2_local_authority . FILTER(?T2_local_authority = 'Chiltern') . }",SELECT ?T1_name ?T1_time WHERE { ?T1 a <http://valuenet/ontop/train> . ?T13 a <http://valuenet/ontop/route> . ?T13 <http://valuenet/ontop/ref-train> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T2 <http://valuenet/ontop/local_authority> ?T2_local_authority . ?T2 a <http://valuenet/ontop/station> . ?T13 <http://valuenet/ontop/ref-station> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T2 <http://valuenet/ontop/local_authority> ?T2_local_authority . FILTER(?T2_local_authority = 'Chiltern') . }
Find the id and local authority of the station with has the highest average high temperature.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_id ?T1_local_authority WHERE { ?T1 a :station . ?T2 a :weekly_weather . ?T2 :ref-station ?T1 . ?T1 :id ?T1_id . ?T1 :local_authority ?T1_local_authority . ?T2 :high_temperature ?T2_high_temperature . } GROUP BY ?T1_id ?T1_local_authority ORDER BY DESC (avg( ?T2_high_temperature)) LIMIT 1",SELECT ?T1_id ?T1_local_authority WHERE { ?T1 a <http://valuenet/ontop/station> . ?T2 a <http://valuenet/ontop/weekly_weather> . ?T2 <http://valuenet/ontop/ref-station> ?T1 . ?T1 <http://valuenet/ontop/id> ?T1_id . ?T1 <http://valuenet/ontop/local_authority> ?T1_local_authority . ?T2 <http://valuenet/ontop/high_temperature> ?T2_high_temperature . } GROUP BY ?T1_id ?T1_local_authority ORDER BY DESC (avg( ?T2_high_temperature)) LIMIT 1
show the lowest low temperature and highest wind speed in miles per hour.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_low_temperature) as ?aggregation_T1_low_temperature_81 ) (max( ?T1_wind_speed_mph) as ?aggregation_T1_wind_speed_mph_164 ) WHERE { ?T1 a :weekly_weather . ?T1 :low_temperature ?T1_low_temperature . ?T1 :wind_speed_mph ?T1_wind_speed_mph . }",SELECT (min( ?T1_low_temperature) as ?aggregation_T1_low_temperature_81 ) (max( ?T1_wind_speed_mph) as ?aggregation_T1_wind_speed_mph_164 ) WHERE { ?T1 a <http://valuenet/ontop/weekly_weather> . ?T1 <http://valuenet/ontop/low_temperature> ?T1_low_temperature . ?T1 <http://valuenet/ontop/wind_speed_mph> ?T1_wind_speed_mph . }
Find the origins from which more than 1 train starts.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_origin WHERE { ?T1 a :train . ?T1 :origin ?T1_origin . } GROUP BY ?T1_origin HAVING(count( *) > 1)",SELECT ?T1_origin WHERE { ?T1 a <http://valuenet/ontop/train> . ?T1 <http://valuenet/ontop/origin> ?T1_origin . } GROUP BY ?T1_origin HAVING(count( *) > 1)
