nl_question,sparql_partial_uri,sparql_complete_uri
Find all the distinct district names ordered by city area in descending.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_district_name ?T1_city_area WHERE { ?T1 a :district . ?T1 :district_name ?T1_district_name . ?T1 :city_area ?T1_city_area . ?T1 :city_area ?T1_city_area . } ORDER BY DESC (?T1_city_area)",SELECT DISTINCT ?T1_district_name ?T1_city_area WHERE { ?T1 a <http://valuenet/ontop/district> . ?T1 <http://valuenet/ontop/district_name> ?T1_district_name . ?T1 <http://valuenet/ontop/city_area> ?T1_city_area . ?T1 <http://valuenet/ontop/city_area> ?T1_city_area . } ORDER BY DESC (?T1_city_area)
Find the list of page size which have more than 3 product listed,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_max_page_size WHERE { ?T1 a :product . ?T1 :max_page_size ?T1_max_page_size . } GROUP BY ?T1_max_page_size HAVING(count( *) > 3)",SELECT ?T1_max_page_size WHERE { ?T1 a <http://valuenet/ontop/product> . ?T1 <http://valuenet/ontop/max_page_size> ?T1_max_page_size . } GROUP BY ?T1_max_page_size HAVING(count( *) > 3)
Find the name and population of district with population between 200000 and 2000000,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_district_name ?T1_city_population WHERE { ?T1 a :district . ?T1 :district_name ?T1_district_name . ?T1 :city_population ?T1_city_population . ?T1 :city_population ?T1_city_population . FILTER(?T1_city_population >= 200000 && ?T1_city_population <= 2000000) . }",SELECT ?T1_district_name ?T1_city_population WHERE { ?T1 a <http://valuenet/ontop/district> . ?T1 <http://valuenet/ontop/district_name> ?T1_district_name . ?T1 <http://valuenet/ontop/city_population> ?T1_city_population . ?T1 <http://valuenet/ontop/city_population> ?T1_city_population . FILTER(?T1_city_population >= 200000 && ?T1_city_population <= 2000000) . }
Find the name all districts with city area greater than 10 or population larger than 100000,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_district_name WHERE { ?T1 a :district . ?T1 :district_name ?T1_district_name . ?T1 :city_area ?T1_city_area . ?T1 :city_population ?T1_city_population . FILTER(?T1_city_area > 10 || ?T1_city_population > 100000) . }",SELECT ?T1_district_name WHERE { ?T1 a <http://valuenet/ontop/district> . ?T1 <http://valuenet/ontop/district_name> ?T1_district_name . ?T1 <http://valuenet/ontop/city_area> ?T1_city_area . ?T1 <http://valuenet/ontop/city_population> ?T1_city_population . FILTER(?T1_city_area > 10 || ?T1_city_population > 100000) . }
Find the total population of the top 3 districts with the largest area.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_city_population) as ?aggregation_T1_city_population_178 ) WHERE { ?T1 a :district . ?T1 :city_population ?T1_city_population . ?T1 :city_area ?T1_city_area . } ORDER BY DESC (?T1_city_area) LIMIT 1",SELECT (sum( ?T1_city_population) as ?aggregation_T1_city_population_178 ) WHERE { ?T1 a <http://valuenet/ontop/district> . ?T1 <http://valuenet/ontop/city_population> ?T1_city_population . ?T1 <http://valuenet/ontop/city_area> ?T1_city_area . } ORDER BY DESC (?T1_city_area) LIMIT 1
Find all types of store and number of them.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a :store . ?T1 :type ?T1_type . } GROUP BY ?T1_type",SELECT ?T1_type (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/store> . ?T1 <http://valuenet/ontop/type> ?T1_type . } GROUP BY ?T1_type
Find the names of all stores in Khanewal District.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_store_name WHERE { ?T1 a :store . ?T13 a :store_district . ?T13 :ref-store ?T1 . ?T1 :store_name ?T1_store_name . ?T2 :district_name ?T2_district_name . ?T2 a :district . ?T13 :ref-district ?T2 . ?T1 :store_name ?T1_store_name . ?T2 :district_name ?T2_district_name . FILTER(?T2_district_name = 'Khanewal District') . }",SELECT ?T1_store_name WHERE { ?T1 a <http://valuenet/ontop/store> . ?T13 a <http://valuenet/ontop/store_district> . ?T13 <http://valuenet/ontop/ref-store> ?T1 . ?T1 <http://valuenet/ontop/store_name> ?T1_store_name . ?T2 <http://valuenet/ontop/district_name> ?T2_district_name . ?T2 a <http://valuenet/ontop/district> . ?T13 <http://valuenet/ontop/ref-district> ?T2 . ?T1 <http://valuenet/ontop/store_name> ?T1_store_name . ?T2 <http://valuenet/ontop/district_name> ?T2_district_name . FILTER(?T2_district_name = 'Khanewal District') . }
Find all the stores in the district with the most population.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_store_name WHERE { ?T1 a :store . ?T2 a :store_district . ?T2 :ref-store ?T1 . ?T1 :store_name ?T1_store_name . ?T2 :district_id ?T2_district_id . FILTER(?T2_district_id = (?T23_city_population)) . {SELECT ?T23_district_id WHERE { ?T23 a :district . ?T23 :district_id ?T23_district_id . ?T23 :city_population ?T23_city_population . } ORDER BY DESC (?T23_city_population) LIMIT 1 } }",SELECT ?T1_store_name WHERE { ?T1 a <http://valuenet/ontop/store> . ?T2 a <http://valuenet/ontop/store_district> . ?T2 <http://valuenet/ontop/ref-store> ?T1 . ?T1 <http://valuenet/ontop/store_name> ?T1_store_name . ?T2 <http://valuenet/ontop/district_id> ?T2_district_id . FILTER(?T2_district_id = (?T23_city_population)) . {SELECT ?T23_district_id WHERE { ?T23 a <http://valuenet/ontop/district> . ?T23 <http://valuenet/ontop/district_id> ?T23_district_id . ?T23 <http://valuenet/ontop/city_population> ?T23_city_population . } ORDER BY DESC (?T23_city_population) LIMIT 1 } }
Find the number of stores in each city.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :ref-district ?T1 . ?T1 :headquartered_city ?T1_headquartered_city . } GROUP BY ?T1_headquartered_city",SELECT ?T1_headquartered_city (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/district> . ?T13 a <http://valuenet/ontop/store_district> . ?T13 <http://valuenet/ontop/ref-district> ?T1 . ?T1 <http://valuenet/ontop/headquartered_city> ?T1_headquartered_city . } GROUP BY ?T1_headquartered_city
Find products with max page size as 'A4' and pages per minute color smaller than 5.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product ?T1_product . ?T1 :max_page_size ?T1_max_page_size . ?T1 :pages_per_minute_color ?T1_pages_per_minute_color . FILTER(?T1_max_page_size = 'A4' && ?T1_pages_per_minute_color < 5) . }",SELECT ?T1_product WHERE { ?T1 a <http://valuenet/ontop/product> . ?T1 <http://valuenet/ontop/product> ?T1_product . ?T1 <http://valuenet/ontop/max_page_size> ?T1_max_page_size . ?T1 <http://valuenet/ontop/pages_per_minute_color> ?T1_pages_per_minute_color . FILTER(?T1_max_page_size = 'A4' && ?T1_pages_per_minute_color < 5) . }
Find all the product whose name contains the word 'Scanner'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product ?T1_product . ?T1 :product ?T1_product . FILTER(contains (?T1_product, 'Scanner')) . }","SELECT ?T1_product WHERE { ?T1 a <http://valuenet/ontop/product> . ?T1 <http://valuenet/ontop/product> ?T1_product . ?T1 <http://valuenet/ontop/product> ?T1_product . FILTER(contains (?T1_product, 'Scanner')) . }"
Find the most prominent max page size among all the products.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_max_page_size (count( *) as ?aggregation_all) WHERE { ?T1 a :product . ?T1 :max_page_size ?T1_max_page_size . } GROUP BY ?T1_max_page_size ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_max_page_size (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/product> . ?T1 <http://valuenet/ontop/max_page_size> ?T1_max_page_size . } GROUP BY ?T1_max_page_size ORDER BY DESC (?aggregation_all) LIMIT 1
Find the name of the products that are not using the most frequently-used max page size.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product WHERE { ?T1 a :product . ?T1 :product ?T1_product . ?T1 :product ?T1_product . FILTER(?T1_product != (?T22_max_page_size)) . {SELECT ?T22_max_page_size (count( *) as ?aggregation_all) WHERE { ?T22 a :product . ?T22 :max_page_size ?T22_max_page_size . } GROUP BY ?T22_max_page_size ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_product WHERE { ?T1 a <http://valuenet/ontop/product> . ?T1 <http://valuenet/ontop/product> ?T1_product . ?T1 <http://valuenet/ontop/product> ?T1_product . FILTER(?T1_product != (?T22_max_page_size)) . {SELECT ?T22_max_page_size (count( *) as ?aggregation_all) WHERE { ?T22 a <http://valuenet/ontop/product> . ?T22 <http://valuenet/ontop/max_page_size> ?T22_max_page_size . } GROUP BY ?T22_max_page_size ORDER BY DESC (?aggregation_all) LIMIT 1 } }
Find the total population of the districts where the area is bigger than the average city area.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_city_population) as ?aggregation_T1_city_population_93 ) WHERE { ?T1 a :district . ?T1 :city_population ?T1_city_population . ?T1 :city_area ?T1_city_area . FILTER(?T1_city_area > (?aggregation_T22_city_area_13)) . {SELECT (avg( ?T22_city_area) as ?aggregation_T22_city_area_13 ) WHERE { ?T22 a :district . ?T22 :city_area ?T22_city_area . } } }",SELECT (sum( ?T1_city_population) as ?aggregation_T1_city_population_93 ) WHERE { ?T1 a <http://valuenet/ontop/district> . ?T1 <http://valuenet/ontop/city_population> ?T1_city_population . ?T1 <http://valuenet/ontop/city_area> ?T1_city_area . FILTER(?T1_city_area > (?aggregation_T22_city_area_13)) . {SELECT (avg( ?T22_city_area) as ?aggregation_T22_city_area_13 ) WHERE { ?T22 a <http://valuenet/ontop/district> . ?T22 <http://valuenet/ontop/city_area> ?T22_city_area . } } }
Find the names of districts where have both city mall and village store type stores.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_district_name WHERE { ?T1 a :district . ?T13 a :store_district . ?T13 :ref-district ?T1 . ?T1 :district_name ?T1_district_name . ?T2 :type ?T2_type . ?T2 a :store . ?T13 :ref-store ?T2 . ?T1 :district_name ?T1_district_name . ?T2 :type ?T2_type . FILTER(?T2_type = 'City Mall') . FILTER (?T1_district_name in (?T3_district_name)) . ?T3 a :district . ?T15 a :store_district . ?T15 :ref-district ?T3 . ?T3 :district_name ?T3_district_name . ?T4 :type ?T4_type . ?T4 a :store . ?T15 :ref-store ?T4 . ?T3 :district_name ?T3_district_name . ?T4 :type ?T4_type . FILTER(?T4_type = 'Village Store') . }",SELECT DISTINCT ?T1_district_name WHERE { ?T1 a <http://valuenet/ontop/district> . ?T13 a <http://valuenet/ontop/store_district> . ?T13 <http://valuenet/ontop/ref-district> ?T1 . ?T1 <http://valuenet/ontop/district_name> ?T1_district_name . ?T2 <http://valuenet/ontop/type> ?T2_type . ?T2 a <http://valuenet/ontop/store> . ?T13 <http://valuenet/ontop/ref-store> ?T2 . ?T1 <http://valuenet/ontop/district_name> ?T1_district_name . ?T2 <http://valuenet/ontop/type> ?T2_type . FILTER(?T2_type = 'City Mall') . FILTER (?T1_district_name in (?T3_district_name)) . ?T3 a <http://valuenet/ontop/district> . ?T15 a <http://valuenet/ontop/store_district> . ?T15 <http://valuenet/ontop/ref-district> ?T3 . ?T3 <http://valuenet/ontop/district_name> ?T3_district_name . ?T4 <http://valuenet/ontop/type> ?T4_type . ?T4 a <http://valuenet/ontop/store> . ?T15 <http://valuenet/ontop/ref-store> ?T4 . ?T3 <http://valuenet/ontop/district_name> ?T3_district_name . ?T4 <http://valuenet/ontop/type> ?T4_type . FILTER(?T4_type = 'Village Store') . }
