nl_question,sparql_partial_uri,sparql_complete_uri
Show all region code and region name sorted by the codes.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_code ?T1_region_name WHERE { ?T1 a :region . ?T1 :region_code ?T1_region_code . ?T1 :region_name ?T1_region_name . ?T1 :region_code ?T1_region_code . } ORDER BY ASC (?T1_region_code)",SELECT ?T1_region_code ?T1_region_name WHERE { ?T1 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/region_code> ?T1_region_code . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T1 <http://valuenet/ontop/region_code> ?T1_region_code . } ORDER BY ASC (?T1_region_code)
List all region names in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region_name ?T1_region_name . ?T1 :region_name ?T1_region_name . } ORDER BY ASC (?T1_region_name)",SELECT ?T1_region_name WHERE { ?T1 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . } ORDER BY ASC (?T1_region_name)
Show names for all regions except for Denmark.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region_name ?T1_region_name . ?T1 :region_name ?T1_region_name . FILTER(?T1_region_name != 'Denmark') . }",SELECT ?T1_region_name WHERE { ?T1 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . FILTER(?T1_region_name != 'Denmark') . }
Count the number of storms in which at least 1 person died.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :storm . ?T1 :number_deaths ?T1_number_deaths . FILTER(?T1_number_deaths > 0) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/number_deaths> ?T1_number_deaths . FILTER(?T1_number_deaths > 0) . }
"List name, dates active, and number of deaths for all storms with at least 1 death.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_dates_active ?T1_number_deaths WHERE { ?T1 a :storm . ?T1 :name ?T1_name . ?T1 :dates_active ?T1_dates_active . ?T1 :number_deaths ?T1_number_deaths . ?T1 :number_deaths ?T1_number_deaths . FILTER(?T1_number_deaths >= 1) . }",SELECT ?T1_name ?T1_dates_active ?T1_number_deaths WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/dates_active> ?T1_dates_active . ?T1 <http://valuenet/ontop/number_deaths> ?T1_number_deaths . ?T1 <http://valuenet/ontop/number_deaths> ?T1_number_deaths . FILTER(?T1_number_deaths >= 1) . }
Show the average and maximum damage for all storms with max speed higher than 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_155 ) (max( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_20 ) WHERE { ?T1 a :storm . ?T1 :damage_millions_usd ?T1_damage_millions_usd . ?T1 :damage_millions_usd ?T1_damage_millions_usd . ?T1 :max_speed ?T1_max_speed . FILTER(?T1_max_speed > 1000) . }",SELECT (avg( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_155 ) (max( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_20 ) WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/damage_millions_usd> ?T1_damage_millions_usd . ?T1 <http://valuenet/ontop/damage_millions_usd> ?T1_damage_millions_usd . ?T1 <http://valuenet/ontop/max_speed> ?T1_max_speed . FILTER(?T1_max_speed > 1000) . }
Return the total number of deaths and total damange in millions for storms that had a max speed greater than the average.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_number_deaths) as ?aggregation_T1_number_deaths_168 ) (sum( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_151 ) WHERE { ?T1 a :storm . ?T1 :number_deaths ?T1_number_deaths . ?T1 :damage_millions_usd ?T1_damage_millions_usd . ?T1 :max_speed ?T1_max_speed . FILTER(?T1_max_speed > (?aggregation_T22_max_speed_83)) . {SELECT (avg( ?T22_max_speed) as ?aggregation_T22_max_speed_83 ) WHERE { ?T22 a :storm . ?T22 :max_speed ?T22_max_speed . } } }",SELECT (sum( ?T1_number_deaths) as ?aggregation_T1_number_deaths_168 ) (sum( ?T1_damage_millions_usd) as ?aggregation_T1_damage_millions_usd_151 ) WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/number_deaths> ?T1_number_deaths . ?T1 <http://valuenet/ontop/damage_millions_usd> ?T1_damage_millions_usd . ?T1 <http://valuenet/ontop/max_speed> ?T1_max_speed . FILTER(?T1_max_speed > (?aggregation_T22_max_speed_83)) . {SELECT (avg( ?T22_max_speed) as ?aggregation_T22_max_speed_83 ) WHERE { ?T22 a <http://valuenet/ontop/storm> . ?T22 <http://valuenet/ontop/max_speed> ?T22_max_speed . } } }
List name and damage for all storms in a descending order of max speed.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_damage_millions_usd WHERE { ?T1 a :storm . ?T1 :name ?T1_name . ?T1 :damage_millions_usd ?T1_damage_millions_usd . ?T1 :max_speed ?T1_max_speed . } ORDER BY DESC (?T1_max_speed)",SELECT ?T1_name ?T1_damage_millions_usd WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/damage_millions_usd> ?T1_damage_millions_usd . ?T1 <http://valuenet/ontop/max_speed> ?T1_max_speed . } ORDER BY DESC (?T1_max_speed)
Count the number of different affected regions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_region_id) as ?aggregation_T1_region_id_128 ) WHERE { ?T1 a :affected_region . ?T1 :region_id ?T1_region_id . }",SELECT DISTINCT (count(DISTINCT ?T1_region_id) as ?aggregation_T1_region_id_128 ) WHERE { ?T1 a <http://valuenet/ontop/affected_region> . ?T1 <http://valuenet/ontop/region_id> ?T1_region_id . }
Show the name for regions not affected.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_name WHERE { ?T1 a :region . ?T1 :region_name ?T1_region_name . ?T1 :region_id ?T1_region_id . FILTER(?T1_region_id not in (?T22_region_id)) . {SELECT ?T22_region_id WHERE { ?T22 a :affected_region . ?T22 :region_id ?T22_region_id . } } }",SELECT ?T1_region_name WHERE { ?T1 a <http://valuenet/ontop/region> . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T1 <http://valuenet/ontop/region_id> ?T1_region_id . FILTER(?T1_region_id not in (?T22_region_id)) . {SELECT ?T22_region_id WHERE { ?T22 a <http://valuenet/ontop/affected_region> . ?T22 <http://valuenet/ontop/region_id> ?T22_region_id . } } }
Show the name for regions and the number of storms for each region.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_name (count( *) as ?aggregation_all) WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :ref-region ?T1 . ?T1 :region_name ?T1_region_name . } GROUP BY ?T1_region_name",SELECT ?T1_region_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/region> . ?T2 a <http://valuenet/ontop/affected_region> . ?T2 <http://valuenet/ontop/ref-region> ?T1 . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . } GROUP BY ?T1_region_name
List the name for storms and the number of affected regions for each storm.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :ref-storm ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T2 a <http://valuenet/ontop/affected_region> . ?T2 <http://valuenet/ontop/ref-storm> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Return the name and max speed of the storm that affected the most regions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_max_speed WHERE { ?T1 a :storm . ?T2 a :affected_region . ?T2 :ref-storm ?T1 . ?T1 :name ?T1_name . ?T1 :max_speed ?T1_max_speed . } GROUP BY ?T1_name ?T1_max_speed ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_max_speed WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T2 a <http://valuenet/ontop/affected_region> . ?T2 <http://valuenet/ontop/ref-storm> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/max_speed> ?T1_max_speed . } GROUP BY ?T1_name ?T1_max_speed ORDER BY DESC (?aggregation_all) LIMIT 1
Show the name of storms which don't have affected region in record.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :storm . ?T1 :name ?T1_name . ?T1 :storm_id ?T1_storm_id . FILTER(?T1_storm_id not in (?T22_storm_id)) . {SELECT ?T22_storm_id WHERE { ?T22 a :affected_region . ?T22 :storm_id ?T22_storm_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/storm_id> ?T1_storm_id . FILTER(?T1_storm_id not in (?T22_storm_id)) . {SELECT ?T22_storm_id WHERE { ?T22 a <http://valuenet/ontop/affected_region> . ?T22 <http://valuenet/ontop/storm_id> ?T22_storm_id . } } }
Show all storm names except for those with at least two affected regions.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :storm . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :storm . ?T3 a :affected_region . ?T3 :ref-storm ?T2 . ?T2 :name ?T2_name . } GROUP BY ?T2_name HAVING(count( *) >= 2) } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/storm> . ?T3 a <http://valuenet/ontop/affected_region> . ?T3 <http://valuenet/ontop/ref-storm> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . } GROUP BY ?T2_name HAVING(count( *) >= 2) } }
Return the names of the regions affected by storms that had a death count of at least 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_name WHERE { ?T1 a :region . ?T13 a :affected_region . ?T13 :ref-region ?T1 . ?T1 :region_name ?T1_region_name . ?T2 :number_deaths ?T2_number_deaths . ?T2 a :storm . ?T13 :ref-storm ?T2 . ?T1 :region_name ?T1_region_name . ?T2 :number_deaths ?T2_number_deaths . FILTER(?T2_number_deaths >= 10) . }",SELECT ?T1_region_name WHERE { ?T1 a <http://valuenet/ontop/region> . ?T13 a <http://valuenet/ontop/affected_region> . ?T13 <http://valuenet/ontop/ref-region> ?T1 . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T2 <http://valuenet/ontop/number_deaths> ?T2_number_deaths . ?T2 a <http://valuenet/ontop/storm> . ?T13 <http://valuenet/ontop/ref-storm> ?T2 . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . ?T2 <http://valuenet/ontop/number_deaths> ?T2_number_deaths . FILTER(?T2_number_deaths >= 10) . }
Show all storm names affecting region 'Denmark'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :ref-storm ?T1 . ?T1 :name ?T1_name . ?T2 :region_name ?T2_region_name . ?T2 a :region . ?T13 :ref-region ?T2 . ?T1 :name ?T1_name . ?T2 :region_name ?T2_region_name . FILTER(?T2_region_name = 'Denmark') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T13 a <http://valuenet/ontop/affected_region> . ?T13 <http://valuenet/ontop/ref-storm> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . ?T2 a <http://valuenet/ontop/region> . ?T13 <http://valuenet/ontop/ref-region> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . FILTER(?T2_region_name = 'Denmark') . }
Show the region name with at least two storms.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_region_name WHERE { ?T1 a :region . ?T2 a :affected_region . ?T2 :ref-region ?T1 . ?T1 :region_name ?T1_region_name . } GROUP BY ?T1_region_name HAVING(count( *) >= 2)",SELECT ?T1_region_name WHERE { ?T1 a <http://valuenet/ontop/region> . ?T2 a <http://valuenet/ontop/affected_region> . ?T2 <http://valuenet/ontop/ref-region> ?T1 . ?T1 <http://valuenet/ontop/region_name> ?T1_region_name . } GROUP BY ?T1_region_name HAVING(count( *) >= 2)
Find the name of the storm that affected both Afghanistan and Albania regions.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :storm . ?T13 a :affected_region . ?T13 :ref-storm ?T1 . ?T1 :name ?T1_name . ?T2 :region_name ?T2_region_name . ?T2 a :region . ?T13 :ref-region ?T2 . ?T1 :name ?T1_name . ?T2 :region_name ?T2_region_name . FILTER(?T2_region_name = 'Afghanistan') . FILTER (?T1_name in (?T3_name)) . ?T3 a :storm . ?T15 a :affected_region . ?T15 :ref-storm ?T3 . ?T3 :name ?T3_name . ?T4 :region_name ?T4_region_name . ?T4 a :region . ?T15 :ref-region ?T4 . ?T3 :name ?T3_name . ?T4 :region_name ?T4_region_name . FILTER(?T4_region_name = 'Albania') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/storm> . ?T13 a <http://valuenet/ontop/affected_region> . ?T13 <http://valuenet/ontop/ref-storm> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . ?T2 a <http://valuenet/ontop/region> . ?T13 <http://valuenet/ontop/ref-region> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/region_name> ?T2_region_name . FILTER(?T2_region_name = 'Afghanistan') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/storm> . ?T15 a <http://valuenet/ontop/affected_region> . ?T15 <http://valuenet/ontop/ref-storm> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/region_name> ?T4_region_name . ?T4 a <http://valuenet/ontop/region> . ?T15 <http://valuenet/ontop/ref-region> ?T4 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/region_name> ?T4_region_name . FILTER(?T4_region_name = 'Albania') . }
