nl_question,sparql_partial_uri,sparql_complete_uri
Find the number of students in total.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :list . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . }
Find the last names of students studying in room 111.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lastname WHERE { ?T1 a :list . ?T1 :lastname ?T1_lastname . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 111) . }",SELECT ?T1_lastname WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 111) . }
Find the first names of students studying in room 108.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_firstname WHERE { ?T1 a :list . ?T1 :firstname ?T1_firstname . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 108) . }",SELECT ?T1_firstname WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 108) . }
List the first names of all the students in room 107.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_firstname WHERE { ?T1 a :list . ?T1 :firstname ?T1_firstname . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 107) . }",SELECT DISTINCT ?T1_firstname WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 107) . }
For each classroom report the grade that is taught in it. Report just the classroom number and the grade number.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_classroom ?T1_grade WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . }",SELECT DISTINCT ?T1_classroom ?T1_grade WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . }
Find the grade taught in classroom 103.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_grade WHERE { ?T1 a :list . ?T1 :grade ?T1_grade . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 103) . }",SELECT DISTINCT ?T1_grade WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/grade> ?T1_grade . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 103) . }
Find the grade studying in room 105.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_grade WHERE { ?T1 a :list . ?T1 :grade ?T1_grade . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 105) . }",SELECT DISTINCT ?T1_grade WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/grade> ?T1_grade . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 105) . }
Find the classrooms in which grade 4 is studying.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_classroom WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . FILTER(?T1_grade = 4) . }",SELECT DISTINCT ?T1_classroom WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . FILTER(?T1_grade = 4) . }
Show me the classrooms grade 5 is using.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_classroom WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . FILTER(?T1_grade = 5) . }",SELECT DISTINCT ?T1_classroom WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . FILTER(?T1_grade = 5) . }
Find the first names of all the teachers that teach in classroom 110.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_firstname WHERE { ?T1 a :teachers . ?T1 :firstname ?T1_firstname . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 110) . }",SELECT ?T1_firstname WHERE { ?T1 a <http://valuenet/ontop/teachers> . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 110) . }
Find the last names of teachers teaching in classroom 109.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lastname WHERE { ?T1 a :teachers . ?T1 :lastname ?T1_lastname . ?T1 :classroom ?T1_classroom . FILTER(?T1_classroom = 109) . }",SELECT ?T1_lastname WHERE { ?T1 a <http://valuenet/ontop/teachers> . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . FILTER(?T1_classroom = 109) . }
Report the first name and last name of all the teachers.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a :teachers . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . }",SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a <http://valuenet/ontop/teachers> . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . }
Report the first name and last name of all the students.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a :list . ?T1 :firstname ?T1_firstname . ?T1 :lastname ?T1_lastname . }",SELECT DISTINCT ?T1_firstname ?T1_lastname WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/firstname> ?T1_firstname . ?T1 <http://valuenet/ontop/lastname> ?T1_lastname . }
"For each grade, report the grade, the number of classrooms in which it is taught and the total number of students in the grade.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_grade (count(DISTINCT ?T1_classroom) as ?aggregation_T1_classroom_190 ) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :grade ?T1_grade . ?T1 :classroom ?T1_classroom . } GROUP BY ?T1_grade",SELECT DISTINCT ?T1_grade (count(DISTINCT ?T1_classroom) as ?aggregation_T1_classroom_190 ) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/grade> ?T1_grade . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . } GROUP BY ?T1_grade
"For each grade, return the grade number, the number of classrooms used for the grade, and the total number of students enrolled in the grade.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_grade (count(DISTINCT ?T1_classroom) as ?aggregation_T1_classroom_187 ) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :grade ?T1_grade . ?T1 :classroom ?T1_classroom . } GROUP BY ?T1_grade",SELECT DISTINCT ?T1_grade (count(DISTINCT ?T1_classroom) as ?aggregation_T1_classroom_187 ) (count(DISTINCT *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/grade> ?T1_grade . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . } GROUP BY ?T1_grade
"For each classroom, report the classroom number and the number of grades using it.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_classroom (count(DISTINCT ?T1_grade) as ?aggregation_T1_grade_0 ) WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . } GROUP BY ?T1_classroom",SELECT DISTINCT ?T1_classroom (count(DISTINCT ?T1_grade) as ?aggregation_T1_grade_0 ) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . } GROUP BY ?T1_classroom
"For each classroom, show the classroom number and count the number of distinct grades that use the room.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_classroom (count(DISTINCT ?T1_grade) as ?aggregation_T1_grade_184 ) WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . } GROUP BY ?T1_classroom",SELECT DISTINCT ?T1_classroom (count(DISTINCT ?T1_grade) as ?aggregation_T1_grade_184 ) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . } GROUP BY ?T1_classroom
Find the classroom that the most students use.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . } GROUP BY ?T1_classroom ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . } GROUP BY ?T1_classroom ORDER BY DESC (?aggregation_all) LIMIT 1
Report the number of students in each classroom.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . } GROUP BY ?T1_classroom",SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . } GROUP BY ?T1_classroom
"For each grade 0 classroom, report the total number of students.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . FILTER(?T1_grade = 0) . } GROUP BY ?T1_classroom",SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . FILTER(?T1_grade = 0) . } GROUP BY ?T1_classroom
Report the total number of students for each fourth-grade classroom.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . ?T1 :grade ?T1_grade . FILTER(?T1_grade = 4) . } GROUP BY ?T1_classroom",SELECT ?T1_classroom (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . ?T1 <http://valuenet/ontop/grade> ?T1_grade . FILTER(?T1_grade = 4) . } GROUP BY ?T1_classroom
Find the number of students in one classroom.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T1_classroom WHERE { ?T1 a :list . ?T1 :classroom ?T1_classroom . } GROUP BY ?T1_classroom",SELECT (count( *) as ?aggregation_all) ?T1_classroom WHERE { ?T1 a <http://valuenet/ontop/list> . ?T1 <http://valuenet/ontop/classroom> ?T1_classroom . } GROUP BY ?T1_classroom
