nl_question,sparql_partial_uri,sparql_complete_uri
List all the event names by year from the most recent to the oldest.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :event . ?T1 :name ?T1_name . ?T1 :year ?T1_year . } ORDER BY DESC (?T1_year)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/event> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/year> ?T1_year . } ORDER BY DESC (?T1_year)
Find the name of the stadium that has the maximum capacity.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :name ?T1_name . ?T1 :capacity ?T1_capacity . } ORDER BY DESC (?T1_capacity) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . } ORDER BY DESC (?T1_capacity) LIMIT 1
Find the names of stadiums whose capacity is smaller than the average capacity.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :name ?T1_name . ?T1 :capacity ?T1_capacity . FILTER(?T1_capacity < (?aggregation_T22_capacity_157)) . {SELECT (avg( ?T22_capacity) as ?aggregation_T22_capacity_157 ) WHERE { ?T22 a :stadium . ?T22 :capacity ?T22_capacity . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . FILTER(?T1_capacity < (?aggregation_T22_capacity_157)) . {SELECT (avg( ?T22_capacity) as ?aggregation_T22_capacity_157 ) WHERE { ?T22 a <http://valuenet/ontop/stadium> . ?T22 <http://valuenet/ontop/capacity> ?T22_capacity . } } }
Find the country that has the most stadiums.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T1 :country ?T1_country . } GROUP BY ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1
"Find the names of all swimmers, sorted by their 100 meter scores in ascending order.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T1 :name ?T1_name . ?T1 :meter_100 ?T1_meter_100 . } ORDER BY ASC (?T1_meter_100)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/meter_100> ?T1_meter_100 . } ORDER BY ASC (?T1_meter_100)
List countries that have more than one swimmer.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a :swimmer . ?T1 :nationality ?T1_nationality . } GROUP BY ?T1_nationality HAVING(count( *) > 1)",SELECT ?T1_nationality (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . } GROUP BY ?T1_nationality HAVING(count( *) > 1)
Find all 200 meter and 300 meter results of swimmers with nationality 'Australia'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_meter_200 ?T1_meter_300 WHERE { ?T1 a :swimmer . ?T1 :meter_200 ?T1_meter_200 . ?T1 :meter_300 ?T1_meter_300 . ?T1 :nationality ?T1_nationality . FILTER(?T1_nationality = 'Australia') . }",SELECT ?T1_meter_200 ?T1_meter_300 WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T1 <http://valuenet/ontop/meter_200> ?T1_meter_200 . ?T1 <http://valuenet/ontop/meter_300> ?T1_meter_300 . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . FILTER(?T1_nationality = 'Australia') . }
Find the names of swimmers who has a result of 'win'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :ref-swimmer ?T1 . ?T1 :name ?T1_name . ?T2 :result ?T2_result . FILTER(?T2_result = 'Win') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T2 a <http://valuenet/ontop/record> . ?T2 <http://valuenet/ontop/ref-swimmer> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/result> ?T2_result . FILTER(?T2_result = 'Win') . }
Find the name and capacity of the stadium where the event named 'World Junior' happened.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_capacity WHERE { ?T1 a :stadium . ?T2 a :event . ?T2 :ref-stadium ?T1 . ?T1 :name ?T1_name . ?T1 :capacity ?T1_capacity . ?T2 :name ?T2_name . FILTER(?T2_name = 'World Junior') . }",SELECT ?T1_name ?T1_capacity WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T2 a <http://valuenet/ontop/event> . ?T2 <http://valuenet/ontop/ref-stadium> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/capacity> ?T1_capacity . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'World Junior') . }
Find the names of stadiums which have never had any event.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :stadium . ?T1 :name ?T1_name . ?T1 :id ?T1_id . FILTER(?T1_id not in (?T22_stadium_id)) . {SELECT ?T22_stadium_id WHERE { ?T22 a :event . ?T22 :stadium_id ?T22_stadium_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/id> ?T1_id . FILTER(?T1_id not in (?T22_stadium_id)) . {SELECT ?T22_stadium_id WHERE { ?T22 a <http://valuenet/ontop/event> . ?T22 <http://valuenet/ontop/stadium_id> ?T22_stadium_id . } } }
Find the name of the swimmer who has the most records.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :ref-swimmer ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T2 a <http://valuenet/ontop/record> . ?T2 <http://valuenet/ontop/ref-swimmer> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the name of the swimmer who has at least 2 records.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :ref-swimmer ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T2 a <http://valuenet/ontop/record> . ?T2 <http://valuenet/ontop/ref-swimmer> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)
"Find the name and nationality of the swimmer who has won (i.e., has a result of 'win') more than 1 time.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_nationality WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :ref-swimmer ?T1 . ?T1 :name ?T1_name . ?T1 :nationality ?T1_nationality . ?T2 :result ?T2_result . FILTER(?T2_result = 'Win') . } GROUP BY ?T1_name ?T1_nationality HAVING(count( *) > 1)",SELECT ?T1_name ?T1_nationality WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T2 a <http://valuenet/ontop/record> . ?T2 <http://valuenet/ontop/ref-swimmer> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/nationality> ?T1_nationality . ?T2 <http://valuenet/ontop/result> ?T2_result . FILTER(?T2_result = 'Win') . } GROUP BY ?T1_name ?T1_nationality HAVING(count( *) > 1)
Find the names of the swimmers who have no record.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :swimmer . ?T1 :name ?T1_name . ?T1 :id ?T1_id . FILTER(?T1_id not in (?T22_swimmer_id)) . {SELECT ?T22_swimmer_id WHERE { ?T22 a :record . ?T22 :swimmer_id ?T22_swimmer_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/id> ?T1_id . FILTER(?T1_id not in (?T22_swimmer_id)) . {SELECT ?T22_swimmer_id WHERE { ?T22 a <http://valuenet/ontop/record> . ?T22 <http://valuenet/ontop/swimmer_id> ?T22_swimmer_id . } } }
Find the names of the swimmers who have both 'win' and 'loss' results in the record.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_name WHERE { ?T1 a :swimmer . ?T2 a :record . ?T2 :ref-swimmer ?T1 . ?T1 :name ?T1_name . ?T2 :result ?T2_result . FILTER(?T2_result = 'Win') . FILTER (?T1_name in (?T3_name)) . ?T3 a :swimmer . ?T4 a :record . ?T4 :ref-swimmer ?T3 . ?T3 :name ?T3_name . ?T4 :result ?T4_result . FILTER(?T4_result = 'Loss') . }",SELECT DISTINCT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/swimmer> . ?T2 a <http://valuenet/ontop/record> . ?T2 <http://valuenet/ontop/ref-swimmer> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/result> ?T2_result . FILTER(?T2_result = 'Win') . FILTER (?T1_name in (?T3_name)) . ?T3 a <http://valuenet/ontop/swimmer> . ?T4 a <http://valuenet/ontop/record> . ?T4 <http://valuenet/ontop/ref-swimmer> ?T3 . ?T3 <http://valuenet/ontop/name> ?T3_name . ?T4 <http://valuenet/ontop/result> ?T4_result . FILTER(?T4_result = 'Loss') . }
Find the names of stadiums that some Australian swimmers have been to.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :stadium . ?T13 a :event . ?T13 :ref-stadium ?T1 . ?T1 :name ?T1_name . ?T2 :nationality ?T2_nationality . ?T14 a :record . ?T14 :ref-event ?T13 . ?T1 :name ?T1_name . ?T2 :nationality ?T2_nationality . ?T2 a :swimmer . ?T14 :ref-swimmer ?T2 . ?T1 :name ?T1_name . ?T2 :nationality ?T2_nationality . FILTER(?T2_nationality = 'Australia') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T13 a <http://valuenet/ontop/event> . ?T13 <http://valuenet/ontop/ref-stadium> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/nationality> ?T2_nationality . ?T14 a <http://valuenet/ontop/record> . ?T14 <http://valuenet/ontop/ref-event> ?T13 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/nationality> ?T2_nationality . ?T2 a <http://valuenet/ontop/swimmer> . ?T14 <http://valuenet/ontop/ref-swimmer> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/nationality> ?T2_nationality . FILTER(?T2_nationality = 'Australia') . }
Find the names of stadiums that the most swimmers have been to.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :stadium . ?T13 a :event . ?T13 :ref-stadium ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/stadium> . ?T13 a <http://valuenet/ontop/event> . ?T13 <http://valuenet/ontop/ref-stadium> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find all details for each swimmer.,"PREFIX : <http://valuenet/ontop/>
SELECT * WHERE { ?T1 a :swimmer . }",SELECT * WHERE { ?T1 a <http://valuenet/ontop/swimmer> . }
