nl_question,sparql_partial_uri,sparql_complete_uri
"Show all artist name, age, and country ordered by the yeared they joined.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_age ?T1_country WHERE { ?T1 a :artist . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :country ?T1_country . ?T1 :year_join ?T1_year_join . } ORDER BY ASC (?T1_year_join)",SELECT ?T1_name ?T1_age ?T1_country WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/year_join> ?T1_year_join . } ORDER BY ASC (?T1_year_join)
Return the different countries for artists.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :artist . ?T1 :country ?T1_country . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/country> ?T1_country . }
Show all artist names and the year joined who are not from United States.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_year_join WHERE { ?T1 a :artist . ?T1 :name ?T1_name . ?T1 :year_join ?T1_year_join . ?T1 :country ?T1_country . FILTER(?T1_country != 'United States') . }",SELECT ?T1_name ?T1_year_join WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/year_join> ?T1_year_join . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country != 'United States') . }
Count the number of artists who are older than 46 and joined after 1990.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T1 :age ?T1_age . ?T1 :year_join ?T1_year_join . FILTER(?T1_age > 46 && ?T1_year_join > 1990) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/year_join> ?T1_year_join . FILTER(?T1_age > 46 && ?T1_year_join > 1990) . }
What is the average and minimum age of all artists from United States.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_93 ) (min( ?T1_age) as ?aggregation_T1_age_161 ) WHERE { ?T1 a :artist . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :country ?T1_country . FILTER(?T1_country = 'United States') . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_93 ) (min( ?T1_age) as ?aggregation_T1_age_161 ) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country = 'United States') . }
Return the average and minimum ages across artists from the United States.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_age) as ?aggregation_T1_age_31 ) (min( ?T1_age) as ?aggregation_T1_age_91 ) WHERE { ?T1 a :artist . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :country ?T1_country . FILTER(?T1_country = 'United States') . }",SELECT (avg( ?T1_age) as ?aggregation_T1_age_31 ) (min( ?T1_age) as ?aggregation_T1_age_91 ) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T1_country = 'United States') . }
Return the name of the artist who has the latest join year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :name ?T1_name . ?T1 :year_join ?T1_year_join . } ORDER BY DESC (?T1_year_join) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/year_join> ?T1_year_join . } ORDER BY DESC (?T1_year_join) LIMIT 1
Count the number of exhibitions that happened in or after 2005.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :exhibition . ?T1 :year ?T1_year . FILTER(?T1_year >= 2005) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year >= 2005) . }
Show theme and year for all exhibitions with ticket prices lower than 15.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_theme ?T1_year WHERE { ?T1 a :exhibition . ?T1 :theme ?T1_theme . ?T1 :year ?T1_year . ?T1 :ticket_price ?T1_ticket_price . FILTER(?T1_ticket_price < 15) . }",SELECT ?T1_theme ?T1_year WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/ticket_price> ?T1_ticket_price . FILTER(?T1_ticket_price < 15) . }
Show all artist names and the number of exhibitions for each artist.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :ref-artist ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/exhibition> . ?T2 <http://valuenet/ontop/ref-artist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Return the name and country corresponding to the artist who has had the most exhibitions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_country WHERE { ?T1 a :artist . ?T2 a :exhibition . ?T2 :ref-artist ?T1 . ?T1 :name ?T1_name . ?T1 :country ?T1_country . } GROUP BY ?T1_name ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_name (count( *) as ?aggregation_all) ?T1_country WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T2 a <http://valuenet/ontop/exhibition> . ?T2 <http://valuenet/ontop/ref-artist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_name ?T1_country ORDER BY DESC (?aggregation_all) LIMIT 1
Show names for artists without any exhibition.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artist . ?T1 :name ?T1_name . ?T1 :artist_id ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) . {SELECT ?T22_artist_id WHERE { ?T22 a :exhibition . ?T22 :artist_id ?T22_artist_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/artist_id> ?T1_artist_id . FILTER(?T1_artist_id not in (?T22_artist_id)) . {SELECT ?T22_artist_id WHERE { ?T22 a <http://valuenet/ontop/exhibition> . ?T22 <http://valuenet/ontop/artist_id> ?T22_artist_id . } } }
Return the names of artists and the themes of their exhibitions that had a ticket price higher than average.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_theme ?T2_name WHERE { ?T1 a :exhibition . ?T2 a :artist . ?T1 :ref-artist ?T2 . ?T1 :theme ?T1_theme . ?T2 :name ?T2_name . ?T1 :ticket_price ?T1_ticket_price . FILTER(?T1_ticket_price > (?aggregation_T23_ticket_price_15)) . {SELECT (avg( ?T23_ticket_price) as ?aggregation_T23_ticket_price_15 ) WHERE { ?T23 a :exhibition . ?T23 :ticket_price ?T23_ticket_price . } } }",SELECT ?T1_theme ?T2_name WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T2 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/ref-artist> ?T2 . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T1 <http://valuenet/ontop/ticket_price> ?T1_ticket_price . FILTER(?T1_ticket_price > (?aggregation_T23_ticket_price_15)) . {SELECT (avg( ?T23_ticket_price) as ?aggregation_T23_ticket_price_15 ) WHERE { ?T23 a <http://valuenet/ontop/exhibition> . ?T23 <http://valuenet/ontop/ticket_price> ?T23_ticket_price . } } }
"Show the average, minimum, and maximum ticket prices for exhibitions for all years before 2009.","PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_ticket_price) as ?aggregation_T1_ticket_price_28 ) (min( ?T1_ticket_price) as ?aggregation_T1_ticket_price_134 ) (max( ?T1_ticket_price) as ?aggregation_T1_ticket_price_156 ) WHERE { ?T1 a :exhibition . ?T1 :ticket_price ?T1_ticket_price . ?T1 :ticket_price ?T1_ticket_price . ?T1 :ticket_price ?T1_ticket_price . ?T1 :year ?T1_year . FILTER(?T1_year < 2009) . }",SELECT (avg( ?T1_ticket_price) as ?aggregation_T1_ticket_price_28 ) (min( ?T1_ticket_price) as ?aggregation_T1_ticket_price_134 ) (max( ?T1_ticket_price) as ?aggregation_T1_ticket_price_156 ) WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T1 <http://valuenet/ontop/ticket_price> ?T1_ticket_price . ?T1 <http://valuenet/ontop/ticket_price> ?T1_ticket_price . ?T1 <http://valuenet/ontop/ticket_price> ?T1_ticket_price . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year < 2009) . }
Show theme and year for all exhibitions in an descending order of ticket price.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_theme ?T1_year WHERE { ?T1 a :exhibition . ?T1 :theme ?T1_theme . ?T1 :year ?T1_year . ?T1 :ticket_price ?T1_ticket_price . } ORDER BY DESC (?T1_ticket_price)",SELECT ?T1_theme ?T1_year WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T1 <http://valuenet/ontop/year> ?T1_year . ?T1 <http://valuenet/ontop/ticket_price> ?T1_ticket_price . } ORDER BY DESC (?T1_ticket_price)
"Return the themes, dates, and attendance for exhibitions that happened in 2004.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_theme ?T2_date ?T2_attendance WHERE { ?T1 a :exhibition . ?T2 a :exhibition_record . ?T2 :ref-exhibition ?T1 . ?T1 :theme ?T1_theme . ?T2 :date ?T2_date . ?T2 :attendance ?T2_attendance . ?T1 :year ?T1_year . FILTER(?T1_year = 2004) . }",SELECT ?T1_theme ?T2_date ?T2_attendance WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T2 a <http://valuenet/ontop/exhibition_record> . ?T2 <http://valuenet/ontop/ref-exhibition> ?T1 . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T2 <http://valuenet/ontop/date> ?T2_date . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . ?T1 <http://valuenet/ontop/year> ?T1_year . FILTER(?T1_year = 2004) . }
Show all artist names who didn't have an exhibition in 2004.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :artist . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :artist . ?T3 a :exhibition . ?T3 :ref-artist ?T2 . ?T2 :name ?T2_name . ?T3 :year ?T3_year . FILTER(?T3_year = 2004) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/artist> . ?T3 a <http://valuenet/ontop/exhibition> . ?T3 <http://valuenet/ontop/ref-artist> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/year> ?T3_year . FILTER(?T3_year = 2004) . } } }
Show the theme for exhibitions with both records of an attendance below 100 and above 500.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_theme WHERE { ?T1 a :exhibition . ?T2 a :exhibition_record . ?T2 :ref-exhibition ?T1 . ?T1 :theme ?T1_theme . ?T2 :attendance ?T2_attendance . FILTER(?T2_attendance < 100) . FILTER (?T1_theme in (?T3_theme)) . ?T3 a :exhibition . ?T4 a :exhibition_record . ?T4 :ref-exhibition ?T3 . ?T3 :theme ?T3_theme . ?T4 :attendance ?T4_attendance . FILTER(?T4_attendance > 500) . }",SELECT DISTINCT ?T1_theme WHERE { ?T1 a <http://valuenet/ontop/exhibition> . ?T2 a <http://valuenet/ontop/exhibition_record> . ?T2 <http://valuenet/ontop/ref-exhibition> ?T1 . ?T1 <http://valuenet/ontop/theme> ?T1_theme . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . FILTER(?T2_attendance < 100) . FILTER (?T1_theme in (?T3_theme)) . ?T3 a <http://valuenet/ontop/exhibition> . ?T4 a <http://valuenet/ontop/exhibition_record> . ?T4 <http://valuenet/ontop/ref-exhibition> ?T3 . ?T3 <http://valuenet/ontop/theme> ?T3_theme . ?T4 <http://valuenet/ontop/attendance> ?T4_attendance . FILTER(?T4_attendance > 500) . }
Count the number of exhibitions that have had an attendnance of over 100 or a ticket prices under 10.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :exhibition_record . ?T2 a :exhibition . ?T1 :ref-exhibition ?T2 . ?T1 :attendance ?T1_attendance . ?T2 :ticket_price ?T2_ticket_price . FILTER(?T1_attendance > 100 || ?T2_ticket_price < 10) . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/exhibition_record> . ?T2 a <http://valuenet/ontop/exhibition> . ?T1 <http://valuenet/ontop/ref-exhibition> ?T2 . ?T1 <http://valuenet/ontop/attendance> ?T1_attendance . ?T2 <http://valuenet/ontop/ticket_price> ?T2_ticket_price . FILTER(?T1_attendance > 100 || ?T2_ticket_price < 10) . }
Show all artist names with an average exhibition attendance over 200.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :artist . ?T13 a :exhibition . ?T13 :ref-artist ?T1 . ?T1 :name ?T1_name . ?T2 :attendance ?T2_attendance . ?T2 a :exhibition_record . ?T2 :ref-exhibition ?T13 . ?T1 :name ?T1_name . ?T2 :attendance ?T2_attendance . } GROUP BY ?T1_name HAVING(avg( ?T2_attendance) > 200)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/artist> . ?T13 a <http://valuenet/ontop/exhibition> . ?T13 <http://valuenet/ontop/ref-artist> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . ?T2 a <http://valuenet/ontop/exhibition_record> . ?T2 <http://valuenet/ontop/ref-exhibition> ?T13 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/attendance> ?T2_attendance . } GROUP BY ?T1_name HAVING(avg( ?T2_attendance) > 200)
