nl_question,sparql_partial_uri,sparql_complete_uri
List the project details of the project both producing patent and paper as outcomes.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_project_details WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :ref-project ?T1 . ?T1 :project_details ?T1_project_details . ?T2 :outcome_code ?T2_outcome_code . FILTER(?T2_outcome_code = 'Paper') . FILTER (?T1_project_details in (?T3_project_details)) . ?T3 a :projects . ?T4 a :project_outcomes . ?T4 :ref-project ?T3 . ?T3 :project_details ?T3_project_details . ?T4 :outcome_code ?T4_outcome_code . FILTER(?T4_outcome_code = 'Patent') . }",SELECT DISTINCT ?T1_project_details WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T2 a <http://valuenet/ontop/project_outcomes> . ?T2 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T2 <http://valuenet/ontop/outcome_code> ?T2_outcome_code . FILTER(?T2_outcome_code = 'Paper') . FILTER (?T1_project_details in (?T3_project_details)) . ?T3 a <http://valuenet/ontop/projects> . ?T4 a <http://valuenet/ontop/project_outcomes> . ?T4 <http://valuenet/ontop/ref-project> ?T3 . ?T3 <http://valuenet/ontop/project_details> ?T3_project_details . ?T4 <http://valuenet/ontop/outcome_code> ?T4_outcome_code . FILTER(?T4_outcome_code = 'Patent') . }
List from which date and to which date these staff work: project staff of the project which hires the most staffs,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1?col2 WHERE { { SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a :project_staff . ?T1 :date_from ?T1_date_from . ?T1 :date_to ?T1_date_to . ?T1 :project_id ?T1_project_id . FILTER(?T1_project_id in (?T22_project_id)) . }} UNION {SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a :project_staff . ?T1 :date_from ?T1_date_from . ?T1 :date_to ?T1_date_to . ?T1 :role_code ?T1_role_code . FILTER(?T1_role_code = 'leader') . } } }",SELECT distinct?col1?col2 WHERE { { SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a <http://valuenet/ontop/project_staff> . ?T1 <http://valuenet/ontop/date_from> ?T1_date_from . ?T1 <http://valuenet/ontop/date_to> ?T1_date_to . ?T1 <http://valuenet/ontop/project_id> ?T1_project_id . FILTER(?T1_project_id in (?T22_project_id)) . }} UNION {SELECT (?T1_date_from as ?col1) (?T1_date_to as ?col2) WHERE { ?T1 a <http://valuenet/ontop/project_staff> . ?T1 <http://valuenet/ontop/date_from> ?T1_date_from . ?T1 <http://valuenet/ontop/date_to> ?T1_date_to . ?T1 <http://valuenet/ontop/role_code> ?T1_role_code . FILTER(?T1_role_code = 'leader') . } } }
Find the organisation ids and details of the organisations which are involved in,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_organisation_id ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :grants . ?T2 :ref-organisation ?T1 . ?T1 :organisation_id ?T1_organisation_id . ?T1 :organisation_details ?T1_organisation_details . ?T2 :grant_amount ?T2_grant_amount . } GROUP BY ?T1_organisation_id ?T1_organisation_details HAVING(sum( ?T2_grant_amount) > 6000)",SELECT ?T1_organisation_id ?T1_organisation_details WHERE { ?T1 a <http://valuenet/ontop/organisations> . ?T2 a <http://valuenet/ontop/grants> . ?T2 <http://valuenet/ontop/ref-organisation> ?T1 . ?T1 <http://valuenet/ontop/organisation_id> ?T1_organisation_id . ?T1 <http://valuenet/ontop/organisation_details> ?T1_organisation_details . ?T2 <http://valuenet/ontop/grant_amount> ?T2_grant_amount . } GROUP BY ?T1_organisation_id ?T1_organisation_details HAVING(sum( ?T2_grant_amount) > 6000)
Find out the send dates of the documents with the grant amount of more than 5000 were granted by organisation type described,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_sent_date WHERE { ?T1 a :documents . ?T2 a :grants . ?T1 :ref-grant ?T2 . ?T1 :sent_date ?T1_sent_date . ?T2 :grant_amount ?T2_grant_amount . ?T3 :organisation_type_description ?T3_organisation_type_description . ?T14 a :organisations . ?T2 :ref-organisation ?T14 . ?T1 :sent_date ?T1_sent_date . ?T2 :grant_amount ?T2_grant_amount . ?T3 :organisation_type_description ?T3_organisation_type_description . ?T3 a :organisation_types . ?T14 :ref-organisation_type ?T3 . ?T1 :sent_date ?T1_sent_date . ?T2 :grant_amount ?T2_grant_amount . ?T3 :organisation_type_description ?T3_organisation_type_description . FILTER(?T2_grant_amount > 5000 && ?T3_organisation_type_description = 'Research') . }",SELECT ?T1_sent_date WHERE { ?T1 a <http://valuenet/ontop/documents> . ?T2 a <http://valuenet/ontop/grants> . ?T1 <http://valuenet/ontop/ref-grant> ?T2 . ?T1 <http://valuenet/ontop/sent_date> ?T1_sent_date . ?T2 <http://valuenet/ontop/grant_amount> ?T2_grant_amount . ?T3 <http://valuenet/ontop/organisation_type_description> ?T3_organisation_type_description . ?T14 a <http://valuenet/ontop/organisations> . ?T2 <http://valuenet/ontop/ref-organisation> ?T14 . ?T1 <http://valuenet/ontop/sent_date> ?T1_sent_date . ?T2 <http://valuenet/ontop/grant_amount> ?T2_grant_amount . ?T3 <http://valuenet/ontop/organisation_type_description> ?T3_organisation_type_description . ?T3 a <http://valuenet/ontop/organisation_types> . ?T14 <http://valuenet/ontop/ref-organisation_type> ?T3 . ?T1 <http://valuenet/ontop/sent_date> ?T1_sent_date . ?T2 <http://valuenet/ontop/grant_amount> ?T2_grant_amount . ?T3 <http://valuenet/ontop/organisation_type_description> ?T3_organisation_type_description . FILTER(?T2_grant_amount > 5000 && ?T3_organisation_type_description = 'Research') . }
List the project details of the projects which did not hire any staff for a researcher role.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :project_details ?T1_project_details . ?T1 :project_id ?T1_project_id . FILTER(?T1_project_id not in (?T22_role_code)) . {SELECT ?T22_project_id WHERE { ?T22 a :project_staff . ?T22 :project_id ?T22_project_id . ?T22 :role_code ?T22_role_code . FILTER(?T22_role_code = 'researcher') . } } }",SELECT ?T1_project_details WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T1 <http://valuenet/ontop/project_id> ?T1_project_id . FILTER(?T1_project_id not in (?T22_role_code)) . {SELECT ?T22_project_id WHERE { ?T22 a <http://valuenet/ontop/project_staff> . ?T22 <http://valuenet/ontop/project_id> ?T22_project_id . ?T22 <http://valuenet/ontop/role_code> ?T22_role_code . FILTER(?T22_role_code = 'researcher') . } } }
What is the total amount of grants given by each organisations? Also list the organisation id.,"PREFIX : <http://valuenet/ontop/>
SELECT (sum( ?T1_grant_amount) as ?aggregation_T1_grant_amount_81 ) ?T1_organisation_id WHERE { ?T1 a :grants . ?T1 :grant_amount ?T1_grant_amount . ?T1 :organisation_id ?T1_organisation_id . } GROUP BY ?T1_organisation_id",SELECT (sum( ?T1_grant_amount) as ?aggregation_T1_grant_amount_81 ) ?T1_organisation_id WHERE { ?T1 a <http://valuenet/ontop/grants> . ?T1 <http://valuenet/ontop/grant_amount> ?T1_grant_amount . ?T1 <http://valuenet/ontop/organisation_id> ?T1_organisation_id . } GROUP BY ?T1_organisation_id
List the project details of the projects with the research outcome described with the substring 'Published'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T13 a :project_outcomes . ?T13 :ref-project ?T1 . ?T1 :project_details ?T1_project_details . ?T2 :outcome_description ?T2_outcome_description . ?T2 a :research_outcomes . ?T13 :ref-outcome_code ?T2 . ?T1 :project_details ?T1_project_details . ?T2 :outcome_description ?T2_outcome_description . FILTER(contains (?T2_outcome_description, 'Published')) . }","SELECT ?T1_project_details WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T13 a <http://valuenet/ontop/project_outcomes> . ?T13 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T2 <http://valuenet/ontop/outcome_description> ?T2_outcome_description . ?T2 a <http://valuenet/ontop/research_outcomes> . ?T13 <http://valuenet/ontop/ref-outcome_code> ?T2 . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T2 <http://valuenet/ontop/outcome_description> ?T2_outcome_description . FILTER(contains (?T2_outcome_description, 'Published')) . }"
How many staff does each project has? List the project id and the number in an ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a :project_staff . ?T2 a :projects . ?T1 :ref-project ?T2 . ?T1 :project_id ?T1_project_id . } GROUP BY ?T1_project_id ORDER BY ASC (count( *))",SELECT ?T1_project_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/project_staff> . ?T2 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/ref-project> ?T2 . ?T1 <http://valuenet/ontop/project_id> ?T1_project_id . } GROUP BY ?T1_project_id ORDER BY ASC (count( *))
What is the complete description of the researcher role.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_role_description WHERE { ?T1 a :staff_roles . ?T1 :role_description ?T1_role_description . ?T1 :role_code ?T1_role_code . FILTER(?T1_role_code = 'researcher') . }",SELECT ?T1_role_description WHERE { ?T1 a <http://valuenet/ontop/staff_roles> . ?T1 <http://valuenet/ontop/role_description> ?T1_role_description . ?T1 <http://valuenet/ontop/role_code> ?T1_role_code . FILTER(?T1_role_code = 'researcher') . }
Which project made the most number of outcomes? List the project details and the project id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a :projects . ?T2 a :project_outcomes . ?T2 :ref-project ?T1 . ?T1 :project_details ?T1_project_details . ?T1 :project_id ?T1_project_id . } GROUP BY ?T1_project_details ?T1_project_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_project_details (count( *) as ?aggregation_all) ?T1_project_id WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T2 a <http://valuenet/ontop/project_outcomes> . ?T2 <http://valuenet/ontop/ref-project> ?T1 . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T1 <http://valuenet/ontop/project_id> ?T1_project_id . } GROUP BY ?T1_project_details ?T1_project_id ORDER BY DESC (?aggregation_all) LIMIT 1
Which projects have no outcome? List the project details.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :project_details ?T1_project_details . ?T1 :project_id ?T1_project_id . FILTER(?T1_project_id not in (?T22_project_id)) . {SELECT ?T22_project_id WHERE { ?T22 a :project_outcomes . ?T22 :project_id ?T22_project_id . } } }",SELECT ?T1_project_details WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T1 <http://valuenet/ontop/project_id> ?T1_project_id . FILTER(?T1_project_id not in (?T22_project_id)) . {SELECT ?T22_project_id WHERE { ?T22 a <http://valuenet/ontop/project_outcomes> . ?T22 <http://valuenet/ontop/project_id> ?T22_project_id . } } }
"Which organisation hired the most number of research staff? List the organisation id, type and detail.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_organisation_id (count( *) as ?aggregation_all) ?T1_organisation_type ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :research_staff . ?T2 :ref-employer_organisation ?T1 . ?T1 :organisation_id ?T1_organisation_id . ?T1 :organisation_type ?T1_organisation_type . ?T1 :organisation_details ?T1_organisation_details . } GROUP BY ?T1_organisation_id ?T1_organisation_type ?T1_organisation_details ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_organisation_id (count( *) as ?aggregation_all) ?T1_organisation_type ?T1_organisation_details WHERE { ?T1 a <http://valuenet/ontop/organisations> . ?T2 a <http://valuenet/ontop/research_staff> . ?T2 <http://valuenet/ontop/ref-employer_organisation> ?T1 . ?T1 <http://valuenet/ontop/organisation_id> ?T1_organisation_id . ?T1 <http://valuenet/ontop/organisation_type> ?T1_organisation_type . ?T1 <http://valuenet/ontop/organisation_details> ?T1_organisation_details . } GROUP BY ?T1_organisation_id ?T1_organisation_type ?T1_organisation_details ORDER BY DESC (?aggregation_all) LIMIT 1
"For grants with both documents described as 'Regular' and documents described as 'Initial Application', list its start date.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_grant_start_date WHERE { ?T1 a :grants . ?T13 a :documents . ?T13 :ref-grant ?T1 . ?T1 :grant_start_date ?T1_grant_start_date . ?T2 :document_description ?T2_document_description . ?T2 a :document_types . ?T13 :ref-document_type_code ?T2 . ?T1 :grant_start_date ?T1_grant_start_date . ?T2 :document_description ?T2_document_description . FILTER(?T2_document_description = 'Regular') . FILTER (?T1_grant_start_date in (?T3_grant_start_date)) . ?T3 a :grants . ?T15 a :documents . ?T15 :ref-grant ?T3 . ?T3 :grant_start_date ?T3_grant_start_date . ?T4 :document_description ?T4_document_description . ?T4 a :document_types . ?T15 :ref-document_type_code ?T4 . ?T3 :grant_start_date ?T3_grant_start_date . ?T4 :document_description ?T4_document_description . FILTER(?T4_document_description = 'Initial Application') . }",SELECT DISTINCT ?T1_grant_start_date WHERE { ?T1 a <http://valuenet/ontop/grants> . ?T13 a <http://valuenet/ontop/documents> . ?T13 <http://valuenet/ontop/ref-grant> ?T1 . ?T1 <http://valuenet/ontop/grant_start_date> ?T1_grant_start_date . ?T2 <http://valuenet/ontop/document_description> ?T2_document_description . ?T2 a <http://valuenet/ontop/document_types> . ?T13 <http://valuenet/ontop/ref-document_type_code> ?T2 . ?T1 <http://valuenet/ontop/grant_start_date> ?T1_grant_start_date . ?T2 <http://valuenet/ontop/document_description> ?T2_document_description . FILTER(?T2_document_description = 'Regular') . FILTER (?T1_grant_start_date in (?T3_grant_start_date)) . ?T3 a <http://valuenet/ontop/grants> . ?T15 a <http://valuenet/ontop/documents> . ?T15 <http://valuenet/ontop/ref-grant> ?T3 . ?T3 <http://valuenet/ontop/grant_start_date> ?T3_grant_start_date . ?T4 <http://valuenet/ontop/document_description> ?T4_document_description . ?T4 a <http://valuenet/ontop/document_types> . ?T15 <http://valuenet/ontop/ref-document_type_code> ?T4 . ?T3 <http://valuenet/ontop/grant_start_date> ?T3_grant_start_date . ?T4 <http://valuenet/ontop/document_description> ?T4_document_description . FILTER(?T4_document_description = 'Initial Application') . }
Find the organisation type description of the organisation detailed as 'quo'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_organisation_type_description WHERE { ?T1 a :organisation_types . ?T2 a :organisations . ?T2 :ref-organisation_type ?T1 . ?T1 :organisation_type_description ?T1_organisation_type_description . ?T2 :organisation_details ?T2_organisation_details . FILTER(?T2_organisation_details = 'quo') . }",SELECT ?T1_organisation_type_description WHERE { ?T1 a <http://valuenet/ontop/organisation_types> . ?T2 a <http://valuenet/ontop/organisations> . ?T2 <http://valuenet/ontop/ref-organisation_type> ?T1 . ?T1 <http://valuenet/ontop/organisation_type_description> ?T1_organisation_type_description . ?T2 <http://valuenet/ontop/organisation_details> ?T2_organisation_details . FILTER(?T2_organisation_details = 'quo') . }
What are all the details of the organisations described as 'Sponsor'? Sort the result in an ascending order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_organisation_details WHERE { ?T1 a :organisations . ?T2 a :organisation_types . ?T1 :ref-organisation_type ?T2 . ?T1 :organisation_details ?T1_organisation_details . ?T1 :organisation_details ?T1_organisation_details . ?T2 :organisation_type_description ?T2_organisation_type_description . FILTER(?T2_organisation_type_description = 'Sponsor') . } ORDER BY ASC (?T1_organisation_details)",SELECT ?T1_organisation_details WHERE { ?T1 a <http://valuenet/ontop/organisations> . ?T2 a <http://valuenet/ontop/organisation_types> . ?T1 <http://valuenet/ontop/ref-organisation_type> ?T2 . ?T1 <http://valuenet/ontop/organisation_details> ?T1_organisation_details . ?T1 <http://valuenet/ontop/organisation_details> ?T1_organisation_details . ?T2 <http://valuenet/ontop/organisation_type_description> ?T2_organisation_type_description . FILTER(?T2_organisation_type_description = 'Sponsor') . } ORDER BY ASC (?T1_organisation_details)
List the project details of the projects launched by the organisation,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_project_details WHERE { ?T1 a :projects . ?T1 :project_details ?T1_project_details . ?T1 :organisation_id ?T1_organisation_id . FILTER(?T1_organisation_id in (?T22_organisation_id)) . {SELECT ?T22_organisation_id (count( *) as ?aggregation_all) WHERE { ?T22 a :projects . ?T22 :organisation_id ?T22_organisation_id . } GROUP BY ?T22_organisation_id ORDER BY DESC (?aggregation_all) LIMIT 1 } }",SELECT ?T1_project_details WHERE { ?T1 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/project_details> ?T1_project_details . ?T1 <http://valuenet/ontop/organisation_id> ?T1_organisation_id . FILTER(?T1_organisation_id in (?T22_organisation_id)) . {SELECT ?T22_organisation_id (count( *) as ?aggregation_all) WHERE { ?T22 a <http://valuenet/ontop/projects> . ?T22 <http://valuenet/ontop/organisation_id> ?T22_organisation_id . } GROUP BY ?T22_organisation_id ORDER BY DESC (?aggregation_all) LIMIT 1 } }
"List the research staff details, and order in ascending order.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_staff_details WHERE { ?T1 a :research_staff . ?T1 :staff_details ?T1_staff_details . ?T1 :staff_details ?T1_staff_details . } ORDER BY ASC (?T1_staff_details)",SELECT ?T1_staff_details WHERE { ?T1 a <http://valuenet/ontop/research_staff> . ?T1 <http://valuenet/ontop/staff_details> ?T1_staff_details . ?T1 <http://valuenet/ontop/staff_details> ?T1_staff_details . } ORDER BY ASC (?T1_staff_details)
How many tasks does each project have? List the task count and the project detail.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_project_details WHERE { ?T1 a :tasks . ?T2 a :projects . ?T1 :ref-project ?T2 . ?T2 :project_details ?T2_project_details . } GROUP BY ?T2_project_details",SELECT (count( *) as ?aggregation_all) ?T2_project_details WHERE { ?T1 a <http://valuenet/ontop/tasks> . ?T2 a <http://valuenet/ontop/projects> . ?T1 <http://valuenet/ontop/ref-project> ?T2 . ?T2 <http://valuenet/ontop/project_details> ?T2_project_details . } GROUP BY ?T2_project_details
List the description of the outcomes for all projects.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_outcome_description WHERE { ?T1 a :research_outcomes . ?T1 :outcome_description ?T1_outcome_description . }",SELECT ?T1_outcome_description WHERE { ?T1 a <http://valuenet/ontop/research_outcomes> . ?T1 <http://valuenet/ontop/outcome_description> ?T1_outcome_description . }
