nl_question,sparql_partial_uri,sparql_complete_uri
Find the number of investors in total.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :investors . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/investors> . }
Show all investor details.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_details WHERE { ?T1 a :investors . ?T1 :investor_details ?T1_investor_details . }",SELECT ?T1_investor_details WHERE { ?T1 a <http://valuenet/ontop/investors> . ?T1 <http://valuenet/ontop/investor_details> ?T1_investor_details . }
Show all distinct lot details.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_lot_details WHERE { ?T1 a :lots . ?T1 :lot_details ?T1_lot_details . }",SELECT DISTINCT ?T1_lot_details WHERE { ?T1 a <http://valuenet/ontop/lots> . ?T1 <http://valuenet/ontop/lot_details> ?T1_lot_details . }
Show the maximum amount of transaction.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_118 ) WHERE { ?T1 a :transactions . ?T1 :amount_of_transaction ?T1_amount_of_transaction . }",SELECT (max( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_118 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . }
Show all date and share count of transactions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_transaction ?T1_share_count WHERE { ?T1 a :transactions . ?T1 :date_of_transaction ?T1_date_of_transaction . ?T1 :share_count ?T1_share_count . }",SELECT ?T1_date_of_transaction ?T1_share_count WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/date_of_transaction> ?T1_date_of_transaction . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . }
Show all transaction ids with transaction code 'PUR'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_id WHERE { ?T1 a :transactions . ?T1 :transaction_id ?T1_transaction_id . ?T1 :transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'PUR') . }",SELECT ?T1_transaction_id WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/transaction_id> ?T1_transaction_id . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'PUR') . }
Show all dates of transactions whose type code is 'SALE'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_transaction WHERE { ?T1 a :transactions . ?T1 :date_of_transaction ?T1_date_of_transaction . ?T1 :transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . }",SELECT ?T1_date_of_transaction WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/date_of_transaction> ?T1_date_of_transaction . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . }
Show the average amount of transactions with type code 'SALE'.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_26 ) WHERE { ?T1 a :transactions . ?T1 :amount_of_transaction ?T1_amount_of_transaction . ?T1 :transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . }",SELECT (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_26 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . }
Show the description of transaction type with code 'PUR'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_type_description WHERE { ?T1 a :ref_transaction_types . ?T1 :transaction_type_description ?T1_transaction_type_description . ?T1 :transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'PUR') . }",SELECT ?T1_transaction_type_description WHERE { ?T1 a <http://valuenet/ontop/ref_transaction_types> . ?T1 <http://valuenet/ontop/transaction_type_description> ?T1_transaction_type_description . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'PUR') . }
Show the minimum amount of transactions whose type code is 'PUR' and whose share count is bigger than 50.,"PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_190 ) WHERE { ?T1 a :transactions . ?T1 :amount_of_transaction ?T1_amount_of_transaction . ?T1 :transaction_type_code ?T1_transaction_type_code . ?T1 :share_count ?T1_share_count . FILTER(?T1_transaction_type_code = 'PUR' && ?T1_share_count > 50) . }",SELECT (min( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_190 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . FILTER(?T1_transaction_type_code = 'PUR' && ?T1_share_count > 50) . }
Show the maximum share count of transactions where the amount is smaller than 10000,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_share_count) as ?aggregation_T1_share_count_53 ) WHERE { ?T1 a :transactions . ?T1 :share_count ?T1_share_count . ?T1 :amount_of_transaction ?T1_amount_of_transaction . FILTER(?T1_amount_of_transaction < 10000) . }",SELECT (max( ?T1_share_count) as ?aggregation_T1_share_count_53 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . FILTER(?T1_amount_of_transaction < 10000) . }
Show the dates of transactions if the share count is bigger than 100 or the amount is bigger than 1000.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_of_transaction WHERE { ?T1 a :transactions . ?T1 :date_of_transaction ?T1_date_of_transaction . ?T1 :share_count ?T1_share_count . ?T1 :amount_of_transaction ?T1_amount_of_transaction . FILTER(?T1_share_count > 100 || ?T1_amount_of_transaction > 1000) . }",SELECT ?T1_date_of_transaction WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/date_of_transaction> ?T1_date_of_transaction . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . FILTER(?T1_share_count > 100 || ?T1_amount_of_transaction > 1000) . }
Show the transaction type descriptions and dates if the share count is smaller than 10.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_type_description ?T2_date_of_transaction WHERE { ?T1 a :ref_transaction_types . ?T2 a :transactions . ?T2 :ref-transaction_type_code ?T1 . ?T1 :transaction_type_description ?T1_transaction_type_description . ?T2 :date_of_transaction ?T2_date_of_transaction . ?T2 :share_count ?T2_share_count . FILTER(?T2_share_count < 10) . }",SELECT ?T1_transaction_type_description ?T2_date_of_transaction WHERE { ?T1 a <http://valuenet/ontop/ref_transaction_types> . ?T2 a <http://valuenet/ontop/transactions> . ?T2 <http://valuenet/ontop/ref-transaction_type_code> ?T1 . ?T1 <http://valuenet/ontop/transaction_type_description> ?T1_transaction_type_description . ?T2 <http://valuenet/ontop/date_of_transaction> ?T2_date_of_transaction . ?T2 <http://valuenet/ontop/share_count> ?T2_share_count . FILTER(?T2_share_count < 10) . }
Show details of all investors if they make any transaction with share count greater than 100.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_details WHERE { ?T1 a :investors . ?T2 a :transactions . ?T2 :ref-investor ?T1 . ?T1 :investor_details ?T1_investor_details . ?T2 :share_count ?T2_share_count . FILTER(?T2_share_count > 100) . }",SELECT ?T1_investor_details WHERE { ?T1 a <http://valuenet/ontop/investors> . ?T2 a <http://valuenet/ontop/transactions> . ?T2 <http://valuenet/ontop/ref-investor> ?T1 . ?T1 <http://valuenet/ontop/investor_details> ?T1_investor_details . ?T2 <http://valuenet/ontop/share_count> ?T2_share_count . FILTER(?T2_share_count > 100) . }
Return the lot details and investor ids.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lot_details ?T1_investor_id WHERE { ?T1 a :lots . ?T1 :lot_details ?T1_lot_details . ?T1 :investor_id ?T1_investor_id . }",SELECT ?T1_lot_details ?T1_investor_id WHERE { ?T1 a <http://valuenet/ontop/lots> . ?T1 <http://valuenet/ontop/lot_details> ?T1_lot_details . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . }
Show the average transaction amount for different transaction types.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_type_code (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_189 ) WHERE { ?T1 a :transactions . ?T1 :transaction_type_code ?T1_transaction_type_code . ?T1 :amount_of_transaction ?T1_amount_of_transaction . } GROUP BY ?T1_transaction_type_code",SELECT ?T1_transaction_type_code (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_189 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . } GROUP BY ?T1_transaction_type_code
Show the maximum and minimum share count of different transaction types.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_type_code (max( ?T1_share_count) as ?aggregation_T1_share_count_187 ) (min( ?T1_share_count) as ?aggregation_T1_share_count_3 ) WHERE { ?T1 a :transactions . ?T1 :transaction_type_code ?T1_transaction_type_code . ?T1 :share_count ?T1_share_count . ?T1 :share_count ?T1_share_count . } GROUP BY ?T1_transaction_type_code",SELECT ?T1_transaction_type_code (max( ?T1_share_count) as ?aggregation_T1_share_count_187 ) (min( ?T1_share_count) as ?aggregation_T1_share_count_3 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . } GROUP BY ?T1_transaction_type_code
Show the average share count of transactions for different investors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id (avg( ?T1_share_count) as ?aggregation_T1_share_count_17 ) WHERE { ?T1 a :transactions . ?T1 :investor_id ?T1_investor_id . ?T1 :share_count ?T1_share_count . } GROUP BY ?T1_investor_id",SELECT ?T1_investor_id (avg( ?T1_share_count) as ?aggregation_T1_share_count_17 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . } GROUP BY ?T1_investor_id
"Show the average share count of transactions each each investor, ordered by average share count.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id (avg( ?T1_share_count) as ?aggregation_T1_share_count_155 ) WHERE { ?T1 a :transactions . ?T1 :investor_id ?T1_investor_id . ?T1 :share_count ?T1_share_count . ?T1 :share_count ?T1_share_count . } GROUP BY ?T1_investor_id ORDER BY ASC (avg( ?T1_share_count))",SELECT ?T1_investor_id (avg( ?T1_share_count) as ?aggregation_T1_share_count_155 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . ?T1 <http://valuenet/ontop/share_count> ?T1_share_count . } GROUP BY ?T1_investor_id ORDER BY ASC (avg( ?T1_share_count))
Show the average amount of transactions for different investors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_23 ) WHERE { ?T1 a :transactions . ?T1 :investor_id ?T1_investor_id . ?T1 :amount_of_transaction ?T1_amount_of_transaction . } GROUP BY ?T1_investor_id",SELECT ?T1_investor_id (avg( ?T1_amount_of_transaction) as ?aggregation_T1_amount_of_transaction_23 ) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . ?T1 <http://valuenet/ontop/amount_of_transaction> ?T1_amount_of_transaction . } GROUP BY ?T1_investor_id
Show the average amount of transactions for different lots.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_184 ) WHERE { ?T1 a :transactions_lots . ?T2 a :transactions . ?T1 :ref-transaction ?T2 . ?T1 :lot_id ?T1_lot_id . ?T2 :amount_of_transaction ?T2_amount_of_transaction . } GROUP BY ?T1_lot_id",SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_184 ) WHERE { ?T1 a <http://valuenet/ontop/transactions_lots> . ?T2 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/ref-transaction> ?T2 . ?T1 <http://valuenet/ontop/lot_id> ?T1_lot_id . ?T2 <http://valuenet/ontop/amount_of_transaction> ?T2_amount_of_transaction . } GROUP BY ?T1_lot_id
"Show the average amount of transactions for different lots, ordered by average amount of transactions.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_160 ) WHERE { ?T1 a :transactions_lots . ?T2 a :transactions . ?T1 :ref-transaction ?T2 . ?T1 :lot_id ?T1_lot_id . ?T2 :amount_of_transaction ?T2_amount_of_transaction . ?T2 :amount_of_transaction ?T2_amount_of_transaction . } GROUP BY ?T1_lot_id ORDER BY ASC (avg( ?T2_amount_of_transaction))",SELECT ?T1_lot_id (avg( ?T2_amount_of_transaction) as ?aggregation_T2_amount_of_transaction_160 ) WHERE { ?T1 a <http://valuenet/ontop/transactions_lots> . ?T2 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/ref-transaction> ?T2 . ?T1 <http://valuenet/ontop/lot_id> ?T1_lot_id . ?T2 <http://valuenet/ontop/amount_of_transaction> ?T2_amount_of_transaction . ?T2 <http://valuenet/ontop/amount_of_transaction> ?T2_amount_of_transaction . } GROUP BY ?T1_lot_id ORDER BY ASC (avg( ?T2_amount_of_transaction))
Show the number of transactions with transaction type code 'SALE' for different investors if it is larger than 0.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :investor_id ?T1_investor_id . ?T1 :transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . } GROUP BY ?T1_investor_id",SELECT ?T1_investor_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . } GROUP BY ?T1_investor_id
Show the number of transactions for different investors.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :investor_id ?T1_investor_id . } GROUP BY ?T1_investor_id",SELECT ?T1_investor_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . } GROUP BY ?T1_investor_id
Show the transaction type code that occurs the fewest times.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a :transactions . ?T1 :transaction_type_code ?T1_transaction_type_code . } GROUP BY ?T1_transaction_type_code ORDER BY ASC (?aggregation_all) LIMIT 1",SELECT ?T1_transaction_type_code (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . } GROUP BY ?T1_transaction_type_code ORDER BY ASC (?aggregation_all) LIMIT 1
Show the description of the transaction type that occurs most frequently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_transaction_type_description (count( *) as ?aggregation_all) WHERE { ?T1 a :ref_transaction_types . ?T2 a :transactions . ?T2 :ref-transaction_type_code ?T1 . ?T1 :transaction_type_description ?T1_transaction_type_description . } GROUP BY ?T1_transaction_type_description ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_transaction_type_description (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/ref_transaction_types> . ?T2 a <http://valuenet/ontop/transactions> . ?T2 <http://valuenet/ontop/ref-transaction_type_code> ?T1 . ?T1 <http://valuenet/ontop/transaction_type_description> ?T1_transaction_type_description . } GROUP BY ?T1_transaction_type_description ORDER BY DESC (?aggregation_all) LIMIT 1
Show the id and details of the investor that has the largest number of transactions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id (count( *) as ?aggregation_all) ?T2_investor_details WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :ref-investor ?T2 . ?T1 :investor_id ?T1_investor_id . ?T2 :investor_details ?T2_investor_details . } GROUP BY ?T1_investor_id ?T2_investor_details ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_investor_id (count( *) as ?aggregation_all) ?T2_investor_details WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T2 a <http://valuenet/ontop/investors> . ?T1 <http://valuenet/ontop/ref-investor> ?T2 . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . ?T2 <http://valuenet/ontop/investor_details> ?T2_investor_details . } GROUP BY ?T1_investor_id ?T2_investor_details ORDER BY DESC (?aggregation_all) LIMIT 1
Show the ids of the investors who have at least two transactions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :ref-investor ?T2 . ?T1 :investor_id ?T1_investor_id . } GROUP BY ?T1_investor_id HAVING(count( *) >= 2)",SELECT ?T1_investor_id WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T2 a <http://valuenet/ontop/investors> . ?T1 <http://valuenet/ontop/ref-investor> ?T2 . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . } GROUP BY ?T1_investor_id HAVING(count( *) >= 2)
Show the ids and details of the investors who have at least two transactions with type code 'SALE'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_investor_id ?T2_investor_details WHERE { ?T1 a :transactions . ?T2 a :investors . ?T1 :ref-investor ?T2 . ?T1 :investor_id ?T1_investor_id . ?T2 :investor_details ?T2_investor_details . ?T1 :transaction_type_code ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . } GROUP BY ?T1_investor_id ?T2_investor_details HAVING(count( *) >= 2)",SELECT ?T1_investor_id ?T2_investor_details WHERE { ?T1 a <http://valuenet/ontop/transactions> . ?T2 a <http://valuenet/ontop/investors> . ?T1 <http://valuenet/ontop/ref-investor> ?T2 . ?T1 <http://valuenet/ontop/investor_id> ?T1_investor_id . ?T2 <http://valuenet/ontop/investor_details> ?T2_investor_details . ?T1 <http://valuenet/ontop/transaction_type_code> ?T1_transaction_type_code . FILTER(?T1_transaction_type_code = 'SALE') . } GROUP BY ?T1_investor_id ?T2_investor_details HAVING(count( *) >= 2)
