nl_question,sparql_partial_uri,sparql_complete_uri
Find the id of the order made most recently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id WHERE { ?T1 a :orders . ?T1 :order_id ?T1_order_id . ?T1 :date_order_placed ?T1_date_order_placed . } ORDER BY DESC (?T1_date_order_placed) LIMIT 1",SELECT ?T1_order_id WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/date_order_placed> ?T1_date_order_placed . } ORDER BY DESC (?T1_date_order_placed) LIMIT 1
Find the order id and customer id associated with the oldest order.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id ?T1_customer_id WHERE { ?T1 a :orders . ?T1 :order_id ?T1_order_id . ?T1 :customer_id ?T1_customer_id . ?T1 :date_order_placed ?T1_date_order_placed . } ORDER BY ASC (?T1_date_order_placed) LIMIT 1",SELECT ?T1_order_id ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T1 <http://valuenet/ontop/date_order_placed> ?T1_date_order_placed . } ORDER BY ASC (?T1_date_order_placed) LIMIT 1
Find the id of the order whose shipment tracking number is '3452'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :order_id ?T1_order_id . ?T1 :shipment_tracking_number ?T1_shipment_tracking_number . FILTER(?T1_shipment_tracking_number = 3452) . }",SELECT ?T1_order_id WHERE { ?T1 a <http://valuenet/ontop/shipments> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/shipment_tracking_number> ?T1_shipment_tracking_number . FILTER(?T1_shipment_tracking_number = 3452) . }
Find the ids of all the order items whose product id is 11.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_item_id WHERE { ?T1 a :order_items . ?T1 :order_item_id ?T1_order_item_id . ?T1 :product_id ?T1_product_id . FILTER(?T1_product_id = 11) . }",SELECT ?T1_order_item_id WHERE { ?T1 a <http://valuenet/ontop/order_items> . ?T1 <http://valuenet/ontop/order_item_id> ?T1_order_item_id . ?T1 <http://valuenet/ontop/product_id> ?T1_product_id . FILTER(?T1_product_id = 11) . }
List the name of all the distinct customers who have orders with status 'Packing'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T2 :order_status ?T2_order_status . FILTER(?T2_order_status = 'Packing') . }",SELECT DISTINCT ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/order_status> ?T2_order_status . FILTER(?T2_order_status = 'Packing') . }
Find the details of all the distinct customers who have orders with status 'On Road'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_details ?T1_customer_details . ?T2 :order_status ?T2_order_status . FILTER(?T2_order_status = 'On Road') . }",SELECT DISTINCT ?T1_customer_details WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_details> ?T1_customer_details . ?T2 <http://valuenet/ontop/order_status> ?T2_order_status . FILTER(?T2_order_status = 'On Road') . }
Which customer made the most orders? Find the customer name.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . } GROUP BY ?T1_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_customer_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . } GROUP BY ?T1_customer_name ORDER BY DESC (?aggregation_all) LIMIT 1
Find the id of the customer who made the most orders.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_id ?T1_customer_id . } GROUP BY ?T1_customer_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_customer_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . } GROUP BY ?T1_customer_id ORDER BY DESC (?aggregation_all) LIMIT 1
Give me a list of id and status of orders which belong to the customer named 'Jeramie'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id ?T1_order_status WHERE { ?T1 a :orders . ?T2 a :customers . ?T1 :ref-customer ?T2 . ?T1 :order_id ?T1_order_id . ?T1 :order_status ?T1_order_status . ?T2 :customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') . }",SELECT ?T1_order_id ?T1_order_status WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T2 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/ref-customer> ?T2 . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/order_status> ?T1_order_status . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') . }
Find the dates of orders which belong to the customer named 'Jeramie'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :customers . ?T1 :ref-customer ?T2 . ?T1 :date_order_placed ?T1_date_order_placed . ?T2 :customer_name ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') . }",SELECT ?T1_date_order_placed WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T2 a <http://valuenet/ontop/customers> . ?T1 <http://valuenet/ontop/ref-customer> ?T2 . ?T1 <http://valuenet/ontop/date_order_placed> ?T1_date_order_placed . ?T2 <http://valuenet/ontop/customer_name> ?T2_customer_name . FILTER(?T2_customer_name = 'Jeramie') . }
Give me the names of customers who have placed orders between 2009-01-01 and 2010-01-01.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T2 :date_order_placed ?T2_date_order_placed . ?T2 :date_order_placed ?T2_date_order_placed . FILTER(?T2_date_order_placed >= 2009-01-01 && ?T2_date_order_placed <= 2010-01-01) . }",SELECT ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/date_order_placed> ?T2_date_order_placed . ?T2 <http://valuenet/ontop/date_order_placed> ?T2_date_order_placed . FILTER(?T2_date_order_placed >= 2009-01-01 && ?T2_date_order_placed <= 2010-01-01) . }
Find the id of the customers who have order status both 'On Road' and 'Shipped'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_customer_id WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_id ?T1_customer_id . ?T2 :order_status ?T2_order_status . FILTER(?T2_order_status = 'On Road') . FILTER (?T1_customer_id in (?T3_customer_id)) . ?T3 a :customers . ?T4 a :orders . ?T4 :ref-customer ?T3 . ?T3 :customer_id ?T3_customer_id . ?T4 :order_status ?T4_order_status . FILTER(?T4_order_status = 'Shipped') . }",SELECT DISTINCT ?T1_customer_id WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_id> ?T1_customer_id . ?T2 <http://valuenet/ontop/order_status> ?T2_order_status . FILTER(?T2_order_status = 'On Road') . FILTER (?T1_customer_id in (?T3_customer_id)) . ?T3 a <http://valuenet/ontop/customers> . ?T4 a <http://valuenet/ontop/orders> . ?T4 <http://valuenet/ontop/ref-customer> ?T3 . ?T3 <http://valuenet/ontop/customer_id> ?T3_customer_id . ?T4 <http://valuenet/ontop/order_status> ?T4_order_status . FILTER(?T4_order_status = 'Shipped') . }
When was the order placed whose shipment tracking number is 3452? Give me the date.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date_order_placed WHERE { ?T1 a :orders . ?T2 a :shipments . ?T2 :ref-order ?T1 . ?T1 :date_order_placed ?T1_date_order_placed . ?T2 :shipment_tracking_number ?T2_shipment_tracking_number . FILTER(?T2_shipment_tracking_number = 3452) . }",SELECT ?T1_date_order_placed WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T2 a <http://valuenet/ontop/shipments> . ?T2 <http://valuenet/ontop/ref-order> ?T1 . ?T1 <http://valuenet/ontop/date_order_placed> ?T1_date_order_placed . ?T2 <http://valuenet/ontop/shipment_tracking_number> ?T2_shipment_tracking_number . FILTER(?T2_shipment_tracking_number = 3452) . }
List the count and id of each product in all the orders.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) ?T2_product_id WHERE { ?T13 a :order_items . ?T2 a :products . ?T13 :ref-product ?T2 . ?T2 :product_id ?T2_product_id . } GROUP BY ?T2_product_id",SELECT (count( *) as ?aggregation_all) ?T2_product_id WHERE { ?T13 a <http://valuenet/ontop/order_items> . ?T2 a <http://valuenet/ontop/products> . ?T13 <http://valuenet/ontop/ref-product> ?T2 . ?T2 <http://valuenet/ontop/product_id> ?T2_product_id . } GROUP BY ?T2_product_id
List the name and count of each product in all orders.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a :products . ?T13 a :order_items . ?T13 :ref-product ?T1 . ?T1 :product_name ?T1_product_name . } GROUP BY ?T1_product_name",SELECT ?T1_product_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/products> . ?T13 a <http://valuenet/ontop/order_items> . ?T13 <http://valuenet/ontop/ref-product> ?T1 . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . } GROUP BY ?T1_product_name
Find the ids of orders which are shipped after 2000-01-01.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :order_id ?T1_order_id . ?T1 :shipment_date ?T1_shipment_date . FILTER(?T1_shipment_date > 2000-01-01) . }",SELECT ?T1_order_id WHERE { ?T1 a <http://valuenet/ontop/shipments> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/shipment_date> ?T1_shipment_date . FILTER(?T1_shipment_date > 2000-01-01) . }
Find the id of the order which is shipped most recently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :order_id ?T1_order_id . ?T1 :shipment_date ?T1_shipment_date . FILTER(?T1_shipment_date = (?aggregation_T22_shipment_date_0)) . {SELECT (max( ?T22_shipment_date) as ?aggregation_T22_shipment_date_0 ) WHERE { ?T22 a :shipments . ?T22 :shipment_date ?T22_shipment_date . } } }",SELECT ?T1_order_id WHERE { ?T1 a <http://valuenet/ontop/shipments> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/shipment_date> ?T1_shipment_date . FILTER(?T1_shipment_date = (?aggregation_T22_shipment_date_0)) . {SELECT (max( ?T22_shipment_date) as ?aggregation_T22_shipment_date_0 ) WHERE { ?T22 a <http://valuenet/ontop/shipments> . ?T22 <http://valuenet/ontop/shipment_date> ?T22_shipment_date . } } }
Which order has the most recent shipment? Give me the order id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id WHERE { ?T1 a :shipments . ?T1 :order_id ?T1_order_id . ?T1 :shipment_date ?T1_shipment_date . FILTER(?T1_shipment_date = (?aggregation_T22_shipment_date_86)) . {SELECT (max( ?T22_shipment_date) as ?aggregation_T22_shipment_date_86 ) WHERE { ?T22 a :shipments . ?T22 :shipment_date ?T22_shipment_date . } } }",SELECT ?T1_order_id WHERE { ?T1 a <http://valuenet/ontop/shipments> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/shipment_date> ?T1_shipment_date . FILTER(?T1_shipment_date = (?aggregation_T22_shipment_date_86)) . {SELECT (max( ?T22_shipment_date) as ?aggregation_T22_shipment_date_86 ) WHERE { ?T22 a <http://valuenet/ontop/shipments> . ?T22 <http://valuenet/ontop/shipment_date> ?T22_shipment_date . } } }
List the names of all distinct products in alphabetical order.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_product_name WHERE { ?T1 a :products . ?T1 :product_name ?T1_product_name . ?T1 :product_name ?T1_product_name . } ORDER BY ASC (?T1_product_name)",SELECT DISTINCT ?T1_product_name WHERE { ?T1 a <http://valuenet/ontop/products> . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . ?T1 <http://valuenet/ontop/product_name> ?T1_product_name . } ORDER BY ASC (?T1_product_name)
List the ids of all distinct orders ordered by placed date.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_order_id ?T1_date_order_placed WHERE { ?T1 a :orders . ?T1 :order_id ?T1_order_id . ?T1 :date_order_placed ?T1_date_order_placed . ?T1 :date_order_placed ?T1_date_order_placed . } ORDER BY ASC (?T1_date_order_placed)",SELECT DISTINCT ?T1_order_id ?T1_date_order_placed WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . ?T1 <http://valuenet/ontop/date_order_placed> ?T1_date_order_placed . ?T1 <http://valuenet/ontop/date_order_placed> ?T1_date_order_placed . } ORDER BY ASC (?T1_date_order_placed)
Which order deals with the most items? Return the order id.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a :orders . ?T2 a :order_items . ?T2 :ref-order ?T1 . ?T1 :order_id ?T1_order_id . } GROUP BY ?T1_order_id ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_order_id (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/orders> . ?T2 a <http://valuenet/ontop/order_items> . ?T2 <http://valuenet/ontop/ref-order> ?T1 . ?T1 <http://valuenet/ontop/order_id> ?T1_order_id . } GROUP BY ?T1_order_id ORDER BY DESC (?aggregation_all) LIMIT 1
Find the invoice numbers which are created before 1989-09-03 or after 2007-12-25.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_invoice_number WHERE { ?T1 a :invoices . ?T1 :invoice_number ?T1_invoice_number . ?T1 :invoice_date ?T1_invoice_date . ?T1 :invoice_date ?T1_invoice_date . FILTER(?T1_invoice_date < 1989-09-03 || ?T1_invoice_date > 2007-12-25) . }",SELECT ?T1_invoice_number WHERE { ?T1 a <http://valuenet/ontop/invoices> . ?T1 <http://valuenet/ontop/invoice_number> ?T1_invoice_number . ?T1 <http://valuenet/ontop/invoice_date> ?T1_invoice_date . ?T1 <http://valuenet/ontop/invoice_date> ?T1_invoice_date . FILTER(?T1_invoice_date < 1989-09-03 || ?T1_invoice_date > 2007-12-25) . }
Find the distinct details of invoices which are created before 1989-09-03 or after 2007-12-25.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_invoice_details WHERE { ?T1 a :invoices . ?T1 :invoice_details ?T1_invoice_details . ?T1 :invoice_date ?T1_invoice_date . ?T1 :invoice_date ?T1_invoice_date . FILTER(?T1_invoice_date < 1989-09-03 || ?T1_invoice_date > 2007-12-25) . }",SELECT DISTINCT ?T1_invoice_details WHERE { ?T1 a <http://valuenet/ontop/invoices> . ?T1 <http://valuenet/ontop/invoice_details> ?T1_invoice_details . ?T1 <http://valuenet/ontop/invoice_date> ?T1_invoice_date . ?T1 <http://valuenet/ontop/invoice_date> ?T1_invoice_date . FILTER(?T1_invoice_date < 1989-09-03 || ?T1_invoice_date > 2007-12-25) . }
Find the name of the customers who have at most two orders.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T2 a :orders . ?T2 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . } GROUP BY ?T1_customer_name HAVING(count( *) <= 2)",SELECT ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T2 a <http://valuenet/ontop/orders> . ?T2 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . } GROUP BY ?T1_customer_name HAVING(count( *) <= 2)
List the names of the customers who have once bought product 'food'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T13 a :orders . ?T13 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T2 :product_name ?T2_product_name . ?T14 a :order_items . ?T14 :ref-order ?T13 . ?T1 :customer_name ?T1_customer_name . ?T2 :product_name ?T2_product_name . ?T2 a :products . ?T14 :ref-product ?T2 . ?T1 :customer_name ?T1_customer_name . ?T2 :product_name ?T2_product_name . FILTER(?T2_product_name = 'food') . } GROUP BY ?T1_customer_name HAVING(count( *) >= 1)",SELECT ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T13 a <http://valuenet/ontop/orders> . ?T13 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T14 a <http://valuenet/ontop/order_items> . ?T14 <http://valuenet/ontop/ref-order> ?T13 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . ?T2 a <http://valuenet/ontop/products> . ?T14 <http://valuenet/ontop/ref-product> ?T2 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/product_name> ?T2_product_name . FILTER(?T2_product_name = 'food') . } GROUP BY ?T1_customer_name HAVING(count( *) >= 1)
List the names of customers who have once canceled the purchase of the product 'food' (the item status is 'Cancel').,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_customer_name WHERE { ?T1 a :customers . ?T4 a :orders . ?T4 :ref-customer ?T1 . ?T1 :customer_name ?T1_customer_name . ?T2 :order_item_status ?T2_order_item_status . ?T3 :product_name ?T3_product_name . ?T2 a :order_items . ?T2 :ref-order ?T4 . ?T1 :customer_name ?T1_customer_name . ?T2 :order_item_status ?T2_order_item_status . ?T3 :product_name ?T3_product_name . ?T3 a :products . ?T2 :ref-product ?T3 . ?T1 :customer_name ?T1_customer_name . ?T2 :order_item_status ?T2_order_item_status . ?T3 :product_name ?T3_product_name . FILTER(?T2_order_item_status = 'Cancel' && ?T3_product_name = 'food') . } GROUP BY ?T1_customer_name HAVING(count( *) >= 1)",SELECT ?T1_customer_name WHERE { ?T1 a <http://valuenet/ontop/customers> . ?T4 a <http://valuenet/ontop/orders> . ?T4 <http://valuenet/ontop/ref-customer> ?T1 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/order_item_status> ?T2_order_item_status . ?T3 <http://valuenet/ontop/product_name> ?T3_product_name . ?T2 a <http://valuenet/ontop/order_items> . ?T2 <http://valuenet/ontop/ref-order> ?T4 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/order_item_status> ?T2_order_item_status . ?T3 <http://valuenet/ontop/product_name> ?T3_product_name . ?T3 a <http://valuenet/ontop/products> . ?T2 <http://valuenet/ontop/ref-product> ?T3 . ?T1 <http://valuenet/ontop/customer_name> ?T1_customer_name . ?T2 <http://valuenet/ontop/order_item_status> ?T2_order_item_status . ?T3 <http://valuenet/ontop/product_name> ?T3_product_name . FILTER(?T2_order_item_status = 'Cancel' && ?T3_product_name = 'food') . } GROUP BY ?T1_customer_name HAVING(count( *) >= 1)
