nl_question,sparql_partial_uri,sparql_complete_uri
Find the emails of the user named 'Mary'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :email ?T1_email . ?T1 :name ?T1_name . FILTER(?T1_name = 'Mary') . }",SELECT ?T1_email WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/email> ?T1_email . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(?T1_name = 'Mary') . }
What is the partition id of the user named 'Iron Man'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_partitionid WHERE { ?T1 a :user_profiles . ?T1 :partitionid ?T1_partitionid . ?T1 :name ?T1_name . FILTER(?T1_name = 'Iron Man') . }",SELECT ?T1_partitionid WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/partitionid> ?T1_partitionid . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(?T1_name = 'Iron Man') . }
Find the number of followers for each user.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :follows . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/follows> . }
Find the number of tweets in record.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :tweets . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/tweets> . }
Find the number of users who posted some tweets.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT (count(DISTINCT ?T1_uid) as ?aggregation_T1_uid_131 ) WHERE { ?T1 a :tweets . ?T1 :uid ?T1_uid . }",SELECT DISTINCT (count(DISTINCT ?T1_uid) as ?aggregation_T1_uid_131 ) WHERE { ?T1 a <http://valuenet/ontop/tweets> . ?T1 <http://valuenet/ontop/uid> ?T1_uid . }
Find the name and email of the user whose name contains the word ‘Swift’.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :name ?T1_name . ?T1 :email ?T1_email . ?T1 :name ?T1_name . FILTER(contains (?T1_name, 'Swift')) . }","SELECT ?T1_name ?T1_email WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/email> ?T1_email . ?T1 <http://valuenet/ontop/name> ?T1_name . FILTER(contains (?T1_name, 'Swift')) . }"
Find the names of users whose emails contain ‘superstar’ or ‘edu’.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T1 :name ?T1_name . ?T1 :email ?T1_email . ?T1 :email ?T1_email . FILTER(contains (?T1_email, 'superstar') || contains (?T1_email, 'edu')) . }","SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/email> ?T1_email . ?T1 <http://valuenet/ontop/email> ?T1_email . FILTER(contains (?T1_email, 'superstar') || contains (?T1_email, 'edu')) . }"
Return the text of tweets about the topic 'intern'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_text WHERE { ?T1 a :tweets . ?T1 :text ?T1_text . ?T1 :text ?T1_text . FILTER(contains (?T1_text, 'intern')) . }","SELECT ?T1_text WHERE { ?T1 a <http://valuenet/ontop/tweets> . ?T1 <http://valuenet/ontop/text> ?T1_text . ?T1 <http://valuenet/ontop/text> ?T1_text . FILTER(contains (?T1_text, 'intern')) . }"
Find the name and email of the users who have more than 1000 followers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :name ?T1_name . ?T1 :email ?T1_email . ?T1 :followers ?T1_followers . FILTER(?T1_followers > 1000) . }",SELECT ?T1_name ?T1_email WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/email> ?T1_email . ?T1 <http://valuenet/ontop/followers> ?T1_followers . FILTER(?T1_followers > 1000) . }
Find the names of the users whose number of followers is greater than that of the user named 'Tyler Swift'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T2 a :follows . ?T2 :ref-f1 ?T1 . ?T1 :name ?T1_name . {SELECT (count( *) as ?aggregation_all) WHERE { ?T23 a :follows . ?T24 a :user_profiles . ?T23 :ref-f1 ?T24 . ?T24 :name ?T24_name . FILTER(?T24_name = 'Tyler Swift') . } } } GROUP BY ?T1_name HAVING(count( *) > (?T24_name))",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T2 a <http://valuenet/ontop/follows> . ?T2 <http://valuenet/ontop/ref-f1> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . {SELECT (count( *) as ?aggregation_all) WHERE { ?T23 a <http://valuenet/ontop/follows> . ?T24 a <http://valuenet/ontop/user_profiles> . ?T23 <http://valuenet/ontop/ref-f1> ?T24 . ?T24 <http://valuenet/ontop/name> ?T24_name . FILTER(?T24_name = 'Tyler Swift') . } } } GROUP BY ?T1_name HAVING(count( *) > (?T24_name))
Find the name and email for the users who have more than one follower.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T2 a :follows . ?T2 :ref-f1 ?T1 . ?T1 :name ?T1_name . ?T1 :email ?T1_email . } GROUP BY ?T1_name ?T1_email HAVING(count( *) > 1)",SELECT ?T1_name ?T1_email WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T2 a <http://valuenet/ontop/follows> . ?T2 <http://valuenet/ontop/ref-f1> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/email> ?T1_email . } GROUP BY ?T1_name ?T1_email HAVING(count( *) > 1)
Find the names of users who have more than one tweet.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T2 a <http://valuenet/ontop/tweets> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) > 1)
Find the id of users who are followed by Mary and Susan.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_f1 WHERE { ?T1 a :follows . ?T2 a :user_profiles . ?T1 :ref-f1 ?T2 . ?T1 :f1 ?T1_f1 . ?T2 :name ?T2_name . FILTER(?T2_name = 'Mary') . FILTER (?T1_f1 in (?T3_f1)) . ?T3 a :follows . ?T4 a :user_profiles . ?T3 :ref-f1 ?T4 . ?T3 :f1 ?T3_f1 . ?T4 :name ?T4_name . FILTER(?T4_name = 'Susan') . }",SELECT DISTINCT ?T1_f1 WHERE { ?T1 a <http://valuenet/ontop/follows> . ?T2 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/ref-f1> ?T2 . ?T1 <http://valuenet/ontop/f1> ?T1_f1 . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Mary') . FILTER (?T1_f1 in (?T3_f1)) . ?T3 a <http://valuenet/ontop/follows> . ?T4 a <http://valuenet/ontop/user_profiles> . ?T3 <http://valuenet/ontop/ref-f1> ?T4 . ?T3 <http://valuenet/ontop/f1> ?T3_f1 . ?T4 <http://valuenet/ontop/name> ?T4_name . FILTER(?T4_name = 'Susan') . }
Find the id of users who are followed by Mary or Susan.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_f1 WHERE { ?T1 a :follows . ?T2 a :user_profiles . ?T1 :ref-f1 ?T2 . ?T1 :f1 ?T1_f1 . ?T2 :name ?T2_name . ?T2 :name ?T2_name . FILTER(?T2_name = 'Mary' || ?T2_name = 'Susan') . }",SELECT ?T1_f1 WHERE { ?T1 a <http://valuenet/ontop/follows> . ?T2 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/ref-f1> ?T2 . ?T1 <http://valuenet/ontop/f1> ?T1_f1 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T2 <http://valuenet/ontop/name> ?T2_name . FILTER(?T2_name = 'Mary' || ?T2_name = 'Susan') . }
Find the name of the user who has the largest number of followers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :user_profiles . ?T1 :name ?T1_name . ?T1 :followers ?T1_followers . } ORDER BY DESC (?T1_followers) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/followers> ?T1_followers . } ORDER BY DESC (?T1_followers) LIMIT 1
Find the name and email of the user followed by the least number of people.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_email WHERE { ?T1 a :user_profiles . ?T1 :name ?T1_name . ?T1 :email ?T1_email . ?T1 :followers ?T1_followers . } ORDER BY ASC (?T1_followers) LIMIT 1",SELECT ?T1_name ?T1_email WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/email> ?T1_email . ?T1 <http://valuenet/ontop/followers> ?T1_followers . } ORDER BY ASC (?T1_followers) LIMIT 1
"List the name and number of followers for each user, and sort the results by the number of followers in descending order.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_followers WHERE { ?T1 a :user_profiles . ?T1 :name ?T1_name . ?T1 :followers ?T1_followers . ?T1 :followers ?T1_followers . } ORDER BY DESC (?T1_followers)",SELECT ?T1_name ?T1_followers WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/followers> ?T1_followers . ?T1 <http://valuenet/ontop/followers> ?T1_followers . } ORDER BY DESC (?T1_followers)
List the text of all tweets in the order of date.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_text WHERE { ?T1 a :tweets . ?T1 :text ?T1_text . ?T1 :createdate ?T1_createdate . } ORDER BY ASC (?T1_createdate)",SELECT ?T1_text WHERE { ?T1 a <http://valuenet/ontop/tweets> . ?T1 <http://valuenet/ontop/text> ?T1_text . ?T1 <http://valuenet/ontop/createdate> ?T1_createdate . } ORDER BY ASC (?T1_createdate)
Find the name of each user and number of tweets tweeted by each of them.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name",SELECT ?T1_name (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T2 a <http://valuenet/ontop/tweets> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name
Find the name and partition id for users who tweeted less than twice.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_partitionid WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :ref-u ?T1 . ?T1 :name ?T1_name . ?T1 :partitionid ?T1_partitionid . } GROUP BY ?T1_name ?T1_partitionid HAVING(count( *) < 2)",SELECT ?T1_name ?T1_partitionid WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T2 a <http://valuenet/ontop/tweets> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/partitionid> ?T1_partitionid . } GROUP BY ?T1_name ?T1_partitionid HAVING(count( *) < 2)
Find the average number of followers for the users who do not have any tweet.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_followers) as ?aggregation_T1_followers_6 ) WHERE { ?T1 a :user_profiles . ?T1 :followers ?T1_followers . ?T1 :uid ?T1_uid . FILTER(?T1_uid not in (?T22_uid)) . {SELECT ?T22_uid WHERE { ?T22 a :tweets . ?T22 :uid ?T22_uid . } } }",SELECT (avg( ?T1_followers) as ?aggregation_T1_followers_6 ) WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/followers> ?T1_followers . ?T1 <http://valuenet/ontop/uid> ?T1_uid . FILTER(?T1_uid not in (?T22_uid)) . {SELECT ?T22_uid WHERE { ?T22 a <http://valuenet/ontop/tweets> . ?T22 <http://valuenet/ontop/uid> ?T22_uid . } } }
Find the average number of followers for the users who had some tweets.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_followers) as ?aggregation_T1_followers_115 ) WHERE { ?T1 a :user_profiles . ?T2 a :tweets . ?T2 :ref-u ?T1 . ?T1 :followers ?T1_followers . ?T1 :uid ?T1_uid . }",SELECT (avg( ?T1_followers) as ?aggregation_T1_followers_115 ) WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T2 a <http://valuenet/ontop/tweets> . ?T2 <http://valuenet/ontop/ref-u> ?T1 . ?T1 <http://valuenet/ontop/followers> ?T1_followers . ?T1 <http://valuenet/ontop/uid> ?T1_uid . }
Find the maximum and total number of followers of all users.,"PREFIX : <http://valuenet/ontop/>
SELECT (max( ?T1_followers) as ?aggregation_T1_followers_73 ) (sum( ?T1_followers) as ?aggregation_T1_followers_152 ) WHERE { ?T1 a :user_profiles . ?T1 :followers ?T1_followers . ?T1 :followers ?T1_followers . }",SELECT (max( ?T1_followers) as ?aggregation_T1_followers_73 ) (sum( ?T1_followers) as ?aggregation_T1_followers_152 ) WHERE { ?T1 a <http://valuenet/ontop/user_profiles> . ?T1 <http://valuenet/ontop/followers> ?T1_followers . ?T1 <http://valuenet/ontop/followers> ?T1_followers . }
