nl_question,sparql_partial_uri,sparql_complete_uri
"Show the name, open date, and organizer for all churches.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_open_date ?T1_organized_by WHERE { ?T1 a :church . ?T1 :name ?T1_name . ?T1 :open_date ?T1_open_date . ?T1 :organized_by ?T1_organized_by . }",SELECT ?T1_name ?T1_open_date ?T1_organized_by WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . ?T1 <http://valuenet/ontop/organized_by> ?T1_organized_by . }
List all church names in descending order of opening date.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :church . ?T1 :name ?T1_name . ?T1 :open_date ?T1_open_date . } ORDER BY DESC (?T1_open_date)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . } ORDER BY DESC (?T1_open_date)
Show the opening year in whcih at least two churches opened.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_open_date WHERE { ?T1 a :church . ?T1 :open_date ?T1_open_date . } GROUP BY ?T1_open_date HAVING(count( *) >= 2)",SELECT ?T1_open_date WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . } GROUP BY ?T1_open_date HAVING(count( *) >= 2)
Show the organizer and name for churches that opened between 1830 and 1840.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_organized_by ?T1_name WHERE { ?T1 a :church . ?T1 :organized_by ?T1_organized_by . ?T1 :name ?T1_name . ?T1 :open_date ?T1_open_date . FILTER(?T1_open_date >= 1830 && ?T1_open_date <= 1840) . }",SELECT ?T1_organized_by ?T1_name WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/organized_by> ?T1_organized_by . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . FILTER(?T1_open_date >= 1830 && ?T1_open_date <= 1840) . }
Show all opening years and the number of churches that opened in that year.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_open_date (count( *) as ?aggregation_all) WHERE { ?T1 a :church . ?T1 :open_date ?T1_open_date . } GROUP BY ?T1_open_date",SELECT ?T1_open_date (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . } GROUP BY ?T1_open_date
Show the name and opening year for three churches that opened most recently.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_open_date WHERE { ?T1 a :church . ?T1 :name ?T1_name . ?T1 :open_date ?T1_open_date . ?T1 :open_date ?T1_open_date . } ORDER BY DESC (?T1_open_date) LIMIT 1",SELECT ?T1_name ?T1_open_date WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . ?T1 <http://valuenet/ontop/open_date> ?T1_open_date . } ORDER BY DESC (?T1_open_date) LIMIT 1
Show the country where people older than 30 and younger than 25 are from.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_country WHERE { ?T1 a :people . ?T1 :country ?T1_country . ?T1 :age ?T1_age . FILTER(?T1_age < 25) . FILTER (?T1_country in (?T2_country)) . ?T2 a :people . ?T2 :country ?T2_country . ?T2 :age ?T2_age . FILTER(?T2_age > 30) . }",SELECT DISTINCT ?T1_country WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age < 25) . FILTER (?T1_country in (?T2_country)) . ?T2 a <http://valuenet/ontop/people> . ?T2 <http://valuenet/ontop/country> ?T2_country . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age > 30) . }
"Show the minimum, maximum, and average age for all people.","PREFIX : <http://valuenet/ontop/>
SELECT (min( ?T1_age) as ?aggregation_T1_age_121 ) (max( ?T1_age) as ?aggregation_T1_age_13 ) (avg( ?T1_age) as ?aggregation_T1_age_30 ) WHERE { ?T1 a :people . ?T1 :age ?T1_age . ?T1 :age ?T1_age . ?T1 :age ?T1_age . }",SELECT (min( ?T1_age) as ?aggregation_T1_age_121 ) (max( ?T1_age) as ?aggregation_T1_age_13 ) (avg( ?T1_age) as ?aggregation_T1_age_30 ) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/age> ?T1_age . }
Show the name and country for all people whose age is smaller than the average.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_country WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :country ?T1_country . ?T1 :age ?T1_age . FILTER(?T1_age < (?aggregation_T22_age_199)) . {SELECT (avg( ?T22_age) as ?aggregation_T22_age_199 ) WHERE { ?T22 a :people . ?T22 :age ?T22_age . } } }",SELECT ?T1_name ?T1_country WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/country> ?T1_country . ?T1 <http://valuenet/ontop/age> ?T1_age . FILTER(?T1_age < (?aggregation_T22_age_199)) . {SELECT (avg( ?T22_age) as ?aggregation_T22_age_199 ) WHERE { ?T22 a <http://valuenet/ontop/people> . ?T22 <http://valuenet/ontop/age> ?T22_age . } } }
Show the pair of male and female names in all weddings after year 2014,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_name WHERE { ?T1 a :people . ?T2 a :wedding . ?T2 :ref-female ?T1 . ?T1 :name ?T1_name . ?T1 :name ?T1_name . ?T2 :year ?T2_year . FILTER(?T2_year > 2014) . }",SELECT ?T1_name ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/wedding> . ?T2 <http://valuenet/ontop/ref-female> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/year> ?T2_year . FILTER(?T2_year > 2014) . }
Show the name and age for all male people who don't have a wedding.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_age WHERE { ?T1 a :people . ?T1 :name ?T1_name . ?T1 :age ?T1_age . ?T1 :is_male ?T1_is_male . ?T1 :people_id ?T1_people_id . FILTER(?T1_is_male = 'T' && ?T1_people_id not in (?T22_male_id)) . {SELECT ?T22_male_id WHERE { ?T22 a :wedding . ?T22 :male_id ?T22_male_id . } } }",SELECT ?T1_name ?T1_age WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/age> ?T1_age . ?T1 <http://valuenet/ontop/is_male> ?T1_is_male . ?T1 <http://valuenet/ontop/people_id> ?T1_people_id . FILTER(?T1_is_male = 'T' && ?T1_people_id not in (?T22_male_id)) . {SELECT ?T22_male_id WHERE { ?T22 a <http://valuenet/ontop/wedding> . ?T22 <http://valuenet/ontop/male_id> ?T22_male_id . } } }
Show all church names except for those that had a wedding in year 2015.,"PREFIX : <http://valuenet/ontop/>
SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a :church . ?T1 :name ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a :church . ?T3 a :wedding . ?T3 :ref-church ?T2 . ?T2 :name ?T2_name . ?T3 :year ?T3_year . FILTER(?T3_year = 2015) . } } }",SELECT distinct?col1 WHERE { { SELECT (?T1_name as ?col1) WHERE { ?T1 a <http://valuenet/ontop/church> . ?T1 <http://valuenet/ontop/name> ?T1_name . }} MINUS {SELECT (?T2_name as ?col1) WHERE { ?T2 a <http://valuenet/ontop/church> . ?T3 a <http://valuenet/ontop/wedding> . ?T3 <http://valuenet/ontop/ref-church> ?T2 . ?T2 <http://valuenet/ontop/name> ?T2_name . ?T3 <http://valuenet/ontop/year> ?T3_year . FILTER(?T3_year = 2015) . } } }
Show all church names that have hosted least two weddings.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :church . ?T2 a :wedding . ?T2 :ref-church ?T1 . ?T1 :name ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/church> . ?T2 a <http://valuenet/ontop/wedding> . ?T2 <http://valuenet/ontop/ref-church> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . } GROUP BY ?T1_name HAVING(count( *) >= 2)
Show the names for all females from Canada having a wedding in year 2016.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :people . ?T2 a :wedding . ?T2 :ref-female ?T1 . ?T1 :name ?T1_name . ?T2 :year ?T2_year . ?T1 :is_male ?T1_is_male . ?T1 :country ?T1_country . FILTER(?T2_year = 2016 && ?T1_is_male = 'F' && ?T1_country = 'Canada') . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/people> . ?T2 a <http://valuenet/ontop/wedding> . ?T2 <http://valuenet/ontop/ref-female> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/year> ?T2_year . ?T1 <http://valuenet/ontop/is_male> ?T1_is_male . ?T1 <http://valuenet/ontop/country> ?T1_country . FILTER(?T2_year = 2016 && ?T1_is_male = 'F' && ?T1_country = 'Canada') . }
Show the church names for the weddings of all people older than 30.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :church . ?T13 a :wedding . ?T13 :ref-church ?T1 . ?T1 :name ?T1_name . ?T2 :age ?T2_age . ?T2 :age ?T2_age . ?T2 a :people . ?T13 :ref-female ?T2 . ?T1 :name ?T1_name . ?T2 :age ?T2_age . ?T2 :age ?T2_age . FILTER(?T2_age > 30 || ?T2_age > 30) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/church> . ?T13 a <http://valuenet/ontop/wedding> . ?T13 <http://valuenet/ontop/ref-church> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/age> ?T2_age . ?T2 <http://valuenet/ontop/age> ?T2_age . ?T2 a <http://valuenet/ontop/people> . ?T13 <http://valuenet/ontop/ref-female> ?T2 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/age> ?T2_age . ?T2 <http://valuenet/ontop/age> ?T2_age . FILTER(?T2_age > 30 || ?T2_age > 30) . }
Show all countries and the number of people from each country.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a :people . ?T1 :country ?T1_country . } GROUP BY ?T1_country",SELECT ?T1_country (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/people> . ?T1 <http://valuenet/ontop/country> ?T1_country . } GROUP BY ?T1_country
