nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of submissions.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :submission . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/submission> . }
List the authors of submissions in ascending order of scores.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :author ?T1_author . ?T1 :scores ?T1_scores . } ORDER BY ASC (?T1_scores)",SELECT ?T1_author WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T1 <http://valuenet/ontop/scores> ?T1_scores . } ORDER BY ASC (?T1_scores)
"For each submission, show the author and their affiliated college.","PREFIX : <http://valuenet/ontop/>
SELECT ?T1_author ?T1_college WHERE { ?T1 a :submission . ?T1 :author ?T1_author . ?T1 :college ?T1_college . }",SELECT ?T1_author ?T1_college WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T1 <http://valuenet/ontop/college> ?T1_college . }
Show the names of authors from college 'Florida' or 'Temple',"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :author ?T1_author . ?T1 :college ?T1_college . ?T1 :college ?T1_college . FILTER(?T1_college = 'Florida' || ?T1_college = 'Temple') . }",SELECT ?T1_author WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T1 <http://valuenet/ontop/college> ?T1_college . ?T1 <http://valuenet/ontop/college> ?T1_college . FILTER(?T1_college = 'Florida' || ?T1_college = 'Temple') . }
Compute the average score of submissions.,"PREFIX : <http://valuenet/ontop/>
SELECT (avg( ?T1_scores) as ?aggregation_T1_scores_167 ) WHERE { ?T1 a :submission . ?T1 :scores ?T1_scores . }",SELECT (avg( ?T1_scores) as ?aggregation_T1_scores_167 ) WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/scores> ?T1_scores . }
Find the author who achieved the highest score in a submission.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :author ?T1_author . ?T1 :scores ?T1_scores . } ORDER BY DESC (?T1_scores) LIMIT 1",SELECT ?T1_author WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T1 <http://valuenet/ontop/scores> ?T1_scores . } ORDER BY DESC (?T1_scores) LIMIT 1
Show different colleges along with the number of authors of submission from each college.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :submission . ?T1 :college ?T1_college . } GROUP BY ?T1_college",SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/college> ?T1_college . } GROUP BY ?T1_college
Show the most common college of authors of submissions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a :submission . ?T1 :college ?T1_college . } GROUP BY ?T1_college ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_college (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/college> ?T1_college . } GROUP BY ?T1_college ORDER BY DESC (?aggregation_all) LIMIT 1
Show the colleges that have both authors with submission score larger than 90 and authors with submission score smaller than 80.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_college WHERE { ?T1 a :submission . ?T1 :college ?T1_college . ?T1 :scores ?T1_scores . FILTER(?T1_scores > 90) . FILTER (?T1_college in (?T2_college)) . ?T2 a :submission . ?T2 :college ?T2_college . ?T2 :scores ?T2_scores . FILTER(?T2_scores < 80) . }",SELECT DISTINCT ?T1_college WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/college> ?T1_college . ?T1 <http://valuenet/ontop/scores> ?T1_scores . FILTER(?T1_scores > 90) . FILTER (?T1_college in (?T2_college)) . ?T2 a <http://valuenet/ontop/submission> . ?T2 <http://valuenet/ontop/college> ?T2_college . ?T2 <http://valuenet/ontop/scores> ?T2_scores . FILTER(?T2_scores < 80) . }
Show the authors of submissions and the acceptance results of their submissions.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_author ?T2_result WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :ref-submission ?T1 . ?T1 :author ?T1_author . ?T2 :result ?T2_result . }",SELECT ?T1_author ?T2_result WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T2 a <http://valuenet/ontop/acceptance> . ?T2 <http://valuenet/ontop/ref-submission> ?T1 . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T2 <http://valuenet/ontop/result> ?T2_result . }
Show the result of the submission with the highest score.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_result WHERE { ?T1 a :acceptance . ?T2 a :submission . ?T1 :ref-submission ?T2 . ?T1 :result ?T1_result . ?T2 :scores ?T2_scores . } ORDER BY DESC (?T2_scores) LIMIT 1",SELECT ?T1_result WHERE { ?T1 a <http://valuenet/ontop/acceptance> . ?T2 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/ref-submission> ?T2 . ?T1 <http://valuenet/ontop/result> ?T1_result . ?T2 <http://valuenet/ontop/scores> ?T2_scores . } ORDER BY DESC (?T2_scores) LIMIT 1
Show each author and the number of workshops they submitted to.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_author (count(DISTINCT ?T2_workshop_id) as ?aggregation_T2_workshop_id_107 ) WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :ref-submission ?T1 . ?T1 :author ?T1_author . ?T2 :workshop_id ?T2_workshop_id . } GROUP BY ?T1_author",SELECT DISTINCT ?T1_author (count(DISTINCT ?T2_workshop_id) as ?aggregation_T2_workshop_id_107 ) WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T2 a <http://valuenet/ontop/acceptance> . ?T2 <http://valuenet/ontop/ref-submission> ?T1 . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T2 <http://valuenet/ontop/workshop_id> ?T2_workshop_id . } GROUP BY ?T1_author
How many workshops did each author submit to? Return the author name and the number of workshops.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_author (count(DISTINCT ?T2_workshop_id) as ?aggregation_T2_workshop_id_15 ) WHERE { ?T1 a :submission . ?T2 a :acceptance . ?T2 :ref-submission ?T1 . ?T1 :author ?T1_author . ?T2 :workshop_id ?T2_workshop_id . } GROUP BY ?T1_author",SELECT DISTINCT ?T1_author (count(DISTINCT ?T2_workshop_id) as ?aggregation_T2_workshop_id_15 ) WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T2 a <http://valuenet/ontop/acceptance> . ?T2 <http://valuenet/ontop/ref-submission> ?T1 . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T2 <http://valuenet/ontop/workshop_id> ?T2_workshop_id . } GROUP BY ?T1_author
Show the date and venue of each workshop in ascending alphabetical order of the venue.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_date ?T1_venue WHERE { ?T1 a :workshop . ?T1 :date ?T1_date . ?T1 :venue ?T1_venue . ?T1 :venue ?T1_venue . } ORDER BY ASC (?T1_venue)",SELECT ?T1_date ?T1_venue WHERE { ?T1 a <http://valuenet/ontop/workshop> . ?T1 <http://valuenet/ontop/date> ?T1_date . ?T1 <http://valuenet/ontop/venue> ?T1_venue . ?T1 <http://valuenet/ontop/venue> ?T1_venue . } ORDER BY ASC (?T1_venue)
List the authors who do not have submission to any workshop.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_author WHERE { ?T1 a :submission . ?T1 :author ?T1_author . ?T1 :submission_id ?T1_submission_id . FILTER(?T1_submission_id not in (?T22_submission_id)) . {SELECT ?T22_submission_id WHERE { ?T22 a :acceptance . ?T22 :submission_id ?T22_submission_id . } } }",SELECT ?T1_author WHERE { ?T1 a <http://valuenet/ontop/submission> . ?T1 <http://valuenet/ontop/author> ?T1_author . ?T1 <http://valuenet/ontop/submission_id> ?T1_submission_id . FILTER(?T1_submission_id not in (?T22_submission_id)) . {SELECT ?T22_submission_id WHERE { ?T22 a <http://valuenet/ontop/acceptance> . ?T22 <http://valuenet/ontop/submission_id> ?T22_submission_id . } } }
