nl_question,sparql_partial_uri,sparql_complete_uri
Count the number of wrestlers.,"PREFIX : <http://valuenet/ontop/>
SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a :wrestler . }",SELECT (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/wrestler> . }
List the names of wrestlers in descending order of days held.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :name ?T1_name . ?T1 :days_held ?T1_days_held . } ORDER BY DESC (?T1_days_held)",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/days_held> ?T1_days_held . } ORDER BY DESC (?T1_days_held)
Return the name of the wrestler who had the lowest number of days held.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :name ?T1_name . ?T1 :days_held ?T1_days_held . } ORDER BY ASC (?T1_days_held) LIMIT 1",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/days_held> ?T1_days_held . } ORDER BY ASC (?T1_days_held) LIMIT 1
"Give the different reigns of wrestlers who are not located in Tokyo, Japan.","PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_reign WHERE { ?T1 a :wrestler . ?T1 :reign ?T1_reign . ?T1 :location ?T1_location . FILTER(?T1_location != 'Tokyo , Japan') . }","SELECT DISTINCT ?T1_reign WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/reign> ?T1_reign . ?T1 <http://valuenet/ontop/location> ?T1_location . FILTER(?T1_location != 'Tokyo , Japan') . }"
Give the names and locations of all wrestlers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T1_location WHERE { ?T1 a :wrestler . ?T1 :name ?T1_name . ?T1 :location ?T1_location . }",SELECT ?T1_name ?T1_location WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/location> ?T1_location . }
Return the elimination movies of wrestlers on Team Orton.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_elimination_move WHERE { ?T1 a :elimination . ?T1 :elimination_move ?T1_elimination_move . ?T1 :team ?T1_team . FILTER(?T1_team = 'Team Orton') . }",SELECT ?T1_elimination_move WHERE { ?T1 a <http://valuenet/ontop/elimination> . ?T1 <http://valuenet/ontop/elimination_move> ?T1_elimination_move . ?T1 <http://valuenet/ontop/team> ?T1_team . FILTER(?T1_team = 'Team Orton') . }
Give the names of wrestlers and their elimination moves.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_elimination_move WHERE { ?T1 a :wrestler . ?T2 a :elimination . ?T2 :ref-wrestler ?T1 . ?T1 :name ?T1_name . ?T2 :elimination_move ?T2_elimination_move . }",SELECT ?T1_name ?T2_elimination_move WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T2 a <http://valuenet/ontop/elimination> . ?T2 <http://valuenet/ontop/ref-wrestler> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/elimination_move> ?T2_elimination_move . }
List the names of wrestlers and the teams in elimination in descending order of days held.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name ?T2_team WHERE { ?T1 a :wrestler . ?T2 a :elimination . ?T2 :ref-wrestler ?T1 . ?T1 :name ?T1_name . ?T2 :team ?T2_team . ?T1 :days_held ?T1_days_held . } ORDER BY DESC (?T1_days_held)",SELECT ?T1_name ?T2_team WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T2 a <http://valuenet/ontop/elimination> . ?T2 <http://valuenet/ontop/ref-wrestler> ?T1 . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T2 <http://valuenet/ontop/team> ?T2_team . ?T1 <http://valuenet/ontop/days_held> ?T1_days_held . } ORDER BY DESC (?T1_days_held)
List the time of elimination of the wrestlers with largest days held.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_time WHERE { ?T1 a :elimination . ?T2 a :wrestler . ?T1 :ref-wrestler ?T2 . ?T1 :time ?T1_time . ?T2 :days_held ?T2_days_held . } ORDER BY DESC (?T2_days_held) LIMIT 1",SELECT ?T1_time WHERE { ?T1 a <http://valuenet/ontop/elimination> . ?T2 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/ref-wrestler> ?T2 . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T2 <http://valuenet/ontop/days_held> ?T2_days_held . } ORDER BY DESC (?T2_days_held) LIMIT 1
Show different teams in eliminations and the number of eliminations from each team.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a :elimination . ?T1 :team ?T1_team . } GROUP BY ?T1_team",SELECT ?T1_team (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/elimination> . ?T1 <http://valuenet/ontop/team> ?T1_team . } GROUP BY ?T1_team
Show teams that have suffered more than three eliminations.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_team WHERE { ?T1 a :elimination . ?T1 :team ?T1_team . } GROUP BY ?T1_team HAVING(count( *) > 3)",SELECT ?T1_team WHERE { ?T1 a <http://valuenet/ontop/elimination> . ?T1 <http://valuenet/ontop/team> ?T1_team . } GROUP BY ?T1_team HAVING(count( *) > 3)
Show the reign and days held of wrestlers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_reign ?T1_days_held WHERE { ?T1 a :wrestler . ?T1 :reign ?T1_reign . ?T1 :days_held ?T1_days_held . }",SELECT ?T1_reign ?T1_days_held WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/reign> ?T1_reign . ?T1 <http://valuenet/ontop/days_held> ?T1_days_held . }
Return the names of wrestlers with fewer than 100 days held.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :name ?T1_name . ?T1 :days_held ?T1_days_held . FILTER(?T1_days_held < 100) . }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/days_held> ?T1_days_held . FILTER(?T1_days_held < 100) . }
Please show the most common reigns of wrestlers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_reign (count( *) as ?aggregation_all) WHERE { ?T1 a :wrestler . ?T1 :reign ?T1_reign . } GROUP BY ?T1_reign ORDER BY DESC (?aggregation_all) LIMIT 1",SELECT ?T1_reign (count( *) as ?aggregation_all) WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/reign> ?T1_reign . } GROUP BY ?T1_reign ORDER BY DESC (?aggregation_all) LIMIT 1
List the locations that are shared by more than two wrestlers.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_location WHERE { ?T1 a :wrestler . ?T1 :location ?T1_location . } GROUP BY ?T1_location HAVING(count( *) > 2)",SELECT ?T1_location WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/location> ?T1_location . } GROUP BY ?T1_location HAVING(count( *) > 2)
List the names of wrestlers that have not been eliminated.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_name WHERE { ?T1 a :wrestler . ?T1 :name ?T1_name . ?T1 :wrestler_id ?T1_wrestler_id . FILTER(?T1_wrestler_id not in (?T22_wrestler_id)) . {SELECT ?T22_wrestler_id WHERE { ?T22 a :elimination . ?T22 :wrestler_id ?T22_wrestler_id . } } }",SELECT ?T1_name WHERE { ?T1 a <http://valuenet/ontop/wrestler> . ?T1 <http://valuenet/ontop/name> ?T1_name . ?T1 <http://valuenet/ontop/wrestler_id> ?T1_wrestler_id . FILTER(?T1_wrestler_id not in (?T22_wrestler_id)) . {SELECT ?T22_wrestler_id WHERE { ?T22 a <http://valuenet/ontop/elimination> . ?T22 <http://valuenet/ontop/wrestler_id> ?T22_wrestler_id . } } }
Show the teams that have both wrestlers eliminated by 'Orton' and wrestlers eliminated by 'Benjamin'.,"PREFIX : <http://valuenet/ontop/>
SELECT DISTINCT ?T1_team WHERE { ?T1 a :elimination . ?T1 :team ?T1_team . ?T1 :eliminated_by ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Orton') . FILTER (?T1_team in (?T2_team)) . ?T2 a :elimination . ?T2 :team ?T2_team . ?T2 :eliminated_by ?T2_eliminated_by . FILTER(?T2_eliminated_by = 'Benjamin') . }",SELECT DISTINCT ?T1_team WHERE { ?T1 a <http://valuenet/ontop/elimination> . ?T1 <http://valuenet/ontop/team> ?T1_team . ?T1 <http://valuenet/ontop/eliminated_by> ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Orton') . FILTER (?T1_team in (?T2_team)) . ?T2 a <http://valuenet/ontop/elimination> . ?T2 <http://valuenet/ontop/team> ?T2_team . ?T2 <http://valuenet/ontop/eliminated_by> ?T2_eliminated_by . FILTER(?T2_eliminated_by = 'Benjamin') . }
Show the times of elimination by 'Punk' or 'Orton'.,"PREFIX : <http://valuenet/ontop/>
SELECT ?T1_time WHERE { ?T1 a :elimination . ?T1 :time ?T1_time . ?T1 :eliminated_by ?T1_eliminated_by . ?T1 :eliminated_by ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Punk' || ?T1_eliminated_by = 'Orton') . }",SELECT ?T1_time WHERE { ?T1 a <http://valuenet/ontop/elimination> . ?T1 <http://valuenet/ontop/time> ?T1_time . ?T1 <http://valuenet/ontop/eliminated_by> ?T1_eliminated_by . ?T1 <http://valuenet/ontop/eliminated_by> ?T1_eliminated_by . FILTER(?T1_eliminated_by = 'Punk' || ?T1_eliminated_by = 'Orton') . }
